[
  {
    "title": "WASH Technical Program Manager",
    "company": "World Vision",
    "location": "Bujumbura",
    "description": "With over 70 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith.  Come join our 33,000+ staff working in nearly 100 countries and share the joy of transforming vulnerable childrens life stories!  Employee Contract Type  Local - Fixed Term Employee (Fixed Term)  Job Description  Major Activities  Provide technical and strategic leadership in the planning, implementation and monitoring of the Sanitation, Hygiene and Water program in compliance with donors requirements, WV and government policies and global standards.  Communicate program goals and objectives with key team members, stakeholders at national level, local and central government and international community.  Lead the technical working group to develop winning and high level Sanitation, Hygiene and Water Technical Programs, Concept papers and... proposals.  Represent the organization in major WASH program/project decision making forums and provide project-level and field-level capacity building for the field level Sanitation, Hygiene staff, communities and local government.  Undertake and assist with assessment of local conditions resulting from emergency situations affecting children and mothers, including determination of priorities for interventions, preparation Sanitation, Hygiene and Water project proposals for emergency assistance, and other related documentation as necessary  Foster, develop and maintain strong partnership relationships and regular contact with national and international NGOs, UN agencies, government officials, and other stakeholders working to serve as a network for obtaining and coordinating information and services to support Sanitation, Hygiene and Water interventions  Foster, develop and maintain partnership relationships with national partners and communities to assess the effectiveness of current Sanitation, Hygiene and Water projects and to identify possibilities for new Sanitation, Hygiene and Water projects.  Provide technical support in preparation of divisional strategies, annual operational plan and budget, support the development, review and implementation of new project models, innovations, pilots, guidelines, and methodologies to help decision-making in a consistent, coordinated and scientific manner. And further promote inclusion of major cross cutting themes including environment, gender, protection, disability, peace building and core values of the organization within the Sanitation, Hygiene and Water Sector.  Ensure the implementations of all Sanitation, Hygiene and Water programs of the organization are in compliance with their plan, work schedule, budget and quality to ensure proper accountability to donors, support offices, government and the benefiting community.  Ensure mentoring and coaching for performance is undertaken for direct reports.  Knowledge, Skills And Abilities  Minimum education, training and experience requirements to qualify for the position:  University Degree in Environmental Sanitation, Water Resource Engineering & related engineering fields.  5 years relevant experience in Sanitation, Hygiene and Water in an international NGO or similar organization with minimum of 2 years managerial position  Technical Skills & Abilities  License, registration, or certification required to perform this position:  Proven experience of managing donor(s) funded projects or programs;  Working knowledge of proposal writing and negotiation skills  Good computer skills including MS Word , Excel and internet;  Knowledge and Experience in CLTS-H, SLTS-H, DBC Framework, and PHAST;  Proven knowledge of community development; Appropriate skills and experience in the capacity building and training of staff and partners;  Experience in monitoring and evaluation;  Experience in budget preparation and report writing;  Fluent in oral and written English and French.  Good understanding of World Vision and Sphere relief standards.  Knowledge of and adherence to the Red Cross and NGO Code of Conduct.  Ability to exhibit exemplary lifestyle as interpreted in specific local cultural context  Applicant Types Accepted  Local Applicants Only"
  },
  {
    "title": "Sanitation and Hygien Promotion Coordinator",
    "company": "World Vision",
    "location": "Bujumbura",
    "description": "With over 70 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith.  Come join our 33,000+ staff working in nearly 100 countries and share the joy of transforming vulnerable childrens life stories!  Employee Contract Type  Local - Fixed Term Employee (Fixed Term)  Purpose  Job Description:  Providing technical support and capacity building to WASH and Health Coordinators in the implementation of sanitation, hygiene and behavior change for communities. Sanitation and hygiene infrastructure, community preparedness and engagement with partners, community appraisal and certification, supporting market assessments and building capacity in local entrepreneurs are the core functions to ensure all communities reach sanitation and hygiene coverage as well as contribute to ministry in the area of WASH.  Major... Responsibilities  Initiate/ participate in WASH staff capacity building  Provide support to the APs on sanitation and hygiene infrastructure at household level in collaboration with partners.  Develop and support the implementation of a contextualized WASH BCC strategy  Engage, liaise and networking with National, Commune and Provincial level partners collaborating on sanitation and hygiene in the APs who are implementing similar interventions.  Plan, organize and ensure that all sanitation and hygiene activities are implemented for the targeted APs to reach the universal coverage in line with plan and budget for the programme.  Coordinate the process of obtaining AP baseline data for sanitation and hygiene indicators along with market assessments to support project monitoring and evaluation.  Preparation of Project plans, reports, supporting iDE work, and review of APs reports, for maximum compliance with the set standards and follow up its implementation.  Engage in reviewing activity vs. budget plan in a quarterly basis to monitor the activity progress and budget utilization.  Participate in WASH forums with key stakeholders for strategic planning, policy influence and private public partnerships.  Support the development of sanitation and hygiene manuals and information, education and communication materials including key approaches of behavioral change and hygiene promotion for dissemination with partners.  Identify keys issues, challenges and Risks in WASH sector and provide guidance to national office tentative solutions and risks management  Together with RAM Team, plan and conduct both external engagement and proposal development for ministry growth  The following may be acquired through a combination of formal or self-education, prior experience or on-the-job training:  Degree in Environmental Health or Public Health, Water Engineering, Social Sciences, business, marketing or any other related discipline  Masters Degree an added advantage  At least five years hands on experience in working with rural or peri-urban WASH programs.  Experience in WASH behavior change communication  Good community participatory skills.  Experience in networking is necessary.  Experience in using Microsoft Office (Word, Access, Excel.)  Excellent skills in report writing.  Excellent communication and human relations skills.  NGO or related private sector experience is also preferred  Working Environment / Conditions  Work environment: Office-based with 30% travel to the field.  Travel: Domestic/international travel is required.  On call: 10"
  },
  {
    "title": "Maintenance Lead",
    "company": "Amazi Water",
    "location": "Gitega",
    "description": "Vacancy Announcement  Maintenance Lead  Organization  AMAZI WATER  Position Title  Maintenance Lead  Reporting To  Regional Manager  Duty Station  Burundi  Starting Date  Immediately  About us:  AMAZI WATER is the primary, in-country partner for clean water projects in Burundi. In collaboration with others, we are developing a national water strategy with the goal of providing sustainable access to clean water in every community by the end of 2028.  About the Role:  A Maintenance Lead coordinates repair and maintenance for all AMAZI WATER boreholes in Burundi.  CORE RESPONSIBILITIES:  Responsible for timely and accurate repairs and maintenance of all borehole handpumps and electrical installations within AMAZI water.  Coordinate, lead, and train small teams of fieldworkers and guiding them in their day-to-day operations.  Create an information system to get an accurate picture on the status of all boreholes.  Requisition of necessary tools, equipment, and supplies.  Joining... maintenance teams on field visits on a regular basis. This might involve spending some nights up country.  Building relationship with local authorities, communities, and local NGOs for smooth project implementation.  REQUIREMENTS FOR THIS POSITION:  Educational level required:  A Bachelors degree in mechanical engineering or water related field  Masters Degree preferred.  Skills:  Excellent communication skills,  the ability to plan and organize,  The ability of good documentation, good analytical skills,  the ability to delegate,  Taking initiative and give advice in job related matters,  Role Specific Knowledge & Experience:  Minimum 3 years experience in a maintenance related job, preferably in water supply.  1 year experience in coordinating a small team.  Good knowledge of Microsoft Excel  In possession of a drivers license  Good communication skills in both English and Kirundi  All Employees at amazi water must demonstrate the following qualities:  A love for Burundi  love for Jesus Christ  A Professional fluency of French, English, and Kirundi  Proficiency with email, Excel & Word  Ability with community development and social work  Ability with communicating with government offices and partners.  Understanding of the need and benefit of clean water.  Submission of Application:  Eligible candidates are kindly requested to submit a completed AMAZI Water application by December 12th, 2023.  We may close the application early if we receive sufficient applications before the closing date.  Only candidates who meet the above criteria will be contacted. Eligible candidates applications will be kept for 12 months"
  },
  {
    "title": "Maintenance Technician",
    "company": "Amazi Water",
    "location": "Gitega",
    "description": "Vacancy Announcement  Maintenance Technician  Organization  AMAZI WATER  Position Title  Maintenance Technician  Reporting To  Regional Manager  Duty Station  Gitega  Starting Date  ASAP  About us:  AMAZI WATER is the primary, in-country partner for clean water projects in Burundi. In collaboration with others, we are developing a national water strategy with the goal of providing sustainable access to clean water in every community by the end of 2028.  About the Role:  The Maintenance Technician ensures proper maintenance and use of hand pumps and other WASH equipment, provides guidance on appropriate techniques and materials for hand pump repairs, and provides training for maintenance helpers. Organize a follow-up system for wells monitoring and maintenance and community needs.  CORE RESPONSIBILITIES:  Performs a variety of maintenance-skilled duties involving the inspection, diagnosis, pump issues, repair, and servicing of field and shop equipment,  Repairs and maintains pumps... and wells,  Organizes and conducts pump testing using various head and flow instruments for wells,  Installs, maintains, and repairs equipment,  Ensures timely and accurate completion of preventative maintenance activities, maintains detailed record-keeping on maintenance and pump management,  Requisitions necessary tools, equipment, and supplies,  Rebuilds existing pumps and wells facilities.  Conducts monitoring visits to follow up functionality of the water committee,  Builds relationships with local authorities and communities for smooth project implementation,  Responds to emergency situations as necessary,  Works to ensure the communitys safety water provision is carried out,  Performs related duties as assigned.  REQUIREMENTS FOR THIS POSITION:  Educational level required:  Bachelor of Science degree certificate in mechanical area or related field or other similar degree  Skills:  Practicing accountability & integrity  Communicating information effectively  Learning for growth & development  Building collaborative relationships  Role Specific Knowledge & Experience:  Build the relationship with authorities and communities, and to do community mobilization  Understanding Amazi Waters mission & operations  Speak and write Kirundi, French, and English  Spend 4 days upcountry including overnights  Make a comprehensive report  Computer literacy in Microsoft Word and Excel  Experience in Hand Pump (India Mark II) maintenance or installation and other related fields will be an added value,  1 year experience in social mobilization and local NGO experience preferred  All Employees at Amazi Water must demonstrate the following qualities:  A love for Burundi  love for Jesus Christ  A Professional fluency of French, English, and Kirundi  Proficiency with email, Excel & Word  Ability with community development and social work  Ability with communicating with government offices and partners.  Understanding of the need and benefit of clean water.  Submission of Application:  Eligible candidates are kindly requested to submit a completed AMAZI Water application by December 12th, 2023.  We may close the application early if we receive sufficient applications before the closing date.  Only candidates who meet the above criteria will be contacted. Eligible candidates applications will be kept for 12 months"
  }
]