[
  {
    "title": "WUC Cashier Service Centre",
    "company": "waterutili",
    "location": "Tshabong",
    "description": "CASHIER x 4  Closing date: 13 December 2023  Description  Water Utilities Corporation (WUC) is one of the leaders in the water supply industry in the region and strives to be the best internationally. The Corporation prides itself in employing the best human resource capital available to effectively deliver on its mandate and ultimately attain its aspirations. WUC would like to invite suitably qualified individuals who wish to join an employer of choice and meet the profile, to apply to be considered for the below position based at Tsabong, Kasane, Palapye and Tonota.  Position Purpose  CASHIER  Position Purpose  To maximise revenue by accurately carrying out receipting and allocating monies in to appropriate customer accounts and by performing update of customer data in SAP R 3  Position Key Responsibilities  Position Key Responsibilities  Receipting  Service Order Management  Customer Service  People Management and Functional Effectiveness  Compliance and... Governance  Culture  Position Outcomes & Measures  Position Outcomes & Measures  Accurate receipting  Risk Management  Effective daily banking and reconciliations  Adequate vetting of new accounts  Adherence to Financial policy  Qualifications and Experience  Qualifications and Experience  Qualifications:  Diploma in Accounting and Business Studies, Accounting, Finance or related field  Experience:  2 years relevant experience  Computer literacy  Competencies  Computer literacy Service Order Management Customer Service  Remuneration  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 25 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid  Closing Date  Interested Botswana citizens should address their cover letter to:  Human Resource Director  Water Utilities Corporation  Private Bag 00276  Gaborone  AND  Attach a comprehensive Curriculum Vitae (C.V), certified copies of certificates, National Identity Card (Omang) as well as professional references and names and addresses of two referees.  NB: Cover letter, certificates, identity card (omang), and references should be scanned as one document and uploaded with the cover letter.  Only shortlisted candidates will be responded to.  No Physical applications will be accepted"
  },
  {
    "title": "Assistant Artisan (Mechanical)  Water Utilities Corporation",
    "company": "Water Utilities Corporation",
    "location": "Gaborone",
    "description": "Location: Kasane, BW Maun, BW  Company: waterutili  Vacancy: Assistant Artisan (Mechanical)  Closing Date: 13 December 2023  Position Purpose  Artisan Assistant Mechanical  Position Purpose  This role is responsible for installing, maintaining and repairing Mechanical plant and equipment, and associated machinery to maximise availability of plant and equipment in line with safety and environmental standards and procedures.  Key Responsibilities  Key Responsibilities  Assist in performing routine mechanical maintenance work, welding, or machining including lubrication, inspection, and replacement of parts  Safe operation of plant and equipment by collecting data and effecting repairs as directed.  Timeous execution of scheduled tasks.  Completion and update of daily plant maintenance orders as directed.  Carry out preventative maintenance.  Use equipment according to manufacturers specifications for optimal safety and performance.  Keep workplace, tools and equipment in a clean and... safe condition.  Assist in the installation of potable water and wastewater treatment plant equipment  Adhere to safe work practices and procedures including, but not limited to lockout or tag out and confined space rules and regulations.  Outcome & Measures  Outcome & Measures  Equipment and plant availability  Compliance to standards and safety procedures  Customer Satisfaction  Timeous execution of maintenance works  Qualifications & Experience  Qualifications & Experience  Junior Certificate (JC), Trade Test B in Mechanical, Machine Fitting, Borehole and Maintenance  Experience  Direct Entry  Technical Competencies  Standards and Procedures adherence  Operations and Control  Maintenance and Risk  Compliance and Governance  Remuneration  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 20 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid  Closing Date  Interested Botswana citizens should address their cover letter to:  Human Resource Director  Water Utilities Corporation  Private Bag 00276  Gaborone  AND  Attach a comprehensive Curriculum Vitae (C.V), certified copies of certificates, National Identity Card (Omang) as well as professional references and names and addresses of two referees.  NB: Cover letter, certificates, identity card (omang), and references should be scanned as one document and uploaded with the cover letter.  Only shortlisted candidates will be responded to.  No Physical applications will be accepted.  APPLY FOR THIS JOB"
  },
  {
    "title": "WUC Coordinator: Meter Reading",
    "company": "waterutili",
    "location": "Palapye",
    "description": "Long Description  Closing Date: 13 December 2023  Long Description  Water Utilities Corporation (WUC) is one of the leaders in the water supply industry in the region and strives to be the best internationally. The Corporation prides itself in employing the best human resource capital available to effectively deliver on its mandate and ultimately attain its aspirations. WUC would like to invite suitably qualified individuals who wish to join an employer of choice and meet the profile, to apply to be considered for the below position based at Tsabong, Molepolole and Palapye.  Long Description  Coordinator: Meter Reading  Position Purpose  This role maximizes revenue and customer satisfaction by ensuring accurate recording of meter readings, completion of meter reading cycle as per set targets and effective planning, coordination and supervision of meter reading activities.  Long Description  Key Responsibilities  Operational and Quality Assurance  Service Order Management  Customer... Service  People Management and Functional Effectiveness  Compliance and Governance  Culture  Long Description  Outputs & Measures  Meter reading process efficiency  Timely and accurate meter reading  Availability of meter reading teams  Effective workforce scheduling and demand planning  Effective resolution of exception reports  Long Description  Qualifications:  Diploma in Accounting or related field  Experience:  2 years related experience  Competencies  Service Order Management Customer Service Computer literacy  Skills  Principles of accounting, internal controls, billing, auditing Ability to read and navigate geographical maps/route navigation Ability to communicate effectively, verbally and in writing  Long Description  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 25 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid  Long Description  Interested Botswana citizens should address their cover letter to:  Human Resource Director  Water Utilities Corporation  Private Bag 00276  Gaborone  AND  Attach a comprehensive Curriculum Vitae (C.V), certified copies of certificates, National Identity Card (Omang) as well as professional references and names and addresses of two referees.  NB: Cover letter, certificates, identity card (omang), and references should be scanned as one document and uploaded with the cover letter.  Only shortlisted candidates will be responded to.  No Physical applications will be accepted"
  },
  {
    "title": "Maintenance Mechanical Artisan",
    "company": "Water Utilities Corporation (WUC)",
    "location": "Botswana",
    "description": "WUC Production and Distribution : Maintenance Mechanical Artisan  Date: Nov 29, 2023  Location: Moshopa, BW Shakawe, BW Kasane, BW  Company: water utilities  Closing date: 13 December 2023  Position Purpose:  This role is responsible for undertaking equipment service, repair and fitting of potable water and wastewater treatment plant equipment, machinery and related facilities, records equipment gauge readings, carries out scheduled and routine equipment inspections, tests and reports findings for appropriate action in line with safety standards and procedures.  Position Key Responsibilities:  Assist in performing routine mechanical maintenance work, welding, or machining including lubrication, inspection, and replacement of parts  Records plant operation readings, maintain equipment history and preventative maintenance records, schedules and maintain plant safety records  Troubleshoot and repair malfunctioning equipment and report as necessary  Assist in the installation of potable... water and wastewater treatment plant equipment  Perform pipefitting, install and repair air, sewer and hydraulic piping systems  Ensure and adhere to safe work practices and procedures including, but not limited to lockoutortag out and confined space rules and regulations.  Use equipment according to manufacturer's specifications for optimal safety and performance.  Keep workplace, tools and equipment in a clean and safe condition.  Position Outcomes & Measures:  Equipment and plant availability  Compliance to standards and safety procedures  Quality and Cost control  Customer Satisfaction  Timeous execution of maintenance works.  Qualifications & Experience:  Qualifications:  Form 5  Light duty driver's license  National Craft Certificate in Mechanical Engineering  Experience:  Direct Entry  Competencies:  Standards and Procedures adherence  Operations and Control  Maintenance and Risk  Compliance and Governance  Asset Management Optimization Plans  Long Description  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 25 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits:  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid  Interested Botswana citizens should address their cover letter to:  Human Resource Director  Water Utilities Corporation  Private Bag 00276  Gaborone  AND  Attach a comprehensive Curriculum Vitae (C.V), certified copies of certificates, National Identity Card (Omang) as well as professional references and names and addresses of two referees.  NB: Cover letter, certificates, identity card (omang), and references should be scanned as one document and uploaded with the cover letter.  Only shortlisted candidates will be responded to.  No Physical applications will be accepted"
  },
  {
    "title": "Water Hygiene Engineer / Technician",
    "company": "Computer, Consultants & Merchants, Inc.",
    "location": "Botswana",
    "description": "Position: Water Hygiene Engineer / Technician  Location of Work: Hertfordshire & Surrounding Counties.  Salary / Benefits: 22k - 34k + Training + Benefits  Expanding Water Hygiene company with over two decades of experience providing legionella compliance and plumbing services, are currently looking to employ an experienced Water Hygiene Engineer to join their growing Southern team. Must hold a good working knowledge of ACoP L8 and HSG 274 (1-3) guidelines and experience delivering legionella compliance routines to a varied site base. This would be a good opportunity for an experienced Engineer looking to cut down travel and gain a better work/ life balance, as the client can offer local based work, with jobs usually scheduled within a one-hour radius.  The successful candidate will be covering both private and public sector sites across the Hertfordshire and Home Counties region and applications will be considered from, Hertford, St Alban's, Harlow, Bishop's Stortford, Stevenage... Luton, Enfield, Watford, Cheshunt, Harlow, Aylesbury, Hemel Hempstead, and the surrounding areas.  Qualifications  ' Similar experience working as a Water Hygiene Engineer / Operative or Environmental Service Technician is required.  ' Able to demonstrate a good knowledge of ACOP L8 and HSG 274 parts 1,2,3.  ' Experience using PDA / Compliance systems for reporting.  ' UK Driver license.  The Role  Successful candidates will be undertaking a range of Water Hygiene duties, including but not limited to.  ' Water Sampling.  ' Temperature monitoring.  ' Descaling of showerheads & hoses.  ' Flushing of small outlets.  ' Cleans and disinfections of Hot and Cold-Water systems.  ' TMV servicing and inspections.  ' Hot Water Cylinder Services.  ' Calorifier Clean / Descaling.  ' Expansion Vessel Services.  Benefits include.  ' Competitive basic salary, with opportunities for overtime.  ' Bonus schemes.  ' 40 hours per week - Monday to Friday.  ' Generous Holiday package, rising annually with service.  ' Company Vehicle and Fuel Card.  ' Company pension scheme.  ' Further Training.  Alternative Job titles: Environmental Service Technician, Service Engineer, Water Hygiene Operative, Monitoring Engineer, Legionella Technician.  Future Select are recruiting in the Water Treatment/Hygiene industry; we work with the best clients & candidates and supply the majority of permanent jobs in the market.  We would be interested in speaking to candidates with experience in any disciplines from Risk Assessors, Service Engineers, Account Managers and Business Development/Operational Managers through to Director level.  We are inundated with applications, we will endeavour to get back in touch, however if you have applied to Future Select and you have not heard from us after a week, on this occasion, you will not have been successful. Your details will be saved on our system and you will be contacted in the future if a vacancy matches your skills.  Future Select are recruiting in the Water Treatment/Hygiene Industry, we work with the best clients and candidates and supply the majority of permanent jobs in the market. We would be interested in speaking to candidates with experience in any disciplines from Risk Assessors, Service Engineers, Managers (Accounts, Business Development, Operational) through to Director level.  We are inundated with applications, we will endeavour to get back in touch, however if you have applied to Future Select and you have not heard from us after a week, on this occasion, you will not have been successful. Your details will be saved on our system and you will be contacted in the future if a vacancy matches your skills.  Future Select Copyright"
  },
  {
    "title": "Collection Agent",
    "company": "Water Utilities Corporation (WUC)",
    "location": "Botswana",
    "description": "Date: Nov 29, 2023  Location: Selibe Phikwe, BW Maun, BW  Company: water utilities  Closing Date: 13 December 2023  Long Description:  Collection Agent: Water Utilities Corporation (WUC) is one of the leaders in the water supply industry in the region and strives to be the best internationally. The Corporation prides itself in employing the best human resource capital available to effectively deliver on its mandate and ultimately attain its aspirations. WUC would like to invite suitably qualified individuals who wish to join an employer of choice and meet the profile, to apply to be considered for the below position based at Bobonong and Sehithwa.  Position Purpose:  To maximize revenue by accurately carrying out receipting and allocating monies in to appropriate customer accounts and by performing update of customer data in SAP  Position Key Responsibilities:  Receipting  Service Order Management  Customer Service  People Management and Functional Effectiveness  Compliance and... Governance  Culture  Position Outcomes & Measures:  Accurate receipting  Risk Management rejection of invalid cheques  Effective daily banking and reconciliations  Adequate vetting of new accounts  Adherence to Financial policy  Qualifications & Experience:  Qualifications:  Diploma in Accounting and Business Studies, Accounting , Finance or related field  Experience:  2 years relevant experience  Computer literacy  Competencies:  Computer literacy  Service Order Management  Customer Service  Long Description  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 25 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid"
  },
  {
    "title": "Critical Facilities Water Treatment Engineer",
    "company": "NTT Global Data Centers EMEA UK ltd",
    "location": "Botswana",
    "description": "As ourCritical Facilities Water Treatment Engineerfor our site in Dagenham, you will provide Water treatment engineering services and guidance on related L8 related matters affecting the on-going management and development of the cooling system and domestic water infrastructure within the Data Center facilities.  As part of this you will be instrumental in the planning and management of all water quality cooling services to ensure operational performance and compliance is maintained at all times, to the highest possible standards. Based at our Dagenham facility you will ultimately be responsible for the compliance of the cooling tower logbooks and other items related to HSE 274 ACOPs.  Your Responsibilties  Contribute to the success of the TechOps (FM) operational engineering team  Responsible for daily self-delivered water treatment hygiene tasks  Responsible for the oversight of specialist water treatment hygiene delivery. Ensuring that all and any statutory, duty holder and... contractual deliverables are achieved within SLA  Responsible for authoring and the oversight of mechanical MOP/SOP/EOP regardless of source  Responsible for ensuring that all and any relevant RAMS are provided by specialist water treatment hygiene specialist vendor/s and these are suitable and sufficient  Act as a specialist water treatment hygiene competent person (CP)  Responsible for ensuring specialist water treatment hygiene logbooks are maintained and subject to regular audit (minimum of 4 times a year)  Assisting with commissioning and witnessing of existing infrastructure upgrades and enhancements; this could include new facilities  Deliver in-house training to operational colleagues to increase awareness and competencies in respect of specialist water treatment hygiene requirements  Support to minimise Human Error aspects of all mechanical operations, where it be a physical optimisation to equipment, or robust technical training, or clear procedure documentation  Your Profile  Demonstrable knowledge and experience of water hygiene treatment regimes in line with L8/HSG274 (Essential)  HNC level attainment of a relevant specialist water treatment hygiene qualification (Desirable)  IOSH Working Safely (Desirable)  Experience in specialist water treatment hygiene systems  General understanding of Data Centre water systems and building services, including cooling towers and adiabatic cooling systems  Good numerical and literacy skills and high levels of computer literacy  Excellent organisational skills with the ability to prioritise  Good analytical/ problem solving skills, self-motivated and keen to develop, with a willingness and desire to develop  The ability to communicate effectively at all levels with good relationship building  To possess initiative with an inquisitive nature, unafraid to ask appropriate questions and challenge requests when other options could be more effective  Full driving licence valid for use in the UK  Undergo full security checks to BS7858:2019  We look forward to hearing from you!  About The Global Data Centers Division Of NTT Ltd.  Global Data Centers is a division of NTT Ltd. Our global platform is one of the largest in the world. NTT is ranked as one of the top three leaders worldwide by IDC in their Colocation and Interconnection Services MarketScape, spanning more than 20 countries and regions including North America, Europe, Africa, India and APAC.  As a neutral operator, we offer access to multiple cloud providers, a large variety of Internet Exchanges and telecommunication network providers including our own IPv6 compliant, tier 1 global IP network. Our clients benefit from tailored infrastructure and experience consistent best practices in design and operations across all of our reliable, scalable and customizable data centers.  Working for Global Data Centers EMEA  We are one of the leading and largest data center provider and for more than 20 years we have been supporting our clients from a wide variety of industries with our talented team of nearly 900 people (m/f/d). Today, we are designing and operating 18 data center locations across 160,000 sqm in Germany, Austria, Switzerland, in the Netherlands and in Great Britain and expanding into further markets. Our people come from a variety of industries and work together to find the best solution for every challenge. Due to the diversity of backgrounds our people (m/f/d) come from, the ability to work in teams and good communication skills are very important to us.  As a performance-oriented company, we value expert knowledge and people who want to shape the future. We are growing internationally and offer our people (m/f/d) the opportunity to work worldwide within the NTT Group if they are suitably qualified and interested"
  },
  {
    "title": "Water Hygiene Technician",
    "company": "Travelers Finance Ltd.",
    "location": "Botswana",
    "description": "HSL Compliance are one of the leading companies in the Legionella compliance market, providing services throughout the UK. We are looking for Technicians to join our enthusiastic Water Hygiene team. As a committed people company we strive to help hard working employees to build a career.  Job Role  Required  Reporting to the Account Manager, your role is to assist with general plumbing works on communal hot and cold water systems on an array of designated contracts. Sites are predominantly for local authorities and housing associations who you will be required to liaise with to schedule your visit. Your main tasks include but are not limited to:  Upgrading of cold water storage tanks and hot & cold water distribution systems  Cleaning and disinfection of water tanks and systems  TMV servicing, replacement and installs  Calorifier inspections internally either by opening or borescope  Assisting the water hygiene monitoring team  Bacteriological sampling  Required... Skills  Excellent customer service skills in order to maintain close relationships with our contracts. Experience in plumbing, City & Guilds Plumbing is preferable. All employees are subject to a DBS check and a full driving licence is essential.  What We Offer  Salary banding to allow progression through levels  Company van & fuel card  Paid travel time after 30 minutes  Overtime rate  Enhanced sick pay package  Refer a friend bonus  Employee rewards scheme  Health and wellbeing services for employees and their families"
  },
  {
    "title": "WUC Production and Distribution : Maintenance Mechanical Artisan",
    "company": "waterutili",
    "location": "Mosopa",
    "description": "Long Description  Closing date: 13 December 2023  Long Description  Maintenance Mechanical Artisan  Position Purpose  This role is responsible for undertaking equipment service, repair and fitting of potable water and wastewater treatment plant equipment, machinery and related facilities, records equipment gauge readings, carries out scheduled and routine equipment inspections, tests and reports findings for appropriate action in line with safety standards and procedures.  Long Description  Position Key Responsibilities  Assist in performing routine mechanical maintenance work, welding, or machining including lubrication, inspection, and replacement of parts  Records plant operation readings, maintain equipment history and preventative maintenance records, schedules and maintain plant safety records  Troubleshoot and repair malfunctioning equipment and report as necessary  Assist in the installation of potable water and wastewater treatment plant equipment  Perform pipefitting... install and repair air, sewer and hydraulic piping systems  Ensure and adhere to safe work practices and procedures including, but not limited to lockoutortag out and confined space rules and regulations.  Use equipment according to manufacturer's specifications for optimal safety and performance.  Keep workplace, tools and equipment in a clean and safe condition.  Long Description  Position Outcomes & Measures  Equipment and plant availability  Compliance to standards and safety procedures  Quality and Cost control  Customer Satisfaction  Timeous execution of maintenance works.  Long Description  Qualifications & Experience  Qualifications:  Form 5  Light duty driver's license  National Craft Certificate in Mechanical Engineering  Experience:  Direct Entry  Competencies  Standards and Procedures adherence Operations and Control Maintenance and Risk Compliance and Governance Asset Management Optimization Plans  Long Description  Remuneration  Salary: An attractive Salary Package commensurate to the market  Leave: 25 working days per annum  Pension: A Contributory Pension Scheme (16.5% WUC and 4% Employee)  Other Benefits  Group Life Assurance (24-hour coverage)  100% paid by the Corporation towards Medical Aid  Long Description  Interested Botswana citizens should address their cover letter to:  Human Resource Director  Water Utilities Corporation  Private Bag 00276  Gaborone  AND  Attach a comprehensive Curriculum Vitae (C.V), certified copies of certificates, National Identity Card (Omang) as well as professional references and names and addresses of two referees.  NB: Cover letter, certificates, identity card (omang), and references should be scanned as one document and uploaded with the cover letter.  Only shortlisted candidates will be responded to.  No Physical applications will be accepted"
  },
  {
    "title": "Team Leader - Water Industry",
    "company": "RPS Group",
    "location": "Botswana",
    "description": "The RPS Asset Survey and Inspection team delivers clean water services to our clients across the breadth of the UK and Ireland. As a Team Leader you will be responsible for the day-to-day management of the Leakage and Project Field Teams leak detection activities to meet leakage targets as defined by the client. You will be the point of contact for site staff and will take responsibility for Risk Assessment and Health & Safety Management.  This is a permanent, full time (40 hrs pw) position and will cover the Kent and Sussex areas .  We're RPS, our projects are all around you. We define, design, and manage projects that create shared value to a complex, urbanising and resource-scarce world. Our people are our success. We need people who share our passion on solving the problems that matter. And where you'll be supported every step of the way. Here is where you come to build a career.  What You'll Be Doing  Leading a team of field-based staff on a day-to-day basis in order to deliver... outstanding client care, customer service and technical excellence  Undertake site-based briefing/debriefing sessions with field teams  Drive, support and manage performance of the field teams to include m entoring and training of field staff to maintain continued improvement  Undertake information management system (IMS duties) such as site-based audits and BEST observations  Ensure adequate and accurate completion of paperwork (including timesheets, survey forms etc.)  Adherence to Company policies and procedures always, especially relating to Health & Safety  Delivering monthly toolbox talks and safety alerts  Ensuring compliance of all teams to approved technical procedures and management of the Company's Integrated Management System  Produce clear and up to date status reports from day-to-day leakage delivery i ncluding analysis and continuous improvement of the leakage team's performance - highlighting performance trends and reporting.  Assisting site staff to locate and promote leakage jobs.  Ensuring that all work is completed in a timely and accurate manner.  Who we're looking for?  Experience working in a water operations environment with NRSWA unit (signing and guarding), National Water and Hygiene and IOSH managing safely  Commitment to working safely with excellent health and safety awareness  Great written and verbal communication skills and encourages collaboration and teamwork  A hands-on leader with a desire to share knowledge, problem solve and show initiative  Able to work accurately even when under pressure  Willing and able to work in all weather conditions and physically able to move heavy items  Full UK driving licence  What's in it for you?  We support our people to innovate, collaborate and build meaningful careers. Here you'll find true support and encouragement. We're an accredited training provider and we support learning and development for everyone. A personal development plan and a transparent career pathway puts you in the driving seat of your career and you'll be supported as far as you want to go.  RPS, a Tetra Tech Company  Representing an exciting new chapter in our business, in January 2023 RPS became a Tetra Tech company. With 27,000 employees in more than 550 offices in more than 120 countries on seven continents, Tetra Tech is a leading global provider of consulting and engineering services. As a Tetra Tech company, RPS is proud to offer our people market leading development and project opportunities, helping to solve some of the world's most complex problems.  What happens next?  If we feel you are a good match you will be invited to attend a competency-based interview. All applications will be considered. Ready to apply? Please have your CV ready and continue with your application online.  Health and Safety  This Role May Involve  Moving heavy items including manhole covers  Working in all weather conditions (this could include night work also)  Please note for this role you will be required to undertake alcohol and drugs testing"
  }
]