[
  {
    "title": "RFT  Bureau dtudes/Groupement de consultants pour llaboration...",
    "company": "Global Water Partnership",
    "location": "Central African Republic",
    "description": "Cher soumissionnaire,  Le Global Water Partnership (GWP) est heureux de vous inviter  rpondre  lappel doffres de Bureau dtudes/Groupement de consultants pour llaboration de 02 Notes Conceptuelles pour le Green Climate Fund (GCF, Fond Vert Climat) en Rpublique centrafricaine.  Fond en 1996, le GWP est un rseau daction international uvrant dans la promotion de la mise en uvre de la gestion intgre des ressources en eau. Le rseau comprend des institutions gouvernementales, des organisations non gouvernementales, des instituts universitaires et de recherche, des entreprises prives ainsi que des fournisseurs de services du secteur public.  Notre vision  Un monde o la scurit de leau est assure.  Notre mission  Faire progresser la gouvernance et la gestion des ressources en eau pour un dveloppement durable et quitable.  Notre travail  Nous priorisons les opportunits en lien avec des cadres politiques-cls mondiaux ou rgionaux tels que :  Les solutions lies ... leau pour latteinte des objectifs de dveloppement durable;  La rsilience climatique  travers leau, et ;  La coopration transfrontire dans le domaine de leau.  Nos valeurs  Inclusion | Ouverture | Transparence | Redevabilit |Respect | Sensibilit au genre| Solidarit  Lorganisation du GWP (GWPO) a t cre en Sude en tant quorganisation intergouvernementale. Elle est dirige par un.e Secrtaire Excutif qui relve du Comit Directeur (CD). Le CD supervise les politiques, les mesures et les stratgies, et approuve le programme de travail et le budget. Le CD et son prsident sont nomms par les Partenaires Sponsors, qui comprennent les dix membres fondateurs de GWPO.  Bas  Stockholm, le Secrtariat de GWPO gre les finances du rseau du GWP et rend des comptes sur les financements reus au niveau mondial. Il facilite galement lchange de connaissances et de ressources, tout en assurant la communication et la cohrence  travers le rseau. Le personnel du Secrtariat compte actuellement prs dune quarantaine demploy.es recrut.es dans toutes les rgions du monde, et couvrant ainsi des postes administratifs, oprationnels, scientifiques et techniques. Plus dinformations peuvent tre trouves sur le site: www.gwp.org (http://www.gwp.org/) .  MARCHE  SUIVRE  Il sagit dun processus dappel doffres dit ouvert. Pour participer, vous devrez complter les informations ncessaires dans le systme et soumettre les documents requis avant la date limite de soumission. Nous exigeons la finalisation complte des documents dappel doffres afin que votre soumission soit considre comme conforme. Les offres incompltes pourront tre rejetes.  outes les offres doivent tre soumises en francais, et le soumissionnaire assumera tous les frais encourus pour leur prparation et soumission.  Les offres soumises doivent tre valables pour examen pendant une priode minimale dau moins 90 jours  compter de la date de clture. Veuillez noter que le GWPO na aucune obligation doctroyer un contrat ou de lattribuer au soumissionnaire moins disant.  Dans le cadre de ce processus dappel doffres, veuillez noter que le GWPO peut demander des chantillons et/ou effectuer des visites dans les bureaux/usines/entrepts/magasins des fournisseurs, etc. afin de vrifier les informations fournies dans loffre du soumissionnaire.  Un soumissionnaire peut retirer son offre  tout moment avant la date de clture,  la condition que ce retrait soit effectu par lentremise du systme CTM eSourcing.  Si vous avez besoin de plus amples informations ou de clarifications sur les exigences de lappel doffres, veuillez contacter lunit de passation des marchs de GWPO par crit via la fonction de messagerie du systme eSourcing. Toute correspondance entre les soumissionnaires potentiels et GWPO doit passer par ce systme, et prenez note que toutes les interactions entre la GWPO et le soumissionnaire seront enregistres dans le systme et pourront faire lobjet de vrifications  des fins daudit.  CONTENU DES OFFRES PUBLIQUES  Les soumissionnaires doivent offrir leurs services pour lintgralit des tches telles que dfinies dans le questionnaire dappel doffres et le devis quantitatif. Veuillez noter que chaque exigence doit tre traite sparment en faisant une rfrence claire  chacune des exigences.  Tous les cots, en dollars, doivent tre inclus dans loffre, y compris la TVA, si le fournisseur est tenu de la facturer. La GWPO nest pas exonre de TVA et na pas de numro de TVA. Les cots doivent tre indiqus selon les critres contenus dans le devis quantitatif.  PARTICIPATION:  Suivez ces instructions lorsque votre entreprise participera  lun des appels doffres de la GWPO:  Connectez-vous au systme et cliquez sur Accepter . Prenez note que lorsque vous cliquez sur Accepter, vous navez pas encore soumis de requte de prqualification, mais avez simplement accept davoir accs  la documentation affiche.  Une fois votre acceptation confirme, vous aurez accs  la documentation pertinente. Vous pourrez ds lors rpondre aux questions poses et soumettre les documents requis dans loffre.  Veuillez noter que votre rponse pour participer doit tre communique avant la date limite. Sinon, lorganisation nacceptera pas votre rponse  loffre.  Remarque: Les offres doivent tre soumises via le systme CTM et avant la date limite. Une fois pass ce dlai, il ne sera plus possible de soumettre des offres.  La date limite pour dposer les soumissions est 08/12/2022 23:59 HEC.  La GWPO examinera toutes les offres reues afin de dterminer si elles sont compltes, correctement soumises et si les exigences ont t satisfaites. Une offre peut tre rejete si elle est incomplte ou ne rpond pas aux exigences.  Lattribution du contrat sera base sur les catgories de critres suivants:  CRITRES ESSENTIELS  Le soumissionnaire doit se conformer aux conditions gnrales de GWPO ainsi qu son code de conduite  lgard des fournisseurs;  Le soumissionnaire dtient une licence commerciale valide, et;  Le soumissionnaire possde un enregistrement fiscal valide.  CRITRES CLS  Les critres suivants sont considrs comme dterminants dans lvaluation de loffre:  Le prix offert par le soumissionnaire;  La stabilit financire de lentreprise soumissionnaire, et;  La capacit du soumissionnaire de rpondre aux spcifications techniques demandes.  CRITRES PRFRABLES  Les critres suivants sont considrs comme importants dans lvaluation de loffre:  Le soumissionnaire fournit des rfrences satisfaisantes de clients, et ;  Le soumissionnaire ne compte pas recourir aux services dun sous-traitant.  La GWPO entamera des discussions dtailles avec le soumissionnaire considr comme ayant prsent loffre la plus avantageuse afin de parvenir  la signature du contrat. Si ces ngociations chouent, la GWPO pourra inviter le soumissionnaire ayant obtenu le second meilleur rsultat  changer.  How to apply  CONDITION DACCS:  Acceptation par le soumissionnaire de la dclaration des normes de conduite des fournisseurs de GWPO et de ses conditions gnrales, telles que fournies et dcrites dans loffre.  Veuillez cliquer sur accepter afin de confirmer que votre entreprise accepte les conditions obligatoires daccs  loffre dans le systme.  AUTRES INFORMATIONS:  Toute correspondance entre les soumissionnaires potentiels et GWPO passeront par le systme. Veuillez noter que toutes les interactions entre GWPO et le soumissionnaire seront enregistres et pourront tre audites.  Pour des questions dordres techniques sur le systme, veuillez contacter notre service dassistance par tlphone au +44 333 155 4996 ou par e-mail  tendersupport@eu-supply.com (mailto:tendersupport@eu-supply.com)  Les questions concernant le contenu et le processus de lappel doffres doivent tre adresses  lentit contractante via le module de messagerie interne du systme.  Les rponses aux questions sur le contenu et le processus de lappel doffres publies dans le systme seront prsentes sous une forme anonyme, mises  la disposition de tous les soumissionnaires enregistrs.  Avec nos salutations distingues,  G N  Global Water Partnership Organisation  APPLY HERE"
  }
]