[
  {
    "title": "Regional Sales Manager - Water treatment - H/F",
    "company": "MICHAEL PAGE",
    "location": "Abidjan",
    "description": "Quelles sont les missions ?  Reporting to the Managing Director, you will be required to carry out the below responsibilities:  Develop and implement effective sales strategies to meet and exceed revenue targets in West Africa specifically with (Calcium Hypochlorite, Sodium & Potassium Permanganate)  Identify and cultivate new business opportunities, including prospecting potential clients, partners, and emerging markets  Prepare and present compelling sales proposals, negotiate contracts, and close deals  Stay informed about market trends, competition, and customer needs to drive continuous product improvement and innovation  Collaborate closely with cross-functional teams to ensure successful project delivery and implementation  Provide accurate sales forecasts and reports to support effective decision-making  Willingness to travel within the West African region as required  Quel est le profil idal ?  You bring 15 years of working experience as a Regional Sales Manager... within the water treatment industry Experience selling Calcium Hypochlorite, Sodium & Potassium Permanganate across West African countries is mandatory Bachelors degree in Chemical Engineering or a related field is an asset Strong knowledge of water treatment technologies with an exposure to selling between 100-500 metric tonnes per month Excellent communication in English & French is mandatory Experience selling water treatment solutions within the public & private sector is an asset Flexibility and willingness to travel within West Africa  Qui a publi cette offre ?  Our client is a leading manufacture and distributor of cutting-edge water treatment solutions, dedicated to ensuring access to clean and safe water across West Africa. With a strong commitment to sustainability and innovation, we serve a diverse range of industries in the region. To further our mission and expand our presence, we are seeking a motivated and results-oriented Regional Sales Manager to join our team to cover West Africa"
  },
  {
    "title": "EVENTS AND MARKETING MANAGER",
    "company": "African Water Association (AfWA)",
    "location": "Abidjan",
    "description": "Job title: EVENTS AND MARKETING MANAGER  Supervisor: Director of Membership Services (DMS)  Location: Abidjan, Cote dIvoire  Period: Two-year, renewable contract with a three-month probation period  1 HISTORY OF THE AFRICAN WATER ASSOCIATION  The African Water Association was created in 1980 as a professional membership Institution and was first called the Union of African Water Suppliers (UAWS).  In 2004, in order to take into account sanitation utilities, as well as regulatory and asset holding companies emerging from institutional reforms of the 90s in many African countries and the strong will for these new entities to join the Institution, the Union of African Water Suppliers changed name and became the African Water Association (AfWA). The African Water Association covers the whole African Continent and is the unique African Water and Sanitation Organization bringing together water and sanitation operators as well as various sectors stakeholders.  2 VISION, MISSION AND... STRATEGIC OBJECTIVES  Vision  Being the acknowledged leader in strengthening water utility management practices to support the goals of African Water Vision 2025.  Mission  Undertake programs and support knowledge sharing in sustainable water management  its science, practice and policy  through professional development, networking and advocacy.  Support the members in their efforts to achieve the Millennium Development Goals (MDG) and other near-term targets that have been established for Africa (SDGs).  Advocate for a balanced approach to utility management, based on corporate governance that is commercially sound, financially self-sustaining and environmentally compliant.  Main Strategic Objectives  Strengthening the governance and management bodies of the Association  Building the capacity of water and sanitation operators in Africa  Diversifying partnerships and strengthening synergies  Strengthening the visibility of the Association  The African Water Association (AfWA) is a continental platform that brings together corporates of drinking water production and distribution, corporates managing sanitation services, as well as those that regulate water and sanitation sectorial policies in African countries. Originally, AfWA was created only by and for these actors known as Active Members. In 2019, about 39 years after its creation, AfWA is composed of 115 corporate members from 45 African countries.  While the AfWAs Active Members mission vis--vis of their customers is to provide quality products and services, they need the expertise and input from the hydraulic equipment and materials from manufacturers and highly qualified consultants, which themselves, also need the Active Members to buy their goods and services so to expand their businesses. A win-win exchange platform between the water and sanitation operators and the equipment manufacturers/vendors is hence created and, both parties understood that one cannot prosper without the other. In this scope, AfWA integrated another class of members, known as Affiliate Members, and mainly constituted of individuals or group of individuals from all continents, operating in the industry, technology and consultancy in the water, sanitation and hygiene sector. Today, there are 80 Members in this category, mainly from Europe.  AfWA main activities are related to building the capacity of water utilities through seminars, master classes, workshops, technical sessions during its congresses as well as continent-wide, grant-supported programs and projects. Since 2009, AfWA has been entrusted by the UN to develop the Water Operators Partnership Concept in the African Continent. This has been done by supporting more than 25 partnerships between utilities under the grants awarded by UNHABITAT, USAID Washington and AfDB/AWF. In parallel to the development of these partnerships, through another USAID Washington grant within FABRI  the Further Advancing the Blue Revolution Initiative  AfWA has organized a major capacity building project called Reducing Non-Revenue Water in sub-Saharan Africa, involving 21 utilities in 19 African countries. Currently, AfWA is implementing three programs respectively funded by USAID-west Africa office, the Bill and Melinda Gates foundation, and the European Union through the Horizon 2020 initiative. The total budget for these programs is about five (05) millions USD.  For more information, please visit http://www.afwa-hq.org/index.php/en/  Under the implementation of its new vision of opening the organization to a broad portfolio of members, AfWA has started the process for a transformational change with particular emphasis on:  Mobilizing and attracting new members for AfWA,  Mastery the various categories of potential and actual members,  Knowledge of the specific needs of members, interested parties and supporters,  Follow-up of members and the satisfaction of their needs by offering various services and products,  Retaining current members.  This new dynamic imposes on AfWA a good use of the data on members and other stakeholders in the sector in Africa. With that in mind, the Association is looking to enhance the Membership Services Department with a qualified staff in charge of developing and managing AfWA members and organizing AfWAs various events.  This position is key to sustainably meet the set goals.  Scope of work of the Events & Marketing Manager  The mission of this position is to generate (through digital tools) value propositions for AfWA products and services, taking advantage of values derived from activities to strengthen relationships between the Association and her members and mobilize resources from the products and services offered using appropriate strategies and methodologies.  Detailed tasks:  Mission 1: Contribute to developing the new Membership Development Strategy  As such, the incumbent will:  Contribute to developing the Terms of Reference,  Identify marketing actions to get onboard new members and strengthen the retention of current members,  Ensure that AfWAs value proposition with related products and services is taken into account in all AfWA actions.  Mission 2: With the support of AfWAs IT Department, design and develop a digital platform to promote exchanges between members  As such, the incumbent will:  Develop Terms of Reference for establishing the platform,  Invite members to register on the platform and support them to create a profile,  Manage the platform daily through fostering exchanges between various members via the platform,  Monitor visits and exchanges on the platform,  Produce short reports on the platform use by members and their satisfaction with this service as well.  Mission 3: Mobilize commercial resources  As such, the incumbent will:  Identify, follow and get new prospects onboard the Association,  Develop in collaboration with the Seniors Coordinators and Director of AfWA Programs, an action plan aiming to attract onboard new members from the base of stakeholders involved in the projects and programs.  Support the organization of events, including exhibitions, and leverage them to promote among participants, products and services for members  Identify other products as the Organizations portfolio and actions evolve.  In addition, the incumbent will support the Exhibitions Manager in:  Mobilizing advertising inserts in 03 AfWA NEWS magazines per year,  Mobilizing advertising inserts for AfWA Directory and Share Water,  Generating funds from AfWA NEWSLETTERS and AfWA Knowledge Management Platform,  Mobilizing advertising inserts for the STC SUMMARY book.  Mission 4: Organize marketing exhibitions around the world and manage AfWA booth during the various international exhibitions  As such, the incumbent will support the Exhibitions Manager in:  Organizing exhibitions, including implementing and monitoring related activities,  Coordinating the actions of all partners and service providers involved, including communication and contract management,  Communicating with members/exhibitors involved,  Developing tools, as well as presentation and information materials.  Mission 5: Organize conferences, workshops, and meetings, in line with the activities of the Scientific and Technical Council, the Executive Board and the Executive Office.  As such, the incumbent will:  Coordinate and communicate with all partners and providers involved, including managing contracts for service location, technicians, caterers, graphic designers, hotels etc.,  Support, manage and communicate with moderators, speakers, and participants.  Ensure the coordination and monitoring of the available budget for the event,  Design presentations and information material about the event (event agenda, etc.)  Coordinate the program prior to the various event (presentations, workshops, B2B meetings, appointments with institutions, embassies, and government officials)  Mission 6: Support Regional Implementing Partners of AfWA activities  As such, the incumbent will:  Provide support to Regional Implementing Partners of AfWA activities in Africa in terms of organizing meetings and events.  Mission 7: Database  As such, the incumbent will work closely with the Database Manager to:  Obtain reliable data which can be used for commercial actions  Define key aspects to assess a specific work plan to achieve the set objectives and periodically monitor the growth of the membership base.  Mission 8: Collection of unpaid advertising inserts, membership fees, and participation fees in exhibitions.  As such, the incumbent will perform the following as the need arises:  Carry out collection operations on inserts in publications (AfWA NEWS, Share Water, AfWA Directory, KMP, etc.) and on membership fees in collaboration with the Accounting Manager,  Carry out collection operations on events in collaboration with the Accounting Manager.  Mission 9: Manage new memberships  As such, the incumbent will:  Encourage, mobilize, and manage new memberships,  Get old members renew their membership,  Support the production of AfWA Directory in collaboration with the Communication Department to ensure compliance with AfWA branding.  REQUIRED PROFILE  Qualifications  Hold a university degree (BAC+4) in Communication, marketing, Information Technology or Statistics, with a minimum of 5 years experience in implementing digital marketing activities, managing communities, organizations, and customer relationships.  Experience  Sound experience in designing and managing digital platforms for exchanges  Monitoring, social media, design, marketing, customer loyalty,  Sound experience in database design and administration,  Sound experience in web content writing, designing web, mobile and/or client-server applications,  Sound experience in events management.  Skills:  Perfect ability to work in French and English with a perfect command of one of these two languages,  Ability to travel to the field as required by the organization,  Ability to work under time pressure and results with initiative, dynamism, and proactivity,  Good written and oral expression skills and the ability to formulate ideas clearly and concisely,  Open-mindedness and willingness to be adaptable and flexible in dealing with colleagues,  Ability to manage complex (internal and external) relationships.  Key competences:  Reporting skills  Written and oral communication  Problem solving  Work and time management  Organizing and managing knowledge  Integrity  Internet and computing skills  Adaptability and flexibility  Teamwork and collaboration  How to apply  Required documentation  Cover letter  Detailed Curriculum vitae in English and/or French  Names and contact information of three reference persons.  While AfWA is working towards a gender equitable workforce, hence so female candidates are strongly encouraged to apply.  Send your application before 27th November, 2022  to: recrutement@afwa-hq.org  Specify in the subject line: events and Marketing Manager  Only shortlisted candidates will be contacted.  AFRICAN WATER ASSOCIATION  Riviera Palmeraie, Rond-point de la Renaissance, Immeuble de la SODECI ; 2e tage  25 BP 1174 ABIDJAN 25  Phone: (225) 27 22 49 96 11 / (225) 27 22 49 96 13  Fax (225) 27 22 49 23 30"
  }
]