[
  {
    "title": "Water Quality Specialist",
    "company": "Innovation: Africa",
    "location": "Garoua",
    "description": "JOB ADVERT:  Seeking a Full Time Water Quality Specialist for Innovation: Africas Garoua, Cameroon Office  Background  Innovation: Africa (IA) is a non-profit 501(c)(3) organization with a team of dedicated problem solvers with a mission to bring solutions and know-how to those in need living in rural African villages. We use solar energy to pump clean water and provide schools, orphanages and medical clinics with light and refrigeration to store vaccines and medicines. IA has completed over 700 solar and agricultural projects, providing light, clean water, and proper medical care to more than 3,5 million people in Ethiopia, Tanzania, Malawi, South Africa, eSwatini, Uganda, Cameroon, Zambia, Senegal, and the Democratic Republic of Congo.  Job Summary  Our dynamic, growing organization seeks a Water Quality Specialist to join our team based in Garoua, Cameroon. The position entails implementing and overseeing a comprehensive water quality monitoring and treatment program for all... existing and future water projects, as well as working closely with the Engineering and Africa Programs departments at headquarters in Israel.  Reports To: Country Manager (Local Office), Head Water Quality Specialist (HQ)  Requirements  B.Sc./M.Sc. in science-related discipline such as Environmental Sciences, Hydrology, (Geo/Bio) Chemistry, Biology, or Microbiology  Advanced knowledge of water quality control and quality assurance principles and practices  Advanced knowledge of environmental regulations, health & safety regulations, water industry and technologies  Knowledge of general principles and procedures of water treatment and distribution  Experience working in or with water testing laboratories  Experience with field laboratory equipment and field sampling  Proficiency in data science and using Microsoft Excel  Drivers license and off-road driving experience  Ability to commit to flexible working hours  Strong organizational skills  ability to multi-task and keep track of the water quality status and results for dozens of projects at once  Strong communication skills, a team player  High proficiency in English; both writing and speaking is a must and regional dialects in any two or three of such languages in the areas that we serve will be an added advantage  Responsibilities  Conduct field sampling and analysis; coordinate and participate in the collection, interpretation, and evaluation of water quality data.  Operate and troubleshoot analytical equipment and instrumentation.  Assist in coordinating laboratory services, collecting and processing samples, using equipment, managing supply inventory and on-going maintenance.  Research and implement applicable off-grid water treatment solutions.  Understand trends and patterns and assess compliance with regulatory standards and potential risks to consumers.  Visit sites of concern and carry out training of local staff on how to identify potential sources of pollution or contamination, and sources of complaints about drinking water quality.  Perform administrative duties where necessary for monitoring program managers to ensure timely completion of workloads.  Compensation  Commensurate with experience  Application Instructions  Please send your cover letter and CV as a single PDF attachment to cm.wqs@innovation-africa.odoo.com . Please make the file name your full name. Kindly note that we can only accept applications that are sent in PDF format.  As an international organization, our teams are spread out between the USA, Israel and Africa, and team members are constantly on the move. We strive to use technological solutions to keep our staff in close contact, despite busy travel schedules. To ensure our operations run smoothly, we keep close communication via phone, Zoom, WhatsApp, Slack and more. This position requires the ability to keep up with this fast-paced environment, and to be comfortable working with colleagues across time zones and continents"
  }
]