[
  {
    "title": "ROWPU Operator",
    "company": "KBR",
    "location": "Djibouti",
    "description": "Title: ROWPU Operator  In compliance with the U.S. federal governments vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position.  KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.  ROWPU Operater  Controls treatment plant machines and equipment to purify and clarify water for human consumption and for industrial use. Operates and controls electric motors, pumps and valves to regulate flow of water into treating plant. Dumps specified amounts of chemicals into water or adjust automatic devices that admit specified amounts of chemicals into tanks to... disinfect, deodorize, and clarify water. Turns valves to regulate water through filter beds to remove impurities. Pumps purified water into water mains. Monitors panel board and adjusts controls to regulate flow rates and distribution of water. Cleans tanks and filter beds. Repairs and lubricates machines and equipment. Tests water samples. Records data such as residual content of chemicals and water pressure"
  },
  {
    "title": "DJBOSS:  ROWPU Supervisor",
    "company": "KBR",
    "location": "Djibouti",
    "description": "Title: DJBOSS: ROWPU Supervisor  KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.  ROWPU Supervisor  Responsible for Supervising Water Plant and/or Water Purification group(s). Assists in leading the creation of organization structure and processes required to fully execute the requirements of services and has responsibility for the execution of Water Purification services, quality performance, equipment operation and cost. Responsible for the execution and compliance of water standard testing, water sampling, maintaining logs and equipment reading(s). Advises the Manager on issues, impacts, risks.  Additional requirements:  A water purification certificate of at... the minimum Class 2 certification and preferably Class 3 for production from a recognized authority (State, Government or Independent testing facility such as ABC).  A water purification certificate of at the minimum Class 1 certification and preferably Class 2 for distribution from a recognized authority (State, Government or Independent testing facility such as ABC)  Able to show past experience in submitting written reports to Management as they will be the lead on site and have a reporting requirement to KBR and the Government.  Documented Mechanical and Electrical experience in trouble shooting ROWPU systems.  Responsible for ensuring that all ROWPU laboratory personnel have demonstrated proficiency for their assigned functions and that all data reported by the laboratory meet the required QA criteria and regulatory requirements.  Experience With Microsoft Outlook, Excel, Power point, Word  10 + years of experience with Water Production  Must be fluent in English.  Must possess passport book (not passport card) with at least 12 months of remaining validity AND with at least 4 blank visa/stamp pages remaining.  Must possess drivers license with at least 6 months of remaining validity.  In compliance with the U.S. federal governments vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position"
  },
  {
    "title": "National Consultant  Technical Expert to support the development...",
    "company": "United Nations Development Programme (UNDP)",
    "location": "Djibouti",
    "description": "Background  BACKGROUND AND PROJECT DESCRIPTION  Climate model predictions indicate that the Horn of Africa will experience increased rainfall variability and extreme events threatening the population residing in the region and leading to the destruction of hydraulic infrastructure, roads, and property in rural areas including agro-pastoral land.  This is particularly visible in the country of Djibouti where highly variable precipitation and dry periods are predicted to be less prolonged but more frequent than those that have marked Djibouti over the past decade.  Without adequate and rapid interventions to reduce the vulnerability of the country to climate change, the water resources and agriculture sectors will be exposed to substantial adverse biophysical and socio-economic impacts.  Climate change is expected to significantly contribute to increasing food insecurity in the country. Djiboutis rural population, which includes a large pastoralist population, is particularly at risk... from increasing aridification and water shortages as they mainly reside in deserts or marginal lands, often with highly erodible soils and limited water supply. In remote areas in the northwest and central parts of the country, increasingly recurrent droughts in the winter season have already led to reduced pasture areas.  In response to a government request for assistance, and in line with Djiboutis priorities outlined in the INDC, the United Nations Development Programme (UNDP) is supporting the Government of Djibouti in the formulation of an integrated programme titled Djibouti Climate Resilience and Livelihoods Programme, expected to be financed through multiple sources including, Global Environment Facility (GEF), Green Climate Fund (GCF), bilateral donors, International Finance Institutions (IFIs), philanthropic organisations and private sector investment.  The programme aims to build the countrys resilience to the impacts of climate change targeting key thematic areas: Energy and Water.  Working on Climate-Water-Energy nexus will help to address complex and interlinked challenges. Adaptation in these thematic areas will be further supported through the availability, provision and strengthening of relevant climate and environmental information both for early warning and adaptation.  The energy component that aims to close the remaining energy access gap in the country, links closely to the agriculture and water management component that focuses on strengthening food security through food innovation, adaptive agriculture and sustainable irrigation.  The final component on Climate Information aims at bridging the different components with reliable and forward-looking data by strengthening the forecasting information system and early warning systems for climate change adaptation.  Duties and Responsibilities  GENERAL OBJECTIVES  The objective of this consultancy is to work with the team leaders of the Programme, Government of Djibouti and other stakeholders, to support the development of a Project Identification Form (PIF) and a concept note that would be eligible for funding by the Global Environment Facility and Green Climate Fund (GCF) that targets the Water Management component of the Djibouti Climate Resilience and Livelihoods Programme.  Keeping in line with the integrated programmatic framework of UNDP the consultant will work in close collaboration with the teams leading the other components of the Programme.  The UNDP Country Office (CO) and the Regional Technical Advisors (RTA) will provide guidance and oversight to the overall process.  SPECIFIC OBJECTIVES AND METHOLOGY  In the context of the overall integrated Djibouti Climate Resilience and Livelihoods Programme, the consultant, working under the guidance and oversight of UNDP staff, will support the development of Project Identification Forms (PIF) and concept note for projects focusing on strengthening Djiboutis food security through (i) food innovation, adaptative agriculture and (ii) sustainable irrigation (exploring solar pumps systems).  The consultant will be expected to undertake the following:  Conduct a desk review  With support from UNDP and other stakeholders for the gathering of relevant documentations, s/he will:  Align with the vision used in materials developed for other projects in the programme (Pre-investment screening Committee (PISC) documents, PIF/Concept Notes, Baseline Reports, etc.).  Review other assessments (National plans, relevant National legislations, evaluations and reports from past projects (including from other UN Agencies and other multilateral and bilateral donors etc) and prepare a synopsis of the key and relevant findings and brief the International expert when the documentation is only available in French.  Coordinate with relevant teams and ensure an integrated approach  Together with the lead consultant in charge of drafting the PIF, coordinate with the teams working on other components of the Djibouti Climate Resilience and Livelihoods Programme to ensure the approach adopted is integrated and coherent approach. This will include the sharing of information gathered during previous missions, outcomes of the discussions with partners or other stakeholders.  Conduct consultations  Contribute to the identification and support liaising with key stakeholders (relevant government agencies at the national and regional levels, UN agencies, NGOs, CSOs, private sector, etc.) to be involved in the formulation and implementation of the project or build up on existing initiatives.  Develop a 4W (who, what, where and when) Stakeholder Map  Support the identification of potential co-financing options, to be confirmed during the in-depth design phase.  Prepare a consultation report, with a preliminary outline of the project focus, including proposed objectives, scope and strategies.  Specific support to consultant with the development of UNDP Project Documents (for a GCF and GEF FSP Approval Process)  Support the definition of the situational analysis including the baseline scenario of and barriers to the projects;  Support the development of the problem and sketching of the intervention strategy;  Support the identification of several possible scenarios for intervention and identification of the most cost-effective approach within the GCF and GEF strategic objective;  Provide help in addressing comments from the different stakeholders (Government, UNDP, GEF);  Contribute to the initial Social and Environmental Safeguards prescreening.  The deliverables should be in French and English, the consultant should provide support to the International expert for French translation.  FINAL RODUCTS  The consultant is expected to support the International expert to produce the following:  Situation Analysis and Baseline Report to establish baseline, identify indicators and set the target for each indicator  4W Stakeholder Map, including the existing and pipeline projects/programs which can be potential sources of co-financing for the UNDP project  Detailed methodology and work plan  Draft logical framework of the project in collaboration with the international consultant  Draft PIF document in collaboration with international consultant  PROVISION OF MONITORING AND PROCESS CONTROLS  The consultant will be supervised by UNDP Country Office.  The Consultant will be responsible for providing her/his own working station (i.e., laptop, internet, phone, scanner/printer, etc.) and must have access to a reliable internet connection, during the assignment (the cost of these facilities should be included in the financial proposals, if required);  Payment will be made upon satisfactory achieved deliverables under each assignment and submission of time sheet in accordance with number of days worked. All payments are subject to the clearance and approval of the supervisor. Final payment shall require a signed performance evaluation of the consultant.  DURATION OF ASSIGNEMENT AND DUTY STATION  Contract duration: the contract will be signed for a duration of 30 days  Competencies  Corporate Competencies:  Demonstrates integrity by modelling the UNs values and ethical standards;  Promotes the vision, mission, and strategic goals of UNDP;  Displays cultural, gender, religion, race, nationality and age sensitivity and adaptability;  Treats all people fairly without favoritism;  Fulfils all obligations to gender sensitivity and zero tolerance for sexual harassment.  Language:  Fluency in English and French both written and oral.  Required Skills and Experience  EXPERT PROFILE  Education:  Masters Degree in the fields of Engineering, Environmental Science, Climate Change, Agriculture or Water Resources Management or any other relevant disciplines.  Experience:  At least 5 years of professional experience, of which at least 1 years are in supporting/drafting UNDP/GEF project documents;  Extensive conceptual and practical knowledge of UNDP/GEF operating and strategic principles, especially as related to Land Degradation and Climate Change Adaptation;  Proven working experience on projects related to water management and agriculture, ideally in Least Developed Countries and/or African states contexts;  Proven experience of conducting similar nature of assignment in the past preferably for International Organizations /UN organizations;  Experience of working and collaborating with stakeholders including governments; civil society; private sector; local communities;  Good inter-personal communication skills, flexibility;  Excellent report writing skills; and  Proven capability to meet short deadlines and work under pressure.  EVALUATION  Individual consultants will be evaluated based on a cumulative analysis:  When using this weighted scoring method, contract award shall be made to the individual consultant whose bid has been superseded and may be made as:  a. Compliant/acceptable,  b. having received the highest score among a characterized set of weighted technical and financial criteria specific to the solicitation.  Weight of technical criteria: 70  Weight of financial criteria: 30  Only applicants with a minimum of 50 points will be considered for financial evaluation.  Criteria  Points  Max. Point  Technique  Years of Experience and specific experience in drafting UNDP/GEF project documents;  Conceptual and practical knowledge of UNDP/GEF operating and strategic principles;  Proven working experience in the field of water management and agriculture experience collaborating with stakeholders including governments, civil society and communities.  Please click on the button below to Apply"
  }
]