[
  {
    "title": "Community Development Specialist",
    "company": "Ghana Water  Company Ltd.",
    "location": "Accra",
    "description": "Key Responsibilities  Provide technical support:  To guide, coordinate and monitor the expanding Low Income Customer related portfolio of activities with partners and successful outcomes  To regularly procure the needed resources and supervise administratively the socio-economic and physical mapping out of low income urban communities (LIUC) in the Region  To coordinate with Regional Low Income Customer Support Unit (LICSU) Heads to develop and execute a Community Consultation and sensitization plan for all pro-poor districts in the Regions  To ensure effective coordination with public institutions, private sector operators and civil society organisations in promoting the pro-poor agenda  To ensure effective liaison with other utility departments, sensitizing and training of utility staff in pro-poor matters  To ensure annual and timely budgets are prepared for all LICS Units from the Head Office to the districts and establish a regular review mechanism at all levels  To... conduct human and social impact analysis to assess and ensure that pro-poor projects are managed to be operationally self-sustaining including conducting pre and feasibility assessments on all pro-poor projects  To develop a framework for understanding of the nature of urban poor demand for water services and working closely with other team members to aggregate this demand to fit into the service requirement needs of the urban poor consumers  In consultation with PURC and other government agencies to establish viable pricing strategies that are responsive to urban poor consumers  Contribute to the development, execution and regular review of strategic plan for the effective delivery of water supply services to the urban pro-poor areas in the country.  Qualification Required & Experience  A Bachelor's Degree in a social science or related field  At least 3 years to 5 years post-qualification working experience and sound knowledge of water sector operations  Location: Accra  How To Apply For The Job  Applications accompanied by supporting documents, names and addresses of 3 referees should be sent to:  The Managing Director  Ghana Water Company Limited  P.O.Box MB 194  Head OFfice  Ministries - Accra  Closing Date: 22 April, 2022"
  },
  {
    "title": "Knowledge Management Expert",
    "company": "Ghana Water  Company Ltd.",
    "location": "Accra",
    "description": "Job Summary  The knowledge Management Expert will be in charge of handling all activities related to the sharing and storing of knowledge  Key Responsibilities  Monitor all project activities, expenditures and progress towards achieving the project output  Implementing initiatives and lead efforts for project evaluations, analysis and learning  Collecting, structuring and digitally storing of information, such as customer satisfaction  Developing and conducting customer satisfaction surveys as well as developing and maintaining low Income Urban Communities (LIUC) service databases  Efficiently liaising with staff and providing them the necessary guidance and support so that the team data collection and reporting efforts reap positive results  Oversee capacity building and support for internal knowledge acquisition, management and sharing: ensure relevant communities of practice are developed and strengthened  Translating gathered and available knowledge into materials (impacts... stories, factsheets, briefing notes, documentaries, etc) for dissemination to key internal and external stakeholders  Lead, in collaboration with relevant departments of GWCL to implement M&E of service delivery  Create ways to maintain a sustainable competitive advantage  Qualification Required & Experience  Bachelor's Degree in Social Science or related field  At least 3 to 5 years post-qualification working experience and sound knowledge of the \"donor sector\"  Location: Accra  How To Apply For The Job  Applications accompanied by supporting documents, names and addresses of 3 referees should be sent to:  The Managing Director  Ghana Water Company Limited  P.O.Box MB 194  Head Office  Ministries - Accra  Closing Date: 22 April, 2022"
  },
  {
    "title": "Office Secretary",
    "company": "The China Water Company Ltd.",
    "location": "Accra",
    "description": "China International Water & Electric Corp, based in Airport West, Accra is about to launch a new project and the following personnel is being recruited: Office Secretary  Qualification Required & Experience  Bachelor's Degree or above  More than 3 years work experience  Team management of more than 50 people  Location: Accra  How To Apply For The Job  Sending resume email to:  ty13910760145@outlook.dom  Or Mail To  China International Water & Electric Corp  House No. 206, Airport West  P.O.Box 0701,  Accra - Ghana  Closing Date: 13 November, 2021"
  },
  {
    "title": "Consultant  Compound Sanitation At WSUP Ghana",
    "company": "WSUP",
    "location": "Accra",
    "description": "WSUP supports local service providers to design and implement water, sanitation and hygiene (WASH) solutions to meet this objective in developing countries.  Funded by the Department for International Development (DFID) UK, WSUP Ghana plans to support the Kumasi Metropolitan Assembly (KMA) in implementing Government of Ghanas (GoGs) National Sanitation Policy and  The assignment will require as key-staff: one (1) Team Leader (Sanitation / BCC Expert), one (1) Social Mobilisation and Communication Expert, and one (1) Sanitation Engineer. The minimum requirements of each member are listed below.  Senior Engineer  Minimum a Masters in Public Health or Social Sciences;  Minimum 10 years hands on experience in promotion of household sanitation in Ghana;  Experience with CLTS and social marketing;  Must have been involved in similar assignment in the last seven (7) years;  Experience as a team leader in at least two (2) projects of this nature.  Strong knowledge of the sanitation... and hygiene sector in Ghana;  Ability to effectively and respectfully work with and lead a team of professionals; and  Excellent verbal and written English communication skills.  Social Mobilisation and Communication Specialist (Community Development Expert)  Minimum MA in social sciences, Public Health or related field;  At least 10 years of experience in community development;  Minimum of six (6) years in conducting formative research and the design of BCC strategies;  Strong knowledge of sanitation solutions and technologies in Ghana;  Proven experience in conducting focus group discussions;  Strong knowledge of the sanitation and hygiene sector in Ghana; and  Ability to effectively and respectfully work with a team of professionals.  Sanitation Engineer  Minimum Bachelors level degree in relevant field such as civil engineering;  At least five (5) years of proven and successful experience in developing and implementing compound latrine programmes;  Strong knowledge of the sanitation and hygiene sector in Ghana; and  Ability to effectively and respectfully work with a team of professionals.  Location: Ghana  How To Apply For The Job  Submission and Evalution of Proposals  The consultant is required to submit a technical and financial proposal to the contacts below before 17h00 on July 28, 2013.  WSUP Country Programme Manager, wsupghana@wsup.com  Mr. Anthony Mensah, Director of Waste Management Department (KMA), mensahanthony15@yahoo.com  The Technical Proposal Shall Include The Following  A brief description of the Consultant or firm and an outline of similar assignments conducted in the last five years  Detailed description of consultants approach to the assignment  Detailed description of the Consultants methodology for the assignment  The Consultants detailed work plan and schedule for executing the assignment  The Consultants team for executing the assignment showing various staff and their relevant expertise for the assignment including current and signed CVs  The Financial Proposal Shall Be Quoted In Ghana Cedis And Will Include All Costs Relevant For The Implementation Of The Assignment, Including The Following  Vehicles/Transportation  Personnel  Stationery  Subsistence of staff  All other relevant costs  Value Added Tax (VAT)  Proposals Shall Be Evaluated Based On The Following Principles  Approach to executing the assignment  Relevant experience of the consultant(s)  Methodology  Work Plan  Financial Proposal  Closing Date: 15 July, 2013"
  },
  {
    "title": "Apply: Business Development Manager at WaterAid",
    "company": "WaterAid",
    "location": "Ghana",
    "description": "Its hard to believe that today 844 million people do not have clean water and 2.3 billion do not have a decent toilet  around one in three of the worlds population. Every two minutes a child under five dies from diarrheal diseases caused by poor water and sanitation.  WaterAid is looking for a Senior Manager, Business Development to play a vital role in our mission to make clean water, decent toilets and good hygiene normal for everyone, everywhere by 2030.  Working within the Ghana Team, the Senior Manager, Business Development will:  Lead and develop a business development strategy and an action plan based on the existing donor scoping and funding plan  Implement a programme funding strategy, based on sustainable income growth for WaterAid Ghana to deliver its WASH objectives  Support the development of high-quality bids for submission to donors;  Lead on continuous donor scoping and relationship building, gathering and sharing intelligence  Management of bid development... processes for technical/narrative proposal and budgets, working closely with Programme and Finance Teams; and  Maintain an overview of all grants, follow-up implementation schedules, reporting timelines and ensuring compliance with grant agreements and contractual obligations.  To be successful, youll need:  A Masters degree in International Development, Institutional Development, Business Management / Administration, or related fields.  Strong experience in programme funding from institutional donors such as the EU, DFID, USAID, DANIDA etc., raising and managing funds from UN Agencies such as UNDP and UNICEF and development partners, managing relationships with the Government of Ghana and Civil Society Organizations in Ghana.  Good knowledge of international development, West Africa and Africa in general, with at least five years of experience at senior management level.  We started because no NGO like us existed. Well end when no organisation like us is needed. In the meantime, were making great progress  since 1981, we have reached 25 million people with clean water and, since 2004, 24 million people with sanitation.  Were looking for people who share a commitment to our vision. Were looking for people with an appreciation and respect for different people and ideas, and the energy and expertise to help tackle the most important challenges.  In return, you can expect to get inspiration from the change you help make happen, a sense of belonging and the feeling of being part of a global community. You will also experience stimulation and fulfilment, the chance to grow, and space to be yourself at your best. This is our pledge to you.  Application Procedures : How To Apply  Interested and qualified persons should visit the : WaterAid Recruitment Portal.  Then read through the job offer  Afterwards click on the Download button to download the job application procedures or follow the procedures below  If you are interested in the position and have the right skills and attributes, send your application, consisting of a letter of interest and a CV to ghrecruitment@wateraid.org using Application for Senior Manager, Business Development as the subject of the email.  WaterAid is committed to ensuring that wherever we work in the world there is no tolerance for the abuse of power, privilege or trust. WaterAid reinforces a culture of zero tolerance towards any form of inappropriate behaviour, abuse, harassment, or exploitation of any kind.  The safeguarding of our beneficiaries, staff, volunteers and anyone working on our behalf, isour top priority, and we take our responsibilities extremely seriously. All staff and volunteersare required to share in this commitment through our Global Code of Conduct. We will  conduct the most appropriate preemployment references and checks to ensure high standards are maintained.  WaterAid is an equal opportunities, disability-confident employer and committed to achieving  the highest standards of diversity, fairness and equality"
  },
  {
    "title": "Regional Learning Facilitator At International Water and...",
    "company": "IRCWASH",
    "location": "Accra",
    "description": "The International Water and Sanitation Centre (IRC) is leading multi-country six year international learning initiative known as Sustainable Services at Scale (Triple-S), to improve water supply to the rural poor. Triple-S seeks to promote and support processes aimed at moving from project-based one off construction of water systems to water services that last. Operating under the auspices of the Community Water and Sanitation Agency in Ghana and in partnership with other country stakeholders, the Triple-S Project is working within existing country frameworks to test models that will ensure sustainable water service delivery in Ghana.. It is expected that results/innovations from the piloting will inform the adaptation of policies and practices for delivering water services in Ghana.  Reporting  Description Of Job  Functionally report to CWSA Regional Director in the Brong Ahafo Region, but receive professional and supervisory direction from the Country Team Leader of the Triple-S... initiative.  Job Purpose  Represent Triple-S & IRC, Ghana in the assigned region and have overall responsibility for the operation of Triple-S and other relevant IRC programmes at that level with the objective of supporting the delivery of sustainable WASH services to communities in the region.  His/her responsibilities have a strong emphasis on piloting interventions aimed at sustainable service delivery including establishing and facilitating learning and documentation processes, research, and capacity building for key stakeholders in the WASH sector at the regional, district and water system level. Together with the other team members, he/she also be involved in developing the project strategy and supporting implementation of a variety of project activities  The Ideal Candidate Will  Lead in establishing and facilitating Regional & District Learning Alliance (LA) processes  Undertake action research activities in assigned zone around water service delivery approaches  Facilitate the conduct of institutional strengthening interventions to enhance the capacity of DWDs, service providers and civil society in pilot districts to deliver improved and efficient water services  Undertake communication & awareness creation activities around key water service delivery messages and themes within the assigned zone  Document local learning processes and events within the assigned zone  Support by contributing to development of papers on sustainable water service delivery approach based on learning and innovations from pilot districts  Support by contributing to the development of the project implementation strategy and plan  Compile comprehensive annual and four monthly reporting on activities int he assigned zone  Contract Period: The position will be on two year renewable contracts, subject to good performance  Monthly Remuneration: A competitive monthly salary with more than pleasant secondary labour conditions is offered in a stimulating and dynamic working environment where own initiative and self development are greatly encouraged  Qualification Required & Experience  The ideal candidate must have:  Masters Degree in Development Studies, Community and Adult Education, Social Sciences, Engineering and Planning or related field with minimum of seven years professional working experience or a Masters degree in Water Supply and Environmental Sanitation, Environmental Science, Water and Environmental Management, etc with 5 years experience  Demonstrated experience in Participatory research and analytical skills  Process documentation skills  Facilitation and coaching skills  Communication and writing skills  The Following Will Count As Advantage  Knowledge of the local context and the water sector in Ghana  Ability to work in a team environment  Flexible/adaptable capacity to work independently  Results orientated  Ability to work in multi-cultural and racial environment  Other Requirements  Ghanaian nationality  Willingness to work in the Brong Ahafo Region  Willingness to regularly travel both within Ghana and internationally  How To Apply For The Job  Interested candidates who meet the above criteria should submit their letter of application together with a detailed CV that gives details of a reliable telephone and email contact and contacts of three referees with a clear indication of the position being applied for. Applications should be sent to:  Community Water and Sanitation Agency  PMB  KIA - Accra  Email soft copies to: triple-s@ircghana.org  Closing Date: 11th July, 2012"
  },
  {
    "title": "Water and Sanitation Project in Ghana",
    "company": "Rotary Club of Montreal",
    "location": "Kumasi",
    "description": "We are excited to announce you today that our Rotary Club of Montral is undertaking another very important water, sanitation and microcredit project in Ghana. Walter Hughes, with whom we have already partnered in many projects, will lead this US$400,000 project, which will have a tremendous impact over 25,000 lives in 25 villages.  Our enthusiasm also comes from the fact that, in addition to being able to secure large grants from multiple Rotary Clubs and Districts and the Rotary Foundation, this project meets the eligibility criteria for a significant grant from the Canadian government. This latest grant is made possible through an agreement recently signed between the Canadian government and The Rotary Foundation of Canada (Community Development Partnership).  To give you a better idea about this marvellous big impact project, you will find attached the following documents:  1- A short summary of the project  2- Walter Hughess track record  3- Walters biography  4- An example of... a Canadian government grant for a project.  Our fundraising to amass the required $400,000 is running smoothly, but we are still $58,000 short of our objective. Since this shortfall is a significant amount for our small Rotary Club of Montral, we ask you for a financial contribution so that we can achieve our goal"
  },
  {
    "title": "Shift Leader, Waste Water Treatment At Accra Compost And Recycling...",
    "company": "Accra",
    "location": "Ghana",
    "description": "Job Summary  This individual will be responsible for the waste treatment process during a shift and ensure the smooth operation of all segments of the Waste Water Treatment Plant and also ensure that the treatment process during their shift is in accordance with the set criteria.  Qualification Required & Experience  The preferred candidate will have  An HND in Engineering or a Diploma in a relevant field or equivalent with a minimum of three years relevant experience.  Experience in a treatment or processing facility will be an asset.  Location: Accra  How To Apply For The Job  Apply to:-  fagbodza@acarpghana.com  Closing Date: 01 November, 2014"
  },
  {
    "title": "Site Electrification Engineers (3 Positions)",
    "company": "The China Water Company Ltd.",
    "location": "Accra",
    "description": "China International Water & Electric Corp, a company specialising in International electrification, road and hydropower construction, is looking for committed employees to join our team:- Site Electrification Engineers  Qualification Required & Experience  Male  Bachelor or Associate degree in Electrical Engineering.  Over Eight (8) Years Site Construction Experience in Rural Electrification Projects  Proficient Use of Microsoft Office / Excel / PowerPoint Software  Proficient Use of Auto CAD software  Location: Accra  How To Apply For The Job  Interested persons should send their application and CVs to:  stella.nee@hotmail.com  Closing Date: 30 May, 2016"
  },
  {
    "title": "Water Utility Performance Improvement Specialist for WASHFIN 2 Project",
    "company": "confidential",
    "location": "Ghana",
    "description": "The USAID-funded WASH-FIN 2 project in India, implemented by Tetra Tech International Development, is currently accepting expressions of interest for a Water Utility Performance Improvement (WUPI) Specialist. This position will be located in the project office in Accra, Ghana.  Position Description: The Water Utility Performance Improvement Specialist works under guidance of the Country Team Leader to identify and leads engagements with Ghanas Water Service Providers (WSPs) in small towns as well as Ghana Water Limited to provide technical support to improve and promote sustainable service delivery. The WUPI will support the National, regional and municipal operations, the private sector and other stakeholders to define the framework for appropriate development and management of water service provision in the country, including strengthening institutional and regulatory frameworks for engagement of private sector actors. The WUPI will also support WSPs in performance improvement data... management and technical conceptualization and management of intervention measures to be implemented through Grants Under Contract (GUC) supporting infrastructure and systems.  Responsibilities:  Identify and establish key baseline indicators for performance monitoring and assessment of water services providers based on acceptable performance standards including the Utility of the Future (UoF)  Support small town piped water supply by evaluating and scaling models for optimum management and viability of service providers.  Prepare selection criteria for water service providers to be supported in the program and methodology for data capture and analysis for the selected indicators including tools and templates.  Support the Grants Specialist in supervising and monitoring implementation of identified WASH interventions for performance improvement.  Lead WASH-FIN 2 activities in identifying interventions for bankable WSP projects and facilitate provision of on demand technical support to review and prepare necessary engineering designs and requisite documentation to enable the WSPs access funding/financing for the identified projects.  Support the WSPs in preparation and review of other requisite transaction documents including financial proposals and terms sheets to ensure financial close.  Support GWL in developing climate resilient investments to demonstrate and enhance cost recovery and financial sustainability.  Promote Service Provider Accountability and Customer Voice Learning and Partnerships  Develop knowledge materials from policy and evidence-based research to promote dialogue on how to improve WASH service delivery in Ghana.  Document learnings and participate in knowledge sharing and dissemination.  Work with Global Monitoring and Evaluation Specialist to track implementation of the projects and the outcomes from the interventions developed.  Facilitate knowledge management through partnership with key actors in the small-town water space.  Qualifications:  Bachelors degree in public health engineering, civil / environmental engineering or related field; masters degree is preferred (relevant experience and another university degree may substitute for the degrees mentioned).  Minimum of ten (10) years of work experience, with at least five years experience in the design, construction, operations and/or management of water infrastructure.  Experience working with a water utility on improving technical and financial performance and building capacity.  Registration by relevant professional bodies such as Ghana Institution of Engineering (GhIE) is preferred.  Broad-based understanding of the water sector in Ghana is required, including technical, financial and governance aspects of services delivery; more detailed knowledge of sector policies, institutions, regulation, accountability, and incentive systems is preferred.  Experience supporting USAID-funded, or Development funded projects highly preferred.  Excellent English speaking and writing skills, including technical and report writing skills.  Willing to travel to field project sites, notably in northern Ghana.  Excellent interpersonal skills, including patience, diplomacy, willingness to listen and respect for colleagues. Capable of working both individually and as part of a team.  Ability to work effectively in a sometimes intense and demanding environment and deliver high-quality outputs.  Flexible and willing to perform tasks not directly related to role when required, and sometimes work irregular hours.  Ghanaian nationals are strongly encouraged to apply.  To be considered, please submit the following:  Cover Letter  CV  Please indicate where you saw Tetra Techs IDS ad posted.  Please ensure that only the requested documents noted above are submitted. Only candidates who have been selected for an interview will be contacted. No phone calls, please.  Tetra Tech International Development is committed to safeguarding and technical excellence in equality and social inclusion. Our team of dedicated Gender, Youth, and Social Inclusion (GYSI) advisers work closely with our staff and partners to share international norms and best practices to improve the livelihoods of the worlds most marginalized groups. Tetra Tech International Development is especially interested in candidates that can contribute to our Diversity, Equity, and Inclusion (DEI) initiatives that aim to expand inclusion and an authentic sense of belonging to all our staff regardless of background.  Reasonable Accommodations:  We are dedicated to hiring an inclusive workforce. If you would like to request reasonable accommodations during the application process, please visit or contact our Our recruitment team looks forward to engaging in an interactive process to provide reasonable accommodations for candidates.  Tetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in more than 550 locations around the world. Our reputation rests on the technical expertise and dedication of our employees  27,000 associates working together to provide smart, scalable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development"
  },
  {
    "title": "Water Utility Performance Improvement Specialist for WASHFIN 2 Project",
    "company": "confidential",
    "location": "Ghana",
    "description": "The USAID-funded WASH-FIN 2 project in India, implemented by Tetra Tech International Development, is currently accepting expressions of interest for a Water Utility Performance Improvement (WUPI) Specialist. This position will be located in the project office in Accra, Ghana.  Position Description: The Water Utility Performance Improvement Specialist works under guidance of the Country Team Leader to identify and leads engagements with Ghanas Water Service Providers (WSPs) in small towns as well as Ghana Water Limited to provide technical support to improve and promote sustainable service delivery. The WUPI will support the National, regional and municipal operations, the private sector and other stakeholders to define the framework for appropriate development and management of water service provision in the country, including strengthening institutional and regulatory frameworks for engagement of private sector actors. The WUPI will also support WSPs in performance improvement data... management and technical conceptualization and management of intervention measures to be implemented through Grants Under Contract (GUC) supporting infrastructure and systems.  Responsibilities:  Identify and establish key baseline indicators for performance monitoring and assessment of water services providers based on acceptable performance standards including the Utility of the Future (UoF)  Support small town piped water supply by evaluating and scaling models for optimum management and viability of service providers.  Prepare selection criteria for water service providers to be supported in the program and methodology for data capture and analysis for the selected indicators including tools and templates.  Support the Grants Specialist in supervising and monitoring implementation of identified WASH interventions for performance improvement.  Lead WASH-FIN 2 activities in identifying interventions for bankable WSP projects and facilitate provision of on demand technical support to review and prepare necessary engineering designs and requisite documentation to enable the WSPs access funding/financing for the identified projects.  Support the WSPs in preparation and review of other requisite transaction documents including financial proposals and terms sheets to ensure financial close.  Support GWL in developing climate resilient investments to demonstrate and enhance cost recovery and financial sustainability.  Promote Service Provider Accountability and Customer Voice Learning and Partnerships  Develop knowledge materials from policy and evidence-based research to promote dialogue on how to improve WASH service delivery in Ghana.  Document learnings and participate in knowledge sharing and dissemination.  Work with Global Monitoring and Evaluation Specialist to track implementation of the projects and the outcomes from the interventions developed.  Facilitate knowledge management through partnership with key actors in the small-town water space.  Qualifications:  Bachelors degree in public health engineering, civil / environmental engineering or related field; masters degree is preferred (relevant experience and another university degree may substitute for the degrees mentioned).  Minimum of ten (10) years of work experience, with at least five years experience in the design, construction, operations and/or management of water infrastructure.  Experience working with a water utility on improving technical and financial performance and building capacity.  Registration by relevant professional bodies such as Ghana Institution of Engineering (GhIE) is preferred.  Broad-based understanding of the water sector in Ghana is required, including technical, financial and governance aspects of services delivery; more detailed knowledge of sector policies, institutions, regulation, accountability, and incentive systems is preferred.  Experience supporting USAID-funded, or Development funded projects highly preferred.  Excellent English speaking and writing skills, including technical and report writing skills.  Willing to travel to field project sites, notably in northern Ghana.  Excellent interpersonal skills, including patience, diplomacy, willingness to listen and respect for colleagues. Capable of working both individually and as part of a team.  Ability to work effectively in a sometimes intense and demanding environment and deliver high-quality outputs.  Flexible and willing to perform tasks not directly related to role when required, and sometimes work irregular hours.  Ghanaian nationals are strongly encouraged to apply.  To be considered, please submit the following:  Cover Letter  CV  Please indicate where you saw Tetra Techs IDS ad posted.  Please ensure that only the requested documents noted above are submitted. Only candidates who have been selected for an interview will be contacted. No phone calls, please.  Tetra Tech International Development is committed to safeguarding and technical excellence in equality and social inclusion. Our team of dedicated Gender, Youth, and Social Inclusion (GYSI) advisers work closely with our staff and partners to share international norms and best practices to improve the livelihoods of the worlds most marginalized groups. Tetra Tech International Development is especially interested in candidates that can contribute to our Diversity, Equity, and Inclusion (DEI) initiatives that aim to expand inclusion and an authentic sense of belonging to all our staff regardless of background.  Reasonable Accommodations:  We are dedicated to hiring an inclusive workforce. If you would like to request reasonable accommodations during the application process, please visit or contact our Our recruitment team looks forward to engaging in an interactive process to provide reasonable accommodations for candidates.  Tetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in more than 550 locations around the world. Our reputation rests on the technical expertise and dedication of our employees  27,000 associates working together to provide smart, scalable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development"
  },
  {
    "title": "Administrative And Programme Officer",
    "company": "IRCWASH",
    "location": "Accra",
    "description": "IRC is an independent international non-profit organisation in the field of water supply, sanitation, hygiene (WASH) and integrated water resources management (IWRM). IRC is headquartered in The Netherlands working in various countries across 4 continents.  IRC Ghana, an international think-and-do tank that works with governments, NGOs, businesses and people around the world to find long-term solutions to the global crisis in water, sanitation and hygiene (WASH) services, is looking for a dynamic, well organised and result-oriented person to fill the position of; Administrative And Programme Officer  The ideal candidate will report to the Finance and Operations Manager but will have functional relationships with the Programme staff in course of the performance of his/her duties.  Summary Of Duties And Responsibilities  Provides executive support services to Country Director (CD)  Responsible for office and operations and management  Provides support to programmes in the IRC Country... Office  Supports Human Resource functions & performance management  Supports the implementation of human resource, operational and procurement manuals for effective functioning of the office.  Liaises with IRC Netherlands & Programme staff for events and meeting - planning and coordination in coordinating  Manages procurement, logistics and transport services  Responsible for IRC GH google drive and filing systems  Responsible for mission and travel planning and coordination  Participates in management meetings and responsible for minutes and notes taking  Supports in drawing up contracts of employment and consultancy  Oversees the work of the Administrative Assistant, Drivers and a Cleaner  Performs other duties and tasks at the request of management  Contract Period  The position will be for an initial one year renewable contract, subject to good performance  Monthly Remuneration  A competitive monthly salary with more than pleasant secondary labour conditions are offered in a stimulating and dynamic working environment where own initiative and self-development are greatly encouraged.  Qualification Required & Experience  A very good university first degree administration or social science of equivalent, (master's degree will be an added advantage  Five or more years experience in similar position  Outstanding office administration and managerial skills  A team player with excellent interpersonal organizational skills  Advanced skills in Microsoft office applications  Appreciable knowledge in and procurement and financial management  Work experience in a donor-funded project /programme environment will be an added advantage  Good communication-both verbal and written  Excellent report writing skills  Location: Accra  How To Apply For The Job  Interested candidates who meet the above criteria should submit their application letter together with a detailed CV that includes a reliable telephone and email and contract of three referees with a clear indication of the position being applied for to:  A detailed CV that includes a reliable telephone and email contact; and contacts of three referees  Certified photocopies of relevant certificates of highest academic qualifications  Email address: ghana@ircwash.org  Or  Can Send Application To  Programme Manager  IRC Ghana  P.O. Box CT 9531  Cantonments, Accra  Closing Date: 30 September, 2016"
  },
  {
    "title": "Project Manager  Rural Water Service Delivery",
    "company": "Access Development",
    "location": "Daboase",
    "description": "Access Development Ltd and its subsidiary AD Water Services Ltd (ADWS) train and equip water borehole drilling businesses and water service delivery businesses to improve community water supply.  ADWS is expanding operations with the goal of becoming one of Ghana's leading rural water delivery companies. ADWS is supported by Access Development Ltd that manufactures industry-related drilling tools, equipment and hand pumps in Savelugu, Tamale.  Description  AD Water Services Ltd is seeking a Project Coordinator to be responsible for leading and managing a team to deliver high-quality reliable water supply for our rural clients.  The project coordinator will oversee the activities of quality control staff and contractors and liaise with District and Community leadership.  The project will establish a sustainable water service delivery structure for more than 100 communities providing them with a safe reliable water supply supported by payments for service delivery.  Qualification... Required & Experience  BS/BA in a relevant discipline.  At least 8 years of practical experience working in rural Ghana, 2 years in management.  Experience working closely with District Government  Must be flexible, willing to perform other duties and work irregular hours.  Willingness to live and work in rural Ghana  Location: Daboase, Western Region  How To Apply For The Job  To Apply please send cover letter and resume with either Project Manager or Operations Manager in the subject line to:  Jobs.Ghana@accessdevelopment.co  Closing Date: 31 January, 2017  Only shortlisted candidates will be contacted"
  },
  {
    "title": "Incharge  Administration At WaterHealth Ghana (WHG)",
    "company": "WaterHealth International",
    "location": "Ghana",
    "description": "WaterHealth Ghana (WHG) is a wholly owned subsidiary of Water Health International, a Company that aims at providing scalable, safe drinking water solutions to underserved areas through advanced technology and innovative business models. Headquartered in Irvine, USA, WaterHealth International (holding Company of WHG) runs operations worldwide including Ghana, Liberia, Nigeria Bangladesh and India. WHG came into the existence in 2008 with a vision to provide safe, scalable and affordable drinking water to the underserved communities across Ghana. WHI runs similar operations in India, Nigeria, Liberia and Bangladesh.  Position Title: Incharge - Administration  Designation: Executive  Reporting to: Business Head, Ghana  Function: Administration  Location: Accra, Ghana  Function Description  The incumbent would be responsible to provide administration and technical support to the employees at the company office and Guest House at assigned location.  Contacts of the function  External To... WHG  Vendors  Internal To WHG  WHG Employees  Areas of Responsibility Responsibility (See Legend)  # Tasks  Adept at managing administrative activities involving purchase, maintenance and upkeep of all required equipments, furniture, stationery, provisions, at company office and guest house.  Planning and preparing monthly reports pertaining to finance & functional head required for maintaining office infrastructure and facilities.  Maintain MIS for the location and prepare budget Vs actual expenses made.  Guest House bookings, provisions and staff management.  Vendor Management.  Ensure proper documentation, Business Control checks, audits related to administration.  Monitor all Statutory Compliance areas. Full  Event Management, organizing meetings, conferences and Samwad  Liasioning and coordinating with various departments with the corporate office and branch.  Asset Management of all Site operations assets across multiple locations.  Provide recommendations to the Head - Shared Services on improvements to the current systems, policies and procedures.  Canteen management.  Complete other duties as assigned.  Provide back up to Travel desk resource & telecom help desk resource.  Qualification Required & Experience  Education: Graduate (any)  Functional Experience : Should have a minimum 3 years of experience of working in a same role  Years of Experience: The incumbent should have about 5 years of experience of working in a similar role  Next Level: The incumbent could grow up to the role of Head - Administration  Location: Accra  How To Apply For The Job  All interested qualified persons should submit their application letter and CV to:  HRGhana@waterhealth.com  Closing Date: 05 April, 2015"
  },
  {
    "title": "Strenghtening GA WEST EHSDS Enforcement And Management Capacity...",
    "company": "WSUP",
    "location": "Ghana",
    "description": "WSUP is a non-profit partnership between the private sector, NGOs and research institutions focused on solving the global problem of inadequate water and sanitation in low-income urban communities. WSUP brings lasting solutions to low-income areas by working in partnership with service providers, including water utilities, local authorities and businesses, and the communities they serve. WSUP strengthens the capacity of service providers to deliver sustainable city-wide water and sanitation services, promote good hygiene and raise the environmental standards of low-income communities.  From incorporation in 2005, WSUP has grown rapidly to a 10?12m organisation and has plans for further expansion over the next five years. The organisation is now at a pivotal stage in its growth. It presently operates six well?developed, respected country programmes in Africa and Asia (Bangladesh, Ghana, Kenya, Madagascar, Mozambique, Zambia) to strengthen public and private sector service providers to... improve the delivery of affordable services to low income consumers WSUP has recently expanded its portfolio of operations to include the building and strengthening of private sector provision in urban water and sanitation services and the sale of consulting services on all aspects of low income urban WASH (Water, Sanitation and Hygiene) to disseminate learning and increase impact. All of these operations are supported by research, communications, funding and finance and resources teams.  For more information about WSUP's vision and approach, see  Introduction  Water and Sanitation for the Urban Poor (WSUP) is a tri-sector partnership between the private sector, civil society and academia that brings local and global expertise together to deliver water and sanitation services, and promotes improved hygiene, to the urban poor. WSUP supports the development of situation specific models and establishing stronger links between multiple stakeholders to mobilize investment finance for pro-poor service scale-up. It achieves this through supporting the adoption and replication of effective, sustainable and scalable models of pro-poor urban water and sanitation services by service providers, local and/or national governments. WSUP operates globally and in Ghana, it has programme offices in Kumasi and Accra, with key focus on project sites within these cities.  WSUP is working with the Ga West Municipal Assembly (GWMA) to improve sanitation services delivery, and has supported Ga West in the development and launch of a 5-year compound sanitation implementation plan to increase access of toilets to low-income communities; the plan is referred to as Toilet in Every Compound. The objective of the plan is to create access to safe compound toilets for 80,000 residents by 2019.  Background  The current enforcement management for environmental sanitation regulation as defined under the Expanded Sanitary Inspection Compliance Management and Enforcement (ESICOME), a national-level programme guideline, entails:  the provision of bylaws to regulate behaviour;  an inspection system for checking compliance;  sanctioning mechanisms for failure to comply; and  a system for conflict resolution (facilitation / mediation role).  In Ga West, the enforcement of environmental sanitation regulations is not fully compliant with the ESICOME provisions and therefore makes enforcement ineffective.  Overall, the GWMA has not been able to translate the NESSAP (National Environmental Sanitation Strategy and Action Plan), as well as its MESSAP (Municipal Environmental Sanitation Strategy and Action Plan) and the ESICOME on the ground through the existing enforcement model.  Assignment Objectives  The overall objective of this consultancy assignment is to build the capacity of Ga Wests EHSD to implement the compound sanitation strategy, and this will include (1) strengthened capacity to enforce relevant sanitation bylaws, (2) strengthened capacity to implement the 5-year compound sanitation implementation plan, and (3) strengthened capacity to better manage, report, motivate, receive feedback and enable staff to perform their duties.  A further objective of the assignment is to engage the Ga West Human Resource Department and the EHSD to review EHSD staff performance indicators.  Qualification Required & Experience  The assignment will require as key-staff:  one (1) Team Leader (Public/Environmental Health Specialist);  one (1) Public Sector Performance Improvement Specialist; and  any other experts deemed necessary by the consultant.  The Team leader should possess at least a Masters Degree in a relevant topic (e.g. Community Development, Public Administration, etc), with at least five (5) years of experience in providing capacity building support to Environmental Health And Sanitation Departments of MMDAs.  Location: Accra  Bidding  How To Apply For The Job  Request for full RFP: We invite interested consultants to request the full version of the RFP from the contact below.  Submission of Proposals: We invite interested consultants to present technical and financial proposals to the (same) contact below before Monday 10th August, 2015.  Contact email address:  wsupghana@wsup.com  Or Call Us Tel  0500-437015 / 0249-536815  Closing Date: 07 August, 2015"
  },
  {
    "title": "Project Manager At WSUP Ghana (Kumasi)",
    "company": "WSUP",
    "location": "Kumasi",
    "description": "WSUP is a non-profit partnership between the private sector, NGOs and research institutions focused on solving the global problem of inadequate water and sanitation in low-income urban communities.  WSUP brings lasting solutions to low-income areas by working in partnership with service providers including water utilities, local authorities and businesses, and the communities they serve.  WSUP strengthens the capacity of service providers to deliver sustainable city-wide water and sanitation services, promote good hygiene and raise the environmental standards of low income communities.  WSUP achieves this through supporting the adoption and replication of effective, sustainable and scalable models and institutional capacity development for pro-poor urban water and sanitation services by service providers and/or national governments. Additionally, WSUP empowers service providers to mobilise investment finance for pro-poor service scale-up and promotes successful approaches globally... WSUP has a Country Programme office in Kumasi, with key focus on project sites in Kumasi and Accra.  Project Manager Kumasi  Programme: WSUP Ghana  Reporting To: Country Programme Manager (CPM)  Base: Kumasi  Contacts: Internal  Programme Director (PD)  Country Programme Manager  Project Officer Community Development  Project Officer Sanitation & Hygiene  Contacts: External  Job Purpose  The purpose of the Project Manager Kumasi role is to provide support to the WUSP Country Project Manager in order to ensure that all aspects of the implementation of the project supported by WSUP proceed in a coordinated, efficient and timely manner in accordance with the agreed programme and budget.  Main Responsibilities  Support the CPM to plan and implement the water, sanitation and hygiene activities set out in the WSUP programme and to achieve the given targets within the allocated resources and time frame.  Deliver the project objectives for Kumasi, managing local procurement tasks and the recruitment of sub-consultants and sub-contractors, preparing and monitoring Task Orders and Consultancy Agreements.  Assist the CPM in the coordination of project partners including government, civil society, private sector.  Facilitate the design and formation of context based management models for service delivery to low income consumers.  Work in partnership with local service providers in the implementation of service improvements.  Identify capacity needs of service providers, institutions and other management structures involved in service delivery and coordinate the delivery of capacity development to address the gaps  Ensure adequate post construction O & M support is in place for the institutional structures put in place to support service delivery.  Facilitate the development of forms of agreement between service providers and others to ensure the sustainability of the relevant management models.  Prepare and submit activity and financial reports to CPM on project implementation.  Assist with the documentation and sharing of learning and best practices with project stakeholders, liaising with the WSUP M&E Manager and Communications Officer.  Assist the CPM and PD with the financial management and monitoring of the Ghana programme.  Provide quality assurance for all design, construction and maintenance processes in accordance with the programme standards, and routinely suggest improvements to ensure high quality standards and cost effectiveness.  Ensure compliance of all legal, health, safety and environmental requirements of WSUP projects construction activities in Ghana in accordance to all internal, national and international standards.  Supervise WSUP Project Officers.  Undertake any other project-related tasks that shall be assigned by the CPM.  Qualification Required & Experience  A minimum of Bachelors Degree, or equivalent qualification, in civil or construction or environmental health engineering with strong understanding of development project management is a mandatory educational and experiential requirement.  A minimum of 7 years of demonstrable competence and experience in integrated/community-based, water supply and sanitation improvement projects for international development organisations. Experience in low income urban WASH is an added advantage.  Demonstrable experience of construction contract management and contractual adherence to national and international standards.  Proven experience of 2 years working in a project management role, with a track record of success in achieving results.  Excellent computer skills, with an understanding of MS Project, Engineering and GIS software desirable.  Should be a team player, driven by own initiative, good communicator and have ability to work under minimum supervision  Some experience working in a commercially oriented water utility desirable.  Leadership and inter-personal skills.  Ability to work effectively within a small, multi-disciplinary programme team and to liaise with institutional partners, consultants, contractors, community representatives and local politicians.  Motivated by the mission of WSUP.  Good written and spoken English is essential. Ability to speak Twi would be desirable.  Location: Kumasi  How To Apply For The Job  This is a challenging opportunity for a dedicated, ambitious and highly motivated professional available almost immediately. If you meet the above requirements, please send a completed application form and details of your current salary to:  wsupghana@wsup.com  Closing Date: 11 November, 2013  We regret that only short-listed candidates will be contacted.  WSUP is an equal opportunities employer"
  },
  {
    "title": "Finance Officer At WSUP Ghana (Kumasi)",
    "company": "WSUP",
    "location": "Kumasi",
    "description": "WSUP is a non-profit partnership between the private sector, NGOs and research institutions focused on solving the global problem of inadequate water and sanitation in low-income urban communities.  WSUP brings lasting solutions to low-income areas by working in partnership with service providers including water utilities, local authorities and businesses, and the communities they serve.  WSUP strengthens the capacity of service providers to deliver sustainable city-wide water and sanitation services, promote good hygiene and raise the environmental standards of low income communities.  Job Summary  The purpose of the Finance Officer Kumasi role is to provide support to the WUSP Country Programme Team in order to ensure that all financial and administrative aspects of the implementation of the project supported by WSUP proceed in a coordinated, efficient and timely manner in accordance with the agreed programme and budget.  The Finance Officer shall report to the Ghana Country... Programme Manager (CPM) who will report to the Programme Director (PD).  The Finance Officer shall also report to the WSUP Finance Manager in London for all matters concerning WSUP Financial Policies and Procedures.  Specific Duties  To be responsible for all aspects of finances and office administration for the WSUP Ghana programme office in accordance with WSUP Policies and Procedures as notified by the Finance Manager and Programme Director at WSUP Secretariat, London.  Finance  Responsible for monitoring, coordinating and checking all contracts, PSAs and Task Orders that are required to deliver the country programme activities. To assist the Country Programme Manager and Programme Director in preparing the financial sections of contract agreements.  Ensure that all disbursements are properly undertaken and to ensure that all payments made under contracts and Task Orders are correct and in accordance with signed agreements.  Assist the Country Programme Manager in ensuring that all expenditure is necessary and appropriate for the delivery of the programme objectives and is in accordance with the funders accounting requirements.  Administer the processing of all expenditure relating to the programme office including; proper authorisation by the budget manager (CPM or PD), proper coding according to the WSUP code lists, data-capture onto the accounting system and payments to suppliers by due dates.  Ensure that the WSUP Ghana accounting is in accordance with Ghanaian legal regulations and to prepare all financial reports and statements required by law and national organisations.  Assist the Country Programme Manager in monitoring staff time-sheets in accordance with the budgets agreed and funding available.  Ensure the correct payment of monthly salaries for all staff directly employed by WSUP Ghana, including correct calculation and deduction of all local taxes etc.  Ensure all local taxes are properly recorded and promptly paid.  Prepare monthly bank reconciliations and other balance sheet reconciliations.  Manage the petty cash, including cash advances for staff and guests to international workshops, ensuring compliance with WSUP's expense policy and proper authorisation, coding and recording of all items.  Send all monthly financial returns to the WSUP Secretariat in London by the required deadlines.  Review all expenditure reports prepared by the local WSUP Member offices against their Task Orders. Ensure that all expenditure is appropriate to WSUP, is properly coded and authorised. To prepare financial reports for inputting into WSUP's accounting system.  File all WSUP Ghana financial records so that they can be easily available when required for audit.  Maintain an asset register for all WSUP Ghana computer & office equipment and vehicles.  Ensure appropriate insurance for WSUP Ghana assets and also as required by local regulations.  Ensure that vehicle log books and maintenance records are kept.  Prepare schedules of expenditure for reporting to Funders, liaising with WSUP Secretariat in London  Liaise with and prepare schedules for auditors as required  Issue receipts for all money received locally and pay them into the bank promptly  Ensure compliance with all other local legal regulations, particularly as affects registration requirements.  Any other financial or work that may be required by CPM and PD or WSUP Secretariat Finance Manager.  Funding  Assist the Country Programme Manager and the WSUP Secretariat Funding Team with the preparation of funding applications to both local and international agencies; in particular to assist with preparing the budgets.  Assist the Programme Funding Officer in maintaining and updating the Programme Funding Strategy and Action Plan in consultation with the Country Programme Manager and Programme Director.  Office Administration  Assist the Country Programme Manager to ensure the smooth day-to-day running of the WSUP Ghana office.  Maintain Personnel records for all Ghana staff including copies of all contractual correspondence. Ensure WSUP Ghana complies with all local labour laws and with WSUP's HR Policy.  Duration  The Finance Officer will be recruited as soon as possible and employed on a long term basis (unlimited period) as part of the WSUP team based in Kumasi.  Qualification Required & Experience  The Finance Officer shall have the following:  Essential  Suitable professional qualifications relevant to perform the above mentioned tasks competently and with responsibility. A finance related graduate degree and/or a recognised professional Finance or Accounting qualification is preferred.  Able to demonstrate that they can satisfactorily perform the duties by reference to their previous work experience. This may have taken place as a Finance Officer or Manager in private or public sector organisations.  Good communications skills including a satisfactory level of spoken and written English communication.  A good level of expertise with Excel, including the ability to write formulae. A satisfactory level of computing skills with accounting software packages. Willing to learn.  Experience of preparing budgets.  Able to manage a busy workload and consistently meet deadlines whilst maintaining a meticulous attention to accuracy.  Able to work as a key member of a small team and to take the lead in advising the Country Programme Manager.  Committed to the vision and aims of Water and Sanitation for the Urban Poor.  Desirable  Experience with preparing budgets for funding applications.  Knowledge of local taxes and experience of payroll preparation.  Experience or understanding of the accounting requirements of international funding organisations.  Accounting experience in the charity or not-for-profit sector.  Experience in using Sun Accounts  Location: Kumasi  How To Apply For The Job  This is a challenging opportunity for a dedicated, ambitious and highly motivated professional available almost immediately. If you meet the above requirements, please send a completed application form and details of your current salary to:  The Country Programme Manager, By Email To  ibmusah@wsup.com  Closing Date: 22 January 2013  We regret that only short-listed candidates will be contacted.  WSUP is an equal opportunities employer"
  },
  {
    "title": "Head  Finance  Ghana At WaterHealth Ghana (WHG)",
    "company": "WaterHealth International",
    "location": "Ghana",
    "description": "WaterHealth Ghana (WHG) is a wholly owned subsidiary of Water Health International, a Company that aims at providing scalable, safe drinking water solutions to underserved areas through advanced technology and innovative business models. Headquartered in Irvine, USA, WaterHealth International (holding Company of WHG) runs operations worldwide including Ghana, Liberia, Nigeria Bangladesh and India. WHG came into the existence in 2008 with a vision to provide safe, scalable and affordable drinking water to the underserved communities across Ghana. WHI runs similar operations in India, Nigeria, Liberia and Bangladesh.  Position Title: Head - Finance - Ghana  Level:L7  Reports to: Head - Accounts (Subsidiaries)  Function: Finance  Location: Accra, Ghana  Function Description  The incumbent would be responsible for managing the accounts and finance operations for all the subsidiaries of WHG in Africa.  Qualification Required & Experience  Education: A.C.C.A., C.I.M.A. or I.C.A. ... Functional Experience : Should have a relevant experience of 8 to 10 years  Other : Knowledge/Added qualification on IFRS  Years of Experience: The incumbent should have about 6 to 8 years of experience of working in international markets Account Soft ware: Should have Sound konwledge in accounting software Quick Book  Location: Accra  How To Apply For The Job  All interested qualified persons should submit their application letter and CV to:  HRGhana@waterhealth.com  Closing Date: 05 April, 2015"
  },
  {
    "title": "Knowledge Management & Communications Snr. Officer - International...",
    "company": "International Water Management Institute",
    "location": "Tamale",
    "description": "The International Potato Center (CIP), a CGIAR Research Center, is seeking to recruit a Knowledge Management and Communications Senior Officer, based in Tamale, Ghana.  This position will be hosted by the International Water Management Institute (IWMI).  The Senior Officer will lead the knowledge management and communications component of the GROWING project which is an integrated climate-smart, Agriculture-Nutrition-Marketing project that aims to improve the financial and nutritional security of women, youth, and young children in Ghana. A significant part of the role of this position is to lead and coordinate all quantitative and qualitative data and reports are digitally archived in a workspace, and the project achievements are properly communicated through different communication outlets such as websites (blog stories, briefs, leaflets, training cards/graphics, banners,), mainstream media (TV and radio), exhibitions and fairs, social media (WhatsApp, Facebook, Instrgram, Twitter... etc.), workshops, Dashboards, online workspace, etc. The senior officer should also train all the project staff in digital monitoring and communication techniques. Key Responsibilities:  Lead the planning and implementation of the knowledge management and communication related strategy of the GROWING project.  Coordinate the proper documentation and digital archiving of all monitoring and survey data in the project Workspace.  Coordinate with all other officers of the GROWING project to ensure that the relevant research and development data files and reports are monitored using appropriate digital tools and archived in the project workspace.  Train research staff in proper data management, file organization, archiving of knowledge outputs and use of digital monitoring and training tools.  Assure that all project staff are backing up their data and reports on the project workspace on a regular basis  Lead and coordinate with team members to develop various types of communication materials including blog stories, fact sheets, leaflets, project briefs, etc. and post in the CIP communication website and project websites.  Coordinate and lead the use of different mainstream media (radio discussions, TV documentaries, jingles, etc.) and social media (WhatsApp, Facebook, Instagram, Twitter, etc.) to communicate about the project progresses and achievements.  Assure all project generated knowledge and communication outputs are available on the Sweetpotato Knowledge Portal and the CIP website and a project page on the Portal is updated monthly  Develop a term of reference for entities or consultants assisting in the development of videos or other communication materials and liaise with the project manager for execution.  Collaborate with other partner organizations and other team members in exploring new techniques and options for managing and disseminating knowledge  Perform other related tasks requested by the supervisor. Educational Qualifications, Experience, Knowledge & Skills Required:  BSc degree in information technology, communication, social sciences, or -related area. Masters degree is preferred  Four years of experience collecting and managing quantitative data sets and at least two years of professional experience in developing and implementing communication and knowledge management strategies or exemplary communications results in fewer years.  Programming skills in use of ODK, and practical skills in Microsoft software package (Power BI, Excel, Word, PowerPoint, etc.).  Excellent data and file management skills  Demonstrated experience working with websites, dashboards, and other new media technologies.  Strong and effective use of social media skills for project management related communications  Solid understanding of integrated project management principles strongly required  Excellent communication and interpersonal skills, ability to work in multidisciplinary and multicultural teams, proactive approach, with ability to find creative ways to solve problems  Proficient writing and speaking abilities in English  Knowledge of one of the local languages in Northern Ghana (Dagbani, Gonja, Mampruli, Likpakpa, Chekosi, etc.).  This is a nationally recruited position and only Ghana nationals & permanent residents will be considered. The successful candidate will be issued a contract by IWMI & the initial contract duration will be two years, with a probationary period of six (6) months. The contract may be renewed based on performance and the availability of funds.  Why should you consider this opportunity?  CIP is a global and reputable international organization that has a strong, state-of-the-art R&D background.  CIP is dedicated to achieving food security, improved nutrition and well-being, and gender equality for poor people in root and tuber farming and food systems of the developing world.  CIP is a member of the CGIAR, a global research partnership for a food secure future dedicated to reducing poverty, enhancing food and nutrition security, and improving natural resources.  HOW TO APPLY: Apply for the position by following the application instructions at https://cipotato.org/open-vacancies/. We will be accepting applications through 24:00 (PET) on December 01, 2023. Your application must include a cover letter illustrating your suitability for the above position against the listed qualifications, competencies, and skills, together with a detailed CV including three (3) references, which may be contacted if you are shortlisted. Receipt of all applications will be acknowledged, but only short-listed candidates will be contacted.  This position will have contact with children or vulnerable adults.  CIP is an equal opportunity employer. Qualified women are particularly encouraged to apply.  IWMI believes that diversity powers our innovation, contributes to our excellence, and is critical for our mission. We offer a multi-cultural, multi-color, multi-generational and multi-disciplinary working environment. We are consciously creating an inclusive organization that reflects our global character and our commitment to gender equity. We, therefore, encourage applicants from all cultures, races, ethnicities, religions, sexes, national or regional origins, ages, disability status, sexual orientations, and gender identities"
  },
  {
    "title": "Finance and Operations Associate",
    "company": "Aquaya",
    "location": "Accra",
    "description": "Based full-time, in-person in Accra, Ghana (to begin as soon as possible)  About Aquaya  The Aquaya Institute (Aquaya) is a nonprofit research and consulting organization dedicated to advancing global health through universal access to safe water, sanitation, and hygiene (WASH). We deliver critical insights, data, and tools to support informed policy, program, and financing decisions. This knowledge helps to secure safe water and sanitation for vulnerable populations, improving human health and well-being.  Aquayas portfolio spans public health, economics, technology development, and social entrepreneurship in over 20 countries in Africa, Asia, and Latin America. We have published or contributed to over 40 peer-reviewed research articles and produced numerous other reports and publications.  Aquaya maintains an office in Nairobi, Kenya, and Accra, Ghana. Staff members are also in the US, France, Uganda, Ghana, Ethiopia, and Morocco. Many of our projects are carried out in... collaboration with academic research groups and expert consultants.  About the position  We are recruiting a Finance and Operations Associate for a full-time position based in Accra, Ghana. The Finance and Operations Associate will report to Aquayas Finance Manager and will focus on supporting Aquayas operational needs in Ghana. The current Aquaya team includes over 40 employees across seven countries. Aquaya has seven full-time employees based in Accra and five full-time employees remote across Ghana (Kumasi, Sunyani, Tamale) as well as numerous contractors. The Finance and Operations Associate will support the finance and operations work in Ghana and beyond. In addition, they will be responsible for supporting with the following key activities:  Accounting: Manage all accounting activities for Aquayas Accra office, including  complete preparation and recording of all bills, payroll support, bank-related matters, contractor management, and audit support.  Office management: Maintain the office, including printing, document preparation, managing utilities, mail, and other related duties.  Immigration: Obtain travel visas and work permits for staff and consultants.  Legal: Liaise with legal counsel to ensure policies are compliant with Ghanaian law.  Business licenses: Maintain business licenses and relevant insurance policies for the Accra office.  Benefits: Support renewals and upkeep of benefits plans (social security/pension, health insurance, etc.).  Recruitment and onboarding: Support recruitment of staff to be based in Ghana and orientation for new hires in Ghana.  Program support: Provide logistical support to the programs team in Ghana as needed, such as organizing events, preparing materials, and procuring technical equipment.  Criteria for the position  The following qualifications are necessary for this position:  Bachelors degree in Accounting or Business administration.  At least four (4) years of experience in finance, operations, office management, and/or HR administration experience.  Excellent verbal, written, and interpersonal communication skills.  Outstanding computer skills and facility using Microsoft Office Suite, including Excel, and online platforms.  Fluency in English.  Willingness to work across numerous time zones, which may include early morning or late evening video calls.  We are also looking for the following skills and attributes:  CPA license.  Quickbooks or other accounting software experience.  Previous experience working with international teams and communicating with different stakeholders/vendors.  Excellent problem-solving and time-management skills.  Strong work ethic and a commitment to delivery.  Ambition to set and achieve high standards for quality of work.  Superb critical thinking to optimize operational activities.  Outstanding organization with an attention to detail and an ability to establish systems to manage constant flows of information and deliver on deadlines.  Proven ability to work closely with a growing team and to successfully manage multiple and changing priorities in a fast-paced, dynamic environment while maintaining a positive and productive attitude and a good sense of humor!  Compensation and Benefits  This is a full-time position with an initial 3-month probationary period. Aquaya offers competitive salaries that are commensurate with experience. Benefits include medical insurance and enrolment in a pension plan.  To apply  Please submit your resume via e-mail to jobs@aquaya.org and a thoughtful cover letter. Once your resume is received, there will be an additional screening survey and activity. This position will be open until filled.  Please explain why you are interested in Aquayas mission and activities in your cover letter. Please also tell us why your skills, background, and accomplishments make you the ideal candidate for this position, specifically highlighting your experience. Please note that we will only consider applications with a cover letter. In your e-mail subject line, please specify Finance and Operations Associate  Ghana 2023. No phone calls, please"
  },
  {
    "title": "Administrative Officer  Logistics at International Water...",
    "company": "IWMI",
    "location": "Ghana",
    "description": "The International Water Management Institute (IWMI), a CGIAR Research Center is looking for a competent, self-motivated, and dynamic candidate to join IWMIs office in Accra, Ghana as Administrative Officer  Logistics.  Under direct supervision of the Administrative Manager, to provide efficient and timely administrative services for the IWMI West Africa Office and its hosted partners.  Job Responsibilities   Oversee the transport unit including the supervision of staff attached to the transport unit.   Manage the transport requirements of the Institute including scheduling drivers based on transport requests.   Ensure the maintenance, servicing and repair of IWMI vehicles in a timely manner.   Prepare accurate monthly statements from vehicle log sheet and submit same to the accountant after approval.   Maintain the vehicle Maintenance File and vehicle Registration File in an orderly manner.   Supervise the fueling of IWMI vehicles in a timely manner.   Assist IWMI... International Staff to obtain Driving License.   Oversee the renewal of Road Worthy and Insurance Certificates for IWMI vehicles and vehicles of hosted organizations.   Obtain CD number plates for IWMI vehicles/vehicles of internationally recruited staff as well as hosted organizations and its international staff.   Organize travel arrangements including ticketing, insurance, accommodation.   Support the Administrative Manager to arrange temporary accommodation within and outside Accra for staff and associates local consultants engaged to work for the office.   Arrange transport (from Accra to the field and on site) for all field trips.   Purchase airline tickets for staff, consultants and interns undertaking field trips on behalf of the office.   Arrange hotel booking for staff, consultants, and interns undertaking field trips.as may be requested (i.e beyond field trips)   Make logistical arrangements visitors Visas and Residents Permits.   Process ID Cards (Ghana Foreign Ministry, Non-citizen cards, etc) for IWMI international staff/spouse and international staff/spouse of hosted Institutions.   Process and manage residence permit for IWMI international staff/spouse and children and international staff/spouse and children of hosted organizations.   Process visas for IWMI staff and staff of hosted organization undertaking international trips.   Process visas for all visitors to the IWMI Ghana office including IWMI staff from other regions visiting the office.   Implement the day-to-day delivery of procurement services (stationery and other office items, including support to the projects on their procurement needs) following IWMI procurement guidelines and procedures.   Is responsible for local procurement of goods, equipment and events in consultation with Head Office, according to procurement policy.   Prepares purchase requisition and purchase orders.   Processes customs clearance procedures (duty-free import of goods)   Processes and monitors the clearance of goods.   Support the Administrative Manager in handling IWMI shipment including shipment of personal effects for international staff and hosted organizations.  Job Qualification   A University Degree in Administration or Social Science or equivalent qualification/training and experience in Administration.   At least 5 years of relevant experience.   Well-developed knowledge of IWMI administrative and transport operating protocols and policies.   Experience in dealing with government institutions.   Conversant in MS Office software packages.   Experience in similar International Organization.   Good command of the English Language.   Demonstrate a whole-of-service approach and a focus on maintaining high quality services.   Good teamwork, interpersonal and communication skills.   Good personal organization and priority setting skills.   Well-developed administrative skills.   High level of integrity.   Ability to take initiative and capable of working independently.  Location: Accra  Application Procedures : How To Apply  Interested and qualified persons should visit the : Application Portal.  Then read through the job offer  Afterwards click on the apply button  Then fill the Recruitment form  Then click on the submit button to submit"
  },
  {
    "title": "Senior Research Program Manager",
    "company": "Aquaya",
    "location": "Accra",
    "description": "Preferably based in Ghana or Kenya (to begin as soon as possible, preferably no later than January 2024)  About Aquaya  The Aquaya Institute (Aquaya) is a nonprofit research and consulting organization dedicated to advancing global health through universal access to safe water, sanitation, and hygiene (WASH). We deliver critical insights, data, and tools to support informed policy, program, and financing decisions. This knowledge helps to secure safe water and sanitation for vulnerable populations, improving human health and well-being.  Aquayas portfolio spans public health, economics, technology development, and social entrepreneurship in over 20 countries in Africa, Asia, and Latin America. We have published or contributed to over 40 peer-reviewed research articles and produced numerous other reports and publications.  Aquaya maintains an office in Nairobi, Kenya, and Accra, Ghana. Staff members are also in the US, France, Uganda, Ghana, Ethiopia, and Morocco. Many of our projects... are carried out in collaboration with academic research groups and expert consultants.  About the position  We are recruiting multiple Senior Research/Program Managers (Senior Managers) to support ongoing research programs. These full-time positions are preferably based either in Ghana or Kenya and require extensive travel across Africa. The Senior Managers will be responsible for managing research program activities, including, but not limited to:  Program/project management  Coordinate activities across multiple team members and countries  Develop and monitor timelines for completing project milestones  Develop, modify, and successfully manage project budgets  Delegate tasks to and/or supervise other employees and contractors as needed  Oversee execution of contracts/MoUs with partners, sub-grantees, and contractors  Organize and tactfully lead partner meetings and manage partner communication  Lead fieldwork logistics and data collection activities with minimal oversight  Prepare summary presentations to report to funders  Research management  Develop research protocols and data collection tools  Manage the ethical approval process and ensure that ethical principles are respected  Lead training of data collection teams  Develop and administer effective QAQC methods to ensure data quality  Manage and analyze quantitative and qualitative datasets  Lead the preparation of project presentations, reports, briefs, and publications  Participate in the presentation of results at conferences and workshops  The Senior Manager is anticipated to support a variety of research projects, including but not limited to:  WaterTRACS  The Water Testing, Research, and Capacity Strengthening (WaterTRACS) program includes two primary interrelated components: (1) water quality data collection and analysis at the community, household, school and health care facility levels and (2) a fellowship program that provides resources and opportunities to cultivate a pipeline of skilled water professionals (additional details here). For five years (2021-2026), this initiative is committed to leading water quality monitoring and trend analysis at the community, household, and institutional levels in Ethiopia, Ghana, and Uganda. Collaborations with local universities, laboratories, and government stakeholders are central to this effort. The program generates statistically representative data on water quality to rigorously inform strategies to improve water safety.  Water Quality Assurance Fund  Aquaya launched the Water Quality Assurance Fund (Assurance Fund) in 2020, a mechanism that incentivizes professional, urban laboratories to provide testing services to dispersed, rural water systems. In the event that a water system is unable to pay testing fees within one month, the Assurance Fund pays the fees on its behalf. The Assurance Fund thus, assures the laboratory that it will not suffer losses due to the non-payments of testing fees. Additionally, to encourage improvements in water safety management, the Assurance Fund program provides capacity building and technical guidance to water operators as well as engagement activities with consumers. Aquaya is currently implementing the Assurance Fund in Ghana and Kenya, and evaluating its impacts on water safety management via randomized, controlled trials. We also have prospects to introduce the Assurance Fund in Uganda and Tanzania in 2024.  Criteria for the position  The following qualifications are necessary for this position:  Demonstrated experience in managing research programs related to water or sanitation.  Masters degree  preferably in engineering, science, environmental science, or a related field. Ph.D. is preferred.  6+ years of work experience in research and/or project management (or 2+ years in addition to a Ph.D.)  Experience in the management and execution of research staff, research processes, and knowledge-focused initiatives.  Previous international work experience in Africa.  Ability to analyze quantitative data in Excel, R, or Stata.  Excellent verbal, written, and interpersonal communication skills.  Fluency in English.  Ability to travel to field sites approximately 25% of the time (this is an estimated average and is subject to fluctuation).  We are also looking for the following skills and attributes:  Good problem-solving and time-management skills.  Strong work ethic and a commitment to delivery.  Outstanding organization with an attention to detail and an ability to deliver on deadlines.  Proven ability to work closely with a small team and to successfully manage multiple and changing priorities in a fast-paced, dynamic environment while maintaining a positive and productive attitude and a good sense of humor!  Compensation and Benefits  This is a full-time position with an initial 3-month probationary period. Aquaya offers competitive salaries that are commensurate with experience. Benefits include medical insurance and enrolment in a pension plan.  To apply  Please submit your resume via e-mail to jobs@aquaya.org and a thoughtful cover letter. Once your resume is received, there will be an additional screening survey and activity. This position will be open until filled.  Please explain why you are interested in Aquayas mission and activities in your cover letter. Please also tell us why your skills, background, and accomplishments make you the ideal candidate for this position, specifically highlighting your experience. Please note that we will only consider applications with a cover letter. In your e-mail subject line, please specify Senior Manager 2023. No phone calls, please.  Aquaya provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.  This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training"
  },
  {
    "title": "Project Officer-Municipal Finance At WSUP Ghana",
    "company": "WSUP",
    "location": "Accra",
    "description": "WSUP is a non-profit partnership between the private sector, NGOs and research institutions focused on solving the global problem of inadequate water and sanitation in low-income urban communities.  WSUP brings lasting solutions to low-income areas by working in partnership with service providers including water utilities, local authorities and businesses, and the communities they serve.  WSUP strengthens the capacity of service providers to deliver sustainable city-wide water and sanitation services, promote good hygiene and raise the environmental standards of low income communities.  WSUP achieves this through supporting the adoption and replication of effective, sustainable and scalable models and institutional capacity development for pro-poor urban water and sanitation services by service providers and/or national governments. Additionally, WSUP empowers service providers to mobilise investment finance for pro-poor service scale-up and promotes successful approaches globally... WSUP has a Country Programme office in Accra with key focus on project sites in Kumasi and Accra.  Project Summary  WSUP is leading a partnership with Unilever Netherlands, HFC Boafo Microfinance Services Ltd and Ga West Municipal Assembly to roll out the PASS project under the Ghana WASH Window of the Ghana Netherlands Water, Sanitation and Hygiene Programme.  The overall objective of PASS is to demonstrate a scalable approach to sustainably improving sanitation, faecal sludge and hygiene services to low income urban inhabitants of Ghana through strengthening the links between the public and private sectors, and their capacity and financing models by March 2018.  This involves improvement in revenue collection by the GWMA.  Job Purpose  The purpose of the post of the Project Officer is to support the Project Manager in the implementation of the Partnership for Advancing Sustainable Sanitation (PASS) under the Ghana WASH Window of the Ghana Netherlands Water, Sanitation and Hygiene Programme in Ga West, and to provide project management support to Ga West Municipal Assembly (GWMA) in its implementation of the project.  The position will be partially based at GWMA.  The post holder will be directly responsible for planning and implementing improved revenue collection at GWMA and the establishment of a call centre for vacuum tanker services.  The improved revenue collection component seeks to strengthen the GWMAs capacity to develop systems and mechanisms that will improve its revenue collection efficiency, principally through property rates and business operating licenses, with a commitment to investing a majority of the additional revenue in the improvement of sanitation services to its residents.  Inherent in this component is the need to improve the level of citizens engagement towards improved accountability, transparency, and the ability to demand for improved services. The call centre will be established to provide improved vacuum tanker services to the citys residents by improving the link between private sector service providers and customers. Main  Responsibilities  Support the Project Manager in providing project management and monitoring support to the Ga West Municipal Assemblys (GWMA) Project Delivery & Monitoring Team (PDMT)  Be responsible for coordinating between project partners as and when necessary.  Act as liaison between WSUP (Project Lead) and GWMA as well as Local and Community based interest groups.  In close cooperation with GWMA, lead the planning and development of improvements to the existing municipal revenue collection system.  In close cooperation with GWMA, work to enhance the accountability and transparency of revenue collection and overall expenditure, and its use through existing mechanisms and channels of citizens engagement and complaint/feedback.  Lead the planning and implementation of a call centre for improved vacuum tanker services.  Lead planning and implementation of monitoring, documentation and sharing of learning with Project partners and stakeholders.  Ensure compliance of all legal, health, safety and environmental requirements of the projects activities in accordance to all internal, national and international standards.  Planning, attending and coordinating meetings and events for the Project.  Ensure donor and WSUPs visibility in project locations.  Undertake any other project-related tasks that shall be assigned by Programme Manager.  Qualification Required & Experience  Hold a first degree in public administration, finance, economics, business or another related fields;  4 years of experience in a relevant field;  2 years of proven experience working on municipal revenue collection, with a track record of success in achieving results;  Excellent computer skills, with an understanding of revenue collection software, accounting software and MS Project;  Some experience working with private sector actors is desirable;  Knowledge and experience of call centres and how they operate is desirable  Excellent knowledge of the decentralization and local governance system in Ghana.  Leadership and inter-personal skills and necessary;  Should be a team player, driven by own initiative, good communicator and have the ability to work under minimum supervision  Ability to work effectively within a small, multi-disciplinary programme team and to liaise with institutional partners, consultants, contractors, community representatives and local politicians.  Motivated by the mission of WSUP.  Good written and spoken English is essential.  Ability to speak Ga and Twi would be desirable.  Location: Accra  How To Apply For The Job  This is a challenging opportunity for a dedicated, ambitious and highly motivated professional available almost immediately. If you meet the above requirements, please send a completed WSUP application form  (  wsupghana@wsup.com  Closing Date: 09 May, 2014  We regret that only short-listed candidates will be contacted.  WSUP is an equal opportunities employer"
  },
  {
    "title": "Lead- Business Development At WaterHealth Ghana (WHG)",
    "company": "WaterHealth International",
    "location": "Ghana",
    "description": "WaterHealth Ghana (WHG) is a wholly owned subsidiary of Water Health International, a Company that aims at providing scalable, safe drinking water solutions to underserved areas through advanced technology and innovative business models. Headquartered in Irvine, USA, WaterHealth International (holding Company of WHG) runs operations worldwide including Ghana, Liberia, Nigeria Bangladesh and India. WHG came into the existence in 2008 with a vision to provide safe, scalable and affordable drinking water to the underserved communities across Ghana. WHI runs similar operations in India, Nigeria, Liberia and Bangladesh.  Position Title: Lead- Business Development  Level: L7/L6  Reports to: Head - Capital Business Unit  Function: Capital Sales  Location: Accra  Function Description  The Incumbent is responsible for planning and executing the Capital Sales budget through the sales team of WHG  Contacts of the function  External To WHG  Customers (Institutional, State, Sponsors and... Philanthropists)  Roles and Responsibility  # Tasks  Identify the potential customers for capital sales across the private and public sectors.  Segment the market into logical groups and estimate size of each.  Determine the product specifications by customer segment / group  Execute plan to achieve the sales budget.  Obtain AMC (annual maintenance contract) from capital sales customers  Maintain relationship with key accounts  Qualification Required & Experience  Education: Graduate (any stream) / Post Graduate (preferably MBA)  Functional Experience: Must have handled a retail sales role in B2B and Corporate /Government sales  Superspeciality : Account Management / Relationship Building  Other: NA  Years of Experience: The incumbent should have over 8-10 years in B2B and Corporate/Government sales  Location: Accra  How To Apply For The Job  All interested qualified persons should submit their application letter and CV to:  HRGhana@waterhealth.com  Closing Date: 05 April, 2015"
  },
  {
    "title": "China International Water & Electric Corp Vacancies For Quarry Manager",
    "company": "China International Water & Electric Corp",
    "location": "Accra",
    "description": "China International Water & Electric Corp Vacancies for Quarry Manager. Submit your job application now"
  },
  {
    "title": "Pure Water Packers At C.P.W Ltd",
    "company": "CPW",
    "location": "Accra",
    "description": "A purified water company located in Gbawe around Zero House is urgently looking for the following:- Pure Water Packers  Qualification Required & Experience  Above 5 years working experience with a purified water company  Location: Accra  How To Apply For The Job  Write to:-  The C.E.O  C.P.W. Ltd  P.O.Box 140  Mallam - Accra  Closing Date: 19 February, 2013"
  },
  {
    "title": "Project Coordinator  Rural Water Services At Access Development...",
    "company": "Access Development",
    "location": "Ghana",
    "description": "Access Development Ghana is a manufacturer of manual well drilling equipment and handpumps it is expanding operations into rural water service delivery with the goal of becoming one of Ghanas leading rural water delivery companies. Access Development is currently recruiting for a new 4-year project that will develop water delivery service for more than 100 communities in a district in Western Ghana. The goal is to provide communities with a safe reliable water supply.  Job Summary  The Project Coordinator is responsible for leading and managing a team to deliver high quality reliable water supply for our rural clients. The project coordinator will oversee the activities of quality control staff and contractors and liaise with District and Community leadership. The 4-year project will establish a sustainable water service delivery structure for rural communities.  Qualification Required & Experience  The successful candidate will have 8 years of experience working in the rural water... supply sector, exceptional communication and problem solving skills and be fully committed to ensuring the success of this project.  Required  Candidates for this position must have at least Bachelors Degree in a relevant discipline.  Excellent communication skills (both verbal and written) in English.  At least 8 years of practical experience working in rural Ghana with positions of increasing reporting and responsibility.  Ability to prepare activity reports and maintain records for project implementation.  Excellent analytical and organizational skills. Ability to think critically and creatively.  Excellent interpersonal skills, including patience, diplomacy, willingness to listen and respect for colleagues. Must be capable of working both individually and as part of a team.  Experience managing private contractors.  Ability to work effectively in a fast-paced, stressful environment. Must be flexible, willing to perform other duties and work irregular hours.  Willingness to live and work in rural Ghana.  DESIRED  Excellent computer skills and experience in data collection and analysis a plus.  Experience managing contractors  Location: Savelugu, Tamale  How To Apply For The Job  Send CV and Cover letter with Subject: Project Coordinator Rural Water Services to:-  Jobs.Ghana@accessdevelopment.co  Closing Date: 31 July, 2015  Only Qualified Applicants will be contacted"
  }
]