[
  {
    "title": "WATSAN Officer",
    "company": "IRC - The International Rescue Committee",
    "location": "Lodwar",
    "description": "**Job Description**  The role of WATSAN Officer is to ensure successful implementation and supervision of community-based water supply and sanitation interventions in the target areas. Additionally, this position will support development of staff and community capacity building in water supply and sanitation operation, maintenance, and management, participate in mobilization of WASH resources and ensure implementation is done in close collaboration with program staff, the local community, the Local authority and other relevant agencies. The role will also involve to a large-scale technical designs of various WASH infrastructures, estimation of costs, support development of tender documents, bid review and evaluations, and general construction contract management and discharge in accordance with IRC and GoK acceptable standards and specifications. During implementation of the projects activities, the Officer will be required to provide feedback to relevant project partners and the... Local authorities with an aim of improving overall WASH program quality.  *Main Responsibilities**  The WATSAN Officer will identify and assess the key needs of WASH facilities and services to be addressed and whom to engage and develop an appropriate implementation strategy to either construct, rehabilitate or repair such facilities. She/he will ensure that an engagement approach to working with communities and the local authorities, other partners is employed, and all activities are carried out in a way that is sensitive to community needs and promotes the full and equal participation of women, men, children, and youth. Primary responsibilities include:  *Project planning and design**  \\- Spearhead rapid/field needs assessment including Baseline surveys in WASH activities and determining most technically appropriate water supply and sanitation options. \\- Design and develop relevant specifications for WASH infrastructure including design reports, drawings, bills of quantities, technical specifications. \\- Lead in the proposal development for potential water supply, sanitation, and hygiene interventions \\- Support in undertaking Topographical Surveys and GIS activities, feasibility studies, water resource mapping, EIA support.  *Project implementation**  \\- Preparation of tender documents including technical specifications, bill of quantities, drawings, and terms of reference. \\- Supervise construction, repair and rehabilitation of water supplies systems and sanitation facilities in strict adherence to the Kenya government regulations, WHO and the SPHERE standard \\- In collaboration with the WASH officer  hygiene, support implementation of hygiene promotion activities ensuring that technical and social aspects of water supply and sanitation are integrated. \\- Working with the WASH Officer  Hygiene Promotion facilitate training WMCs, other Community structures (SMCs, CHWs, CHEWs, Youth Groups) and local authorities on operation/maintenance, management, and sustainability of WASH infrastructure. \\- Build the capacity of staff, CBOs, and Water Users Committees to effectively manage WASH facilities.  *Project monitoring and evaluation**  \\- Supervise WASH activities in strict adherence to IRC Kenya, Kenya government regulations, the donors guideline, and the SPHERE standards. \\- Ensure timely delivery of projects activities and successful completion of construction works with submission of completion certificates to the Contractors. \\- Ensure that up to date project documents are in place including approved work plans, log frame, detailed project implementation plan and financial forecasts Documentation of lessons learnt and good practices. \\- Supervision of the construction processes of different water infrastructures to their completion including test pumping, interpretation of the test pumping data and water testing. \\- Support in the development and implementation of water safety and disaster risk management plans for the water supply projects.  *Fundraising and networking**  \\- Support in the development of technically sound proposals.  *Reporting**  \\- Develop and deliver in a timely manner progress reports, monthly, quarterly, semi- annual and end of projects reports in accordance with donors and IRC Kenya requirements. \\- Support development, monitoring and evaluation WASH project indicators and standards \\- Provide regular update reports on water supply and sanitation activities and program progress against work plan as maybe required. \\- Maintain an up to-date activity tracking tool (soft copies and hard copies) of all water supply and sanitation infrastructure related activities. \\- Actively participate in inter-sectoral activities. \\- Support WASH department in other tasks, roles and, responsibilities as may be assigned to by the supervisor.  *Qualifications**  \\- Degree in Water Engineering, Civil and structural Engineering, or related field. A minimum of Three years experience working/programming in WASH, emergencies, relief, or development including implementing a large-scale community-based water and sanitation project with evidence of successful implementation of similar projects.  *Required Experience & Competencies:**  \\- Minimum of 3 years relevant work experience in ASAL \\- Strong skills in construction and supervision of water supply and sanitation facilities essential \\- Demonstrated skills in technical design and costing of civil engineering works related to community-based water supply and sanitation facilities. \\- Experience in community engagement approaches, participatory approaches, and community negotiation \\- Excellent verbal and written communication skills \\- Strong interpersonal skills and ability to establish and maintain effective working relations with a team. \\- Ability to conduct community WASH needs assessment, program planning, implementation, monitoring, and evaluation of WASH activities. \\- Good understanding of SPHERE and other humanitarian standards \\- Good computer application skills (MS-Office, CAD, application software to engineering designs) \\- Experience working in multi-cultural (particularly pastoralists in Northern Kenya), multi-disciplinary staff will be an advantage.  **Standards of Professional Conduct:*** *The IRC and IRC workers must adhere to the values and principles outlined in the IRC Way  Code of Conduct. These are Integrity, Service, Accountability and Equality. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Harassment-Free Workplace, Fiscal Integrity, Anti-Retaliation, Combating Trafficking in Persons, and several others.*  **Gender Equality:*** *IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce including parental leave, gender-sensitive security protocols and other supportive benefits and allowance.*  **Kenyan nationals are encouraged to apply. International allowances are not available for this position. Salary and employee benefits are compliant to the Kenyan NGO Sector.***  **IRC is an Equal Opportunity Employer and considers all applicants based on merit without regard to race, sex, color, national origin, religion, sexual orientation, age, marital status, veteran status or disability.***  **Disclaimer:***  **Please take note that the International Rescue Committee (IRC) does not ask for any fees in connection with its recruitment processes"
  },
  {
    "title": "Monitoring & Evaluation Officer, Kenya",
    "company": "Water & Sanitation for the Urban Poor WSUP",
    "location": "Nairobi",
    "description": "Overall purpose  WSUPs Monitoring & Evaluation system aims to collect and analyse data on the outputs, outcomes and impacts of WSUP activities, with the following objectives:  To support short-term operational and longer-term strategic decision-making by the different levels of WSUPs management structure.  To provide information to WSUPs funders about the performance of specific projects and the overall programme.  Responsible for tracking progress in access to urban water, sanitation and hygiene services in our focus countries, in ways that align with the information needs of our incountry partners, and that support and link to existing in-country tracking processes.  To provide a basis for wider reporting to the WASH sector and the general public about WSUPs performance, most notably via our website.  To provide overall data management and ensure integrity of all data relating to WSUP project implementation, monitoring and reporting.  To support critical learning and... ongoing evaluation of WSUP projects, helping to ensure evidence-based programming.  To inform wider learning about best-fit practice in urban WASH.  The Monitoring & Evaluation M&E Officer will coordinate WSUP Kenyas monitoring & evaluation processes and data management to create an accurate picture of WSUP Kenyas outcomes and impact. You will ensure that data is collected and made available in a timely and accurate manner, as required by the Secretariat M&E function and other key internal stakeholders including the Country Manager and Global Programmes Team.  Main responsibilities & tasks  Development & coordination of WSUPs M&E and reporting in Kenya  Develop, deploy, and manage M&E systems for the WSUP Kenya programme, in consultation with Project Managers.  Work closely with WSUP Kenya staff, partner organisations, local stakeholders andthe Monitoring, Evaluation, Research & Learning MERL Manager in WSUPSecretariat, to ensure timely and accurate execution of all M&E requirements. This includes completion of quarterly reporting from WSUP Kenya to WSUP Secretariat, tracking of indirect beneficiaries and finance mobilised, completion of funder reports, and other non-quarterly requirements which may form part of WSUPs standard M&E processes.  Assess the impact of WSUP Kenyas work on vulnerable groups and communities.  Help to ensure safeguarding considerations are taken into account in project design, data collection and reporting.  Coordinate the collection of quantitative and qualitative information and data for funder reports and funding opportunities, in collaboration with colleagues in Kenya and the WSUP secretariat.  Coordinate and consult with the WSUP Kenya programme colleagues to collect data to track performance against business plan indicators and demonstrate the Kenya country programmes contributions to the global business plan.  Support the conduct of high-quality evaluations of WSUPs project work in Kenya, liaising closely with external evaluators, Kenya colleagues and the WSUP Secretariat as required.  Data collection and quality control  Support the WSUP Kenya programme and relevant colleagues to prepare and deploy quantitative and qualitative tools for data collection.  Adopt the use of mWater and similar survey tools to ensure the reliability and integrity of the data collected.  Conduct frequent field visits to observe the data collection and curation process and extend support to colleagues and partners to ensure data accuracy and reliability.  Ensure that secondary data sources used for internal reporting and external publications are reliable and well-referenced.  Work closely with MERL Manager in Secretariat to avoid the double counting of beneficiaries and determine the differences between direct and indirect beneficiaries following organizational standards.  Process monitoring and data analysis.  Undertake M&E data computation and analysis to support programme requirements and needs.  Support the development of frameworks, plans, log frames and other M&E documents supporting the project management cycle.  Assist in monitoring programme activities, and to assess whether outputs and outcomes are meeting targets. This will require assessment of progress against deliverables specified in contracts and log frames.  Use data sources quantitative and qualitative to assess project progress and support optimization of programme delivery, in conjunction with Programme Coordinator.  Coordinate procurement of external contractors or directly collect data.  Assist with procurement processes relating to M&E activities, including contracting of survey/evaluation services and ensuring contractual compliance as required, in line with WSUPs Procurement Procedures. This will involve development or review of relevant documents Terms of References, Profiles, Request for Proposals, bidding & Tender documents, Evaluation criteria, questionnaires etc.  Oversee contractual compliance for the execution of specific M&E tasks or, as determined by the Line Manager and/or the M&E Manager in London, taking direct responsibility for data collection by designing, organising, moderating and documenting focus group discussions, or by carrying out small-scale household or infrastructure surveys.  Knowledge and capacity building  Act as M&E knowledge person in the WSUP Kenya team, available to respond to colleagues queries about M&E processes and requirements, including quarterly reporting requirements and the Qlik Sense data visualisation platform.  Champion new M&E developments to the country teams to encourage uptake and usage of new resources/tools. Take a proactive role in maintaining contact and communications with other WSUP programme teams to foster cross learning between country teams.  Conduct focused training on systems developed for the programme and workshop participants as and when necessary to ensure that WSUP staff and partners can contribute to the M&E system.  Communications lead  Act as the in-country focal point for the Communications team in the Secretariat, using your overview of programme activity to identify communication opportunities, share and plan these with the Communications team, and collect content for them to develop and disseminate.  Lead on communications within Kenya, identifying and developing opportunities to build WSUPs profile within the WASH sector, with urban stakeholders and with funders and potential funders.  Act as a brand guardian, liaising with Kenya colleagues and with the Communications and MERL teams in WSUP Secretariat to ensure that all outputs produced by the Kenya team are consistent with WSUPs communications policies and quality assurance procedures.  Provide data inputs to WSUP technical publications and research projects as required.  Participate in local and international sector conferences and workshops and compile reports on them as required.  Other tasks  Comply with all personal data protection needs when undertaking baseline surveys and end line evaluations including photography and video for any programme production and documentation.  Adhere strictly to WSUPs ethics policy and pro-actively encourage transparency and openness in all activities.  Undertake any other duties as commensurate with the role and agreed with the with line manager.  Person specification  Evidence that applicants meet the essential criteria will be assessed by the following methods: Application A Test T, Interview I, as indicated below.  Essential  Qualification and experience  Bachelor degree in Statistics, Social Sciences, Economics or other relevant field A  Experience of working within a project providing deliverables, budgets, timelines and reporting requirements A,I  Experience of working within a multi-disciplinary project team and to liaise with stakeholders A,I  Knowledge  Knowledge of participatory methods, quantitative and qualitative techniques for various assessments and analysis I  Understanding of how to assess M&E tools as suitable for use with vulnerable populations I  Skills and abilities  Strong capacity to manage large quantitative datasets with high levels of accuracy and attention to detail T  Good written and spoken English, ability to present arguments in a clear and concise manner I  Strong Excel skills Pivot tables and basic functions including IF, VLOOKUP, SUMIFS T  Other  Commitment to the mission, vision and values of WSUP.  Desirable  Qualification Masters degree in Statistics, Social Sciences or a related field A  Experience  Significant experience on WASH in low-income communities A,I  Experience in the urban WASH sector A,I  Experience in equivalent M&E roles  Skills and abilities  Experience using Mwater  Knowledge  Knowledge of specific M&E challenges in the urban WASH sector, including an understanding of the JMP service ladder I  Knowledge of urban planning and urban governance I"
  },
  {
    "title": "Managing Director  Position 1 at Amatsi Water Services Company",
    "company": "Amatsi Water Services Company",
    "location": "Nairobi",
    "description": "Amatsi Water Services Co.LTD.(AWASCO) is a Water Service Provider Company, operating in Vihiga County in line with Water Act 2016 and was incorporated on the 24th April 2007 under the Companies Act Cap 486 Laws of Kenya.  Key Duties & Responsibilities  Providing leadership in the development and implementation of the companys strategic plans to enhance profitability and shareholder value. Ensuring the business promotion is carried out as per developed and formulated plans so as to attain planned rate of return of assets Ensuring effective mobilization and utilization of resources Cultivating and encouraging a productivity culture of results in the company Establishing, directing and managing the companys managerial, financial and operational systems, procedures and controls to ensure that they are professional, workable and sustainable. Providing strategic direction on new investments, business opportunities and change initiatives. Nurturing the organizations human resource and... ensuring that appropriate management structures and policies are developed and implemented. Promoting sound corporate governance and ethical standards. Providing organizations strategic leadership by directing establishment of short term and long term organizational goals within the broad policy directive of the board and the formulation of appropriate policies and programs to ensure their attainment. Ensure formulation and implementation of the companys plans and strategies to ensure profitable operation. Advising the Board on the overall performance in regards to objectives, targets and policies as they affect operations of the company Formulating and periodically updating the corporate plan including projections of any necessary expansion and development of water services facilities and extensions for the business operations Coordination and directing the companys operations and overall administration to ensure that the various departments and sections confirm with overall operational plans and performance targets. Assess community needs, ensure development and maintenance of good relations with the community and customers. Advising the Board on overall performance in regards to objectives, targets and policies as they affect operations of the company. Coordinate and prepare business related proposals, reports and other submissions for consideration by the Board. Oversee the implementation of the corporate budget. Develop company budgets and work plans Make regular reports to the Board of Directors on actual performance of the company compared with approved targets and budgets, and formulate recommendations for discrepancies to be corrected. Develop and recommend to the Board of Directors long-term strategies business plans and annual operating budgets; and establishes proper internal monitoring and control systems and procedures. Represent the Company at National, International, Government and Community levels in matters of mutual concern, coordinate activities to ensure the companys best interest is being served and engages external partners for purposes of strategic partnership. Ensure performance measures are designed to evaluate performance against the strategic plan. Participate in the deliberations of the committees of the Board Represent the company at outside forums whenever and wherever required. Responsible for physical assets assigned by the company Plans the work of subordinates, assigns work to subordinates, and monitors subordinates work performance. Appraises/evaluates subordinates performances  Qualifications  The applicant should be in possession of the following qualifications:-  Bachelors Degree in Civil Engineering, Water/Waste Water Engineering, Environmental Science, or its equivalent from a reputable Institution. Registered with the relevant professional body and member in good standing At least (6) years experience three of which shall be at senior management level in a reputable organization. Experience of implementing ERP systems and conversant with Water Billing Systems; computer literacy will be an added advantage. Leadership/ strategic management course lasting at least four weeks from a recognized institution Proven customer management and people management / leadership skills and experience. Meet the requirements of Chapter Six of the Constitution on Leadership and Integrity. Knowledge of relevant legislations and polices such as those of the Water Services providers, Water Services Regulatory Boards and Water Resources Management Authority"
  },
  {
    "title": "Rural Water Services Specialist",
    "company": "Catholic Relief Service (CRS)",
    "location": "Nairobi",
    "description": "JOB DETAILS: About CRS Catholic Relief Services is the official international humanitarian agency of the Catholic community in the United States. CRS works to save, protect, and transform lives in need in more than 100 countries, without regard to race, religion or nationality. CRS relief and development work is accomplished through programs of emergency response, WASH, HIV, health, agriculture, education, microfinance and peacebuilding. Western Water Program Western Water program seek to strengthen the water sector in Western Kenya by addressing underlying constraints in the system through data and technology, process innovation, coordination between sector stakeholders, and behaviour change. The project goal is to ensure efficiency of water service delivery, better use of water resources, strengthened sector governance, and increased investment by the private sector. The project targets the rural and urban water services, and water resources management in 8 counties: Kisumu... Kakamega, Busia, Bungoma, Kisii, Migori, Homabay and Siaya. On the Western Water program, CRS is part of a consortium led by Kenya Markets Trust. Job Summary: The Rural Water Services Specialist will be responsible for coordinating rural water services related activities at the County level geared towards supporting improved services delivery for the targeted rural schemes in the project area. The incumbent will collaboratively work with the county government and other stakeholders to facilitate professionalization and regulation of rural water services through implementation of context-fit Service Delivery Models. Roles and Key Responsibilities:  Responsible for the day-to-day execution of rural water services component for the assigned counties aiming at supporting professionalization and regulation of rural water service  Support identification of strategic rural water facilities for infrastructural improvement.  Organize and lead the implementation of project activities at the county level as outlined in the detailed implementation plan in line with CRS program quality principles and standards, donor requirements, and good practices.  Ensure learning properly accompanies project activities throughout the project cycle. Support accountability through coordinating project evaluation activities and guiding implementing partners in their efforts to reflect on project experiences. Analyze implementation challenges and report any inconsistencies and/or gaps to inform adjustments to plans and implementation schedules.  Participate in WASH networks, meetings, and select technical working groups as appropriate to represent the project to ensure collaboration and project visibility.  Knowledge, Skills and Abilities  Very good strategic, analytical, systems thinking, and problem-solving skills, with capacity to see the big picture and ability to make sound judgment and decisions.  Very good relations management abilities. Ability to relate to people at all levels internally and externally. Strategic in how you approach each relationship.  Team leadership abilities with diverse/multi-disciplinary teams.  Proactive, resourceful, solutions-oriented, and results-oriented.  Supervisory Responsibilities: None Key Working Relationships: Internal: Rural Water Services Manager, Chief of Party, Deputy chief of party Donor, Western water program consortium members, Country Representative, Head of Programming, Programming staff, Finance Manager, Deputy Regional Director for Program Quality, Regional Technical Advisors, HQ based Public Donor Liaison.  External Government agencies, partner INGOs and local NGOs, peer agencies, community representatives, private sector actors, including financial institutions.  Basic Qualifications  Graduate/Masters degree in a relevant discipline; Environmental science, or water engineering required.  Relevant professional qualifications an added advantage.  Minimum 5 years of relevant professional experience in water services delivery in Kenya and understanding water sector policy environment.  Experience working in USAID funded projects is an added advantage.  Experience engaging partners and strengthening partnerships.  Further Qualifications:  Good knowledge of gender responsive and/or transformative WASH system strengthening and governance principles, methods, and monitoring tools.  Knowledge/experience in market-based approaches to develop WASH services.  Experience working in the Kenya context, preferably in Western Kenya.  Agency-wide Competencies (for all CRS Staff) These are rooted in the mission, values, and guiding principles of CRS and used by each staff member to fulfill his or her responsibilities and achieve the desired results.  Integrity  Continuous Improvement & Innovation  Builds Relationships  Develops Talent  Strategic Mindset  Accountability & Stewardship  Disclaimer: This job description is not an exhaustive list of the skill, effort, duties, and responsibilities associated with the position.  What we offer: CRS offers a comprehensive benefits package and the opportunity to work in a collaborative, mission-driven culture that is committed to improving the lives of the poor throughout the world. CRS emphasis on family values supports benefits, including maternity and paternity leave, policies that promote exclusive breastfeeding, the availability of a baby room at the office, and flexible working hours where possible.  Work Hours: 8  Experience in Months: 60  Level of Education: Bachelor Degree"
  },
  {
    "title": "New JOBS Kenya",
    "company": "New JOBS Kenya",
    "location": "Nairobi",
    "description": "Director, Water and Sanitation Duties and Responsibilities Reporting to the Chief Officer,"
  },
  {
    "title": "Water Engineering Technologist",
    "company": "Nyahururu Water and Sanitation Company Limited",
    "location": "Nairobi",
    "description": "JOB DETAILS: NWSCO/WT/2/2023 Job Specifications  Diploma Water Engineering Technology or Civil Engineering or any other related Engineering Diploma from a recognized institution  At least two (2) years work experience.  KCSE certificate  Proficiency in Computer aided design; AUTOCAD, CIVIL 3D will be an added advantage.  Proficiency in computer skills (MS office)Personal attributes, must be a person with:  Good communication skills  Self - driven  Integrity  Teamwork  Duties and responsibilities  Ensure efficient and effective water supply and monitor routine water supply and maintenance of the systems to ensure minimal or no water interruption within water supply time.  Maintenance of Water Pipelines and Applied Appliances.  In consultation with plumbers, prioritize the work for the day to ensure minimum water interruption and distribution within the supply hours.  Project planning for construction activities and water pipeline installation in the respective areas. ... Schedule and prepare work plans for field activities in consultation with respective teams  Supervise the construction and rehabilitation of water supplies interventions in strict adherence to the Kenya government regulations.  Undertake basic supervision, operates, maintains, and performs preventative maintenance on Water Supply pumps.  Performing preventative maintenance on electric motors and diesel engines, pumps, compressors, valves, chemical feed equipment, pressure vessels, and related equipment.  Performing water quality sampling; facility and equipment tests, including well and pump efficiency tests.  Inspect, operate, test, and maintain a variety of pumping equipment, water storage facilities, and water distribution facilities, including pumps, control valves, meters, pipe systems, water storage tanks, chemicals and equipment associated with water treatment, and pressure vessels.  Collect water samples and perform duties associated with systems water quality standards  Clean and flush the water system; respond to customer water quality inquiries.  Work Hours: 8  Experience in Months: 24  Level of Education: Postgraduate Degree"
  },
  {
    "title": "Waste Water Engineering",
    "company": "County Government of Mombasa",
    "location": "Mombasa",
    "description": "ABOUT THE COMPANY  Mombasa has a long history the traces can be found from the writings of the 16th century. Many traders did attempt to enforce their governance on the town due to its advantageously central location, where Arab influence is felt prominently till date.  JOB SUMMARY  Requirements for appointment :i. Be a Kenyan Citizenii. Bachelor of Science Degree in Civil Engineering/Sanitation/Wastewater/EnvironmentalManagement or related disciplines from a recognized institutioniii. A certificate in sewerage Engineering or management from a recognized institution.iv. Registered Engineer with IEK/EBK or equivalent professional body; in good standingv. At least five (5) years similar experience two (2) of which must be at supervisory levelin a busy and dynamic work environment  RESPONSIBILITIES  REQUIRED SKILLS  Computer aided design (CAD), Quality control and supervision, Engineering  REQUIRED EDUCATION  Bachelor's degree"
  },
  {
    "title": "Regional Program Director, Water Sanitation and Hygiene (WASH) at...",
    "company": "World Vision Kenya",
    "location": "Nairobi",
    "description": "World Vision is an international Christian relief, development and advocacy organisation working in almost 100 countries world-wide to create lasting change in the lives of children, families and communities to overcome poverty and injustice. Summary  The position will provide leadership in WASH programming across the region to contribute to child wellbeing. It will define the technical guidance, standards for technical approaches and programs to enhance ministry performance aligned to our Promise, WASH Core project model, Global WASH business plan, SDGs and to WASH global industry practice. The position will also to work with other regional functional directors, Global Center , Support Offices and National Offices and resource development teams to mobilize adequate resources to effectively scale up WASH programs in the region.  The role is responsible for External engagement and strategic partnerships for advocacy, policy influence and resource development in the WASH sector. The... position will also provide leadership in technical oversight, planning, risk management, mainstreaming and scaling up of evidence-based practices throughout the East Africa region. In addition, it will provide thought leadership, evidence and learning on WASH within a multi sector collaborative approach to enhance child wellbeing. The role will collaborate with WVUS program managers and other WASH officers from support offices. The role will have a matrix reporting to the Senior Director of Global WASH operations. Major Responsibilities Strategic Leadership 15%:  Ensure WASH programming is in alignment with Our WASH Core Project Model, Global WASH Business Plan and global sector standards (SDGs etc). Ensure National Office (NO) technical approaches focus on child well-being. Coordinate implementation of the technical guidance, WASH business plan and conduct regular performance review of the targets set as part of the Global Business paln and WASH sector score card. Coordinate the measurement of impact of interventions of WASH on Child Well-Being Outcomes(CWBO) and targets Engage and support in regional priority implementation and measurement processes Engage and support SOs in regional investment allocation decisions for WASH Ensure that support to National Offices is included in the Organizational Capacity building Plans (OCP).  Technical Oversight and Support 25%:  Provide technical oversight and support to major WASH initiatives in the region. Provide leadership in mainstreaming, integration and scaling up evidenced based best practices in WASH Provide technical support in the development, adaptation and scaling up of project models and approaches that contribute to specific child well-being outcomes Work in collaboration with F&D to roll out the WASH and F&D guidelines. Supporting NO programming, quality assurance of WASH projects/programmes management, review expenditure reports for NO WASH grant & sponsorship projects to advice accordingly. Monitor WASH programs in the region by providing direction, input and feedback to ensure effective and efficient program delivery Monitor and support Risk management and mitigation for WASH projects in collaboration with the Regional Risk management officer. Coordinate well-planned integrated approaches to building skills and expertise in NOs  Resource Development  Prepositioning work:  Explore potential funding sources for WASH programming to support Regional Offices, National Offices and work with appropriate staff on these opportunities. Work with NOs and SOs to develop a sustainable pipeline of WASH grants, Work with Regional Resource Development & National Offices to maintain strong WASH donor relationships at regional level, developing WASH engagement strategies for each donor or a group of donors Provide technical support to Regional Resource Development Unit and in NOs during prepositioning meetings with bilateral, multilaterals, foundations and Public Private Partners Monitor the WASH donor competitive landscape; provide support and guidance to NOs in development of WASH capacity statements aligned to Technical Approaches (TAs) and Technical Programmes (TPs) to be utilized during prepositioning meetings with donors. Collaborate with the EAR Resource Development Unit (RDU), NOs and SO to support resource development for WASH programming  Grant Acquisition:  Provide technical assistance for WASH project design work in the region, working to ensure that National Offices have adequate public and private funding to scale up high quality programming. Work with Support Office and NO WASH teams, and other regional ministry and functions to ensure that large-scale grants and other specially funded initiatives are implemented in alignment with WV models, and that they achieve best practice standards of programming as well as financial accountability Provide support in the development of multi country WASH proposals  External Engagement 15%:  Coordinate engagement and frontline work for WASH sector in the region. Establish and strengthen linkages and networks with leading institutions, governments and other organizations to establish formal or informal partnerships Support significant NO-level donor and technical partner engagements Represent WV in global, regional and national WASH events, conferences, fora, seminars and technical working groups Effectively communicate program impacts, successes and challenges with stakeholders, donors and partners to increase the visibility of WASH within the region.  Evidence and learning:10%  Coordinate the documentation, publication and dissemination of promising practices Promote adoption and scale up of promising practices, project models and innovations Facilitate cross learning between NOs, learning from Support Offices (SO), other regions and peer organizations Engage research institutions and universities in mission critical /operational research to solve key problems/issues identified in communities Conduct operations research studies and pilots, documentation and ensure dissemination of lessons learned to members of the Communities of Practice (CoP), regional and international forum. Organize annual forum as a learning and innovation event  Collaboration and cross functional work:10%  Participate in the global WASH community of practice and major WASH networks in the region. Strengthen the WASH community of practice (CoP) in EAR through the establishment and running of the regional chapter Mobilize technical expertise across the region through GTRN, ensuring effective knowledge management, learning and continuous improvement of programming in the region. Collaborate with regional Disaster management/HEA to monitor situations and make recommendations for WASH in emergencies or related actions Collaborate with key regional entities on defined collaboration matrix and joint projects Participate in Regional disaster management team (RDMT) and support NO technical teams participation in National disaster management teams (NDMTs) Collaborate with HEA for joint actions in early warning, emergency preparedness and response.  Other responsibilities:5%  Carry out additional responsibilities as may be required.  KNOWLEDGE, SKILLS AND ABILITIES  Masters degree required in international relief and development, behavior change, engineering or business, plus related professional work experience Must have at least 10 years relevant experience in WASH programming in developing countries. Expertise in developing strategy, fundraising and cross sectoral integration. Experience in working in a complex political and operational environment/fragile context is preferred. Experience leading and managing a professional technical team. Demonstrated experience in leading research and evaluation for evidence and learning. Significant bi-lateral, multi-lateral donor grant experience with program design, implementation, funding acquisition and reporting.  Preferred Skills, Knowledge and Experience:  Theory of change and logical framework development Technical writing Hygiene and behavior change programming Experience in WASH in Emergencies Interpersonal and organizational skills Experience in Civil works will be an added advantage Networking and collaborating skills Presentation and communications skills Demonstrate World Visions Core Capabilities Experience in East Africa, program in fragile contexts Professional experience in training/capacity building Research and evaluation experience Multi-sectoral/integrated program design and implementation"
  },
  {
    "title": "Procurement Manager Job at Malindi Water and Sewerage Company Limited",
    "company": "Malindi Water and Sewerage Company Limited",
    "location": "Malindi",
    "description": "About the Company Malindi Water and Sewerage Company Ltd (MAWASCO), was established in 2005 Under the Kenya Companies Act Chapter 486 as a public water utility Company. The Company is wholly owned by the County Government of Kilifi and regulated by Water Services Regulatory Board (WASREB). MAWASCO's mandate is to provide clean and safe drinking water and sanitation services to its customers in Malindi, Magarini and part of Kilifi North Sub-counties.  Job Summary The Company is seeking to recruit a self-driven individual for the position of Procurement Manager. The successful candidate will report to the Managing Director and will oversee and coordinate the procurement function to ensure efficient and effective delivery of goods, services and works within the confines of the Law and the Company's regulations  Key Duties & Responsibilities 1. Formulate and implement the company's annual work plan and budget as per the procurement strategy 2. Ensure the company's procurements and... disposals are conducted in compliance with the 3. Public Procurement Asset & Disposal Act 2015 and Public Procurement & Asset Disposal Regulations 2020; 4. Procure goods, services and works for effective and efficient operations 5. Approve requisitions for quotations or tenders to prequalified suppliers or the public 6. Provide technical advice and Professional Opinion to the Accounting Officer  Requirements 1. Be a holder of Bachelor's Degree in Supply Chain Management/Procurement or relevant field. 2. Diploma in Supply Chain management, Procurement and Contract management, Purchasing and Supplies or equivalent 3. A postgraduate qualification in related field will be an added advantage: 4. Hold a relevant professional qualification/Membership of KISM/CIPS/Institute of Purchasing & Supplies and in good standing: 5. Have at least 8 years relevant work experience with a Public Institution, five (5) of which must be in a Senior Management position; 6. Fulfil the requirements of Chapter Six (6) of the Constitution of Kenya 2010, by providing:- a) Certificate of good conduct from Directorate of Criminal investigations (DCI) b) Clearance certificate from accredited credit reference bureau (CRB) c) Clearance certificate from Higher Education Loans Board (HELB) d) Valid Tax compliance certificate from Kenya Revenue Authority (KRA) e) Clearance certificate from Ethics and Anti-Corruption Commission (EACC)  Terms and Conditions of Service The position of the Procurement Manager will be on a Five (5) year contract renewable, subject to satisfactory performance"
  },
  {
    "title": "Monitoring, Evaluation and Learning Officer",
    "company": "Water Mission",
    "location": "Nairobi",
    "description": "Water Mission is a rapidly growing Christian engineering nonprofit working to end the global water crisis by building safe water, sanitation, and hygiene solutions in developing nations and disaster areas. Guided by love, excellence, and integrity, we are driven to share clean, safe water and God's love with all. To date, we have served more than 7 million people in 57 countries.  Working at Water Mission is as much a calling as it is a career, and we are searching for people with the courage, passion, and drive to help us change the world. Read more about our Statement of Faith and Christian Mission.  What is the opportunity? Working in collaboration with the Country Director Kenya and the Regional Human Resources Director Africa, the Human Resources Manager Kenya will assist in the development and implementation of the strategy, policies, and Human Resource functions in alignment with Water Mission headquarters.  This is a full-time position that reports to the Regional Human... Resources Director Africa and requires residency in Kitale, Kenya. The position requires travel to areas where Water Mission's Kenya program operates. What is the opportunity? The Monitoring, Evaluation and Learning Officer (MEL) will report to the Community Development Manager in Kenya. The MEL Officer will be responsible for designing, managing, and implementing MEL activities for Water Mission programs in Kenya.  The role will ensure that Water Mission Kenya achieves intended program results through strong oversight, management and implementation of performance and impact measurement and learning activities. The position will be based in Kitale.  A successful Monitoring, Evaluation, and Learning Officer will:  General Responsibilities: Align with Water Mission's Statement of Faith and core values of Love, Excellence, and Integrity.  Maintain a strong Christian witness and model servant leadership to colleagues, partners, the communities we serve, and the public. Engage and participate in prayer before and after team meetings. Lead and participate in biblically based staff devotions. Have a personal and growing relationship with Jesus Christ.  Program Monitoring and Evaluation System Design  Assist Water Mission in establishing key performance indicators, collecting performance information, planning, and implementing evaluation programs assigned.  Manage the development of performance monitoring and impact management systems for Water Mission's projects in Kenya, including the development and validation of program impact strategy, logical frameworks, measurement indicators, and data collection tools. Provide input into the design, implementation, and dissemination of evaluations, special studies, and assessments.  Manage the creation and review of global and country-level monitoring, evaluation, research, and learning budgets to provide adequate financial resources for evaluations, special studies, and assessments. Data Collection, Compliance, and Quality Assurance  Manage the implementation of data flow activities for Water Mission's projects in Kenya. Supervise all data collection activities.  Work closely with Water Mission's Community Development Officers, Project Managers, and Engineering teams to ensure timely and continuous collection of data using Water Missions data collection tools including Household, Church Congregation, and Community based Surveys.  Manage development and implementation of data flow improvements for the Water Mission program in Kenya that will ensure efficient data collection and reporting and support scalability.  Ensure data quality through data verification procedures, including routine data quality audits, and work with various teams to resolve discrepancies and improve processes. Develop and implement training on data collection, storage, quality assurance, and retrieval processes, as needed.  Data Analysis & Visualization  Support activities to transform quantitative and qualitative data sets into compelling reports and visuals for different types of audiences. Develop and implement plans, methods, and tools for analyzing data. Perform qualitative and quantitative data analysis as needed. Monitor and respond to relevant data points from the MAP - Water Mission's innovative Monitoring and Alerting Platform Manage analytical reports to provide direct and real-time insights to inform the project design and implementation in Kenya. Develop standard protocols, templates, infographics, and procedures to ensure data analysis and visualization needs are met.  Research Practices  Implement strategies to improve Water Mission and the broader WASH sector's ability to use data to drive future program design, implementation, and decision making.  Regularly develop performance reports and share program outcomes and learnings with Water Mission's International Programs team and all key stakeholders in Kenya (UNICEF, etc.) including reports, training, briefs, commentary, and visuals. Facilitate reflection, learning, and adapting meetings regularly in the country.  Work closely with the communications team to help promote Water Mission's content including reports, briefs, commentary, and visual data.  Cultivate strategic M&E relationships and alliances with partners and represent Water Mission's M&E, data analysis, and visualization activities in public and professional circles through meetings, conferences, and presentations. Other duties as assigned.  What is required?  Alignment with Water Mission's Statement of Faith and core values of Love, Excellence, and Integrity. Bachelor's degree in Demography, Statistics, Mathematics, Public Health, Environmental Health, or related field; or equivalent experience. A Master's degree will be an added advantage. At least 3-5 years of experience designing, managing, and implementing program monitoring and evaluation activities including:  Theory of change and M&E framework. Community needs, baseline, endline, and data quality assessments. Quantitative, qualitative, and mixed methods research & evaluation studies. Surveys, focus group discussions, observational data collection tools. Learning and adapting processes and mechanisms.  Domain expertise in data science, statistical analysis, and data visualization.  Working knowledge of one or more data analysis and visualization libraries and packages used today, including PowerBi, R, Tableau, SQL Python, JavaScript, SPSS, Stata, MS Access. Excellent analytical skills and the ability to summarize disparate information in a clear and concise manner.  Demonstrated ability to build consensus, solve problems, and work collaboratively and effectively with other leaders, volunteers, and employees at all levels. Ability to thrive in a highly fluid environment and respond to changing requests. Good written and verbal cross-cultural communication skills. Proficiency in spoken and written English is required. Ability and willingness to travel in-country for up to 20 weeks per year.  Most in-country trips require this person to ride long car rides on rough terrain and stand for extended periods of time. Commitment to ending the global water crisis. Authorization to work in Kenya"
  },
  {
    "title": "New JOBS Kenya",
    "company": "New JOBS Kenya",
    "location": "Nairobi",
    "description": "Deputy Director, Water Services (Principal Superintending Engineer (Water) Duties and Responsibilities Participating"
  },
  {
    "title": "Water and Land Management Expert",
    "company": "World Food Programme (WFP)",
    "location": "Nairobi",
    "description": "JOB DETAILS:  KEY ACCOUNTABILITIES (not all-inclusive) Under the overall guidance of the Head of Unit, the Water and Land Management expert will work under the supervision of the Team Lead for Resilient Livelihoods and work closely with the climate advisor and market access and value chains focal point, field offices and field-based agricultural engineers. The incumbent will be responsible for the following duties: 1. Facilitate and ensure timely implementation of critical water infrastructure rehabilitation in response to drought in close collaboration with relevant WFP Nairobi and field-based teams 2. Design strategy for early recovery activities focusing on integrated water solutions targeting pastoral and agro-pastoral communities in the arid counties of Kenya  taking early warning and climate projections into account 3. Facilitate timely procurement processes coordinating between field offices (including agricultural engineers), procurement and other relevant teams in... Nairobi 4. Ensure sound environmental management practices/guidelines are in place, monitored and reported on 5. Guide on strengthening community-based water governance and management practices across targeted counties 6. Strengthen existing monitoring frameworks to report on processes, outputs, outcomes of the rehabilitation work in collaboration with M&E, and support documentation of success stories 7. Represent WFP in water sector fora and act as liaison officer with the Ministry of Water, Sanitation and Irrigation, Millennium Water Alliance and other relevant partners 8. Explore opportunities for the use of innovative technologies and solutions, including with the private sector 9. Co-design UN Joint Programme on Water for Health, Food security and Resilient Livelihoods and develop other water and land management related proposals  DELIVERABLES AT THE END OF THE CONTRACT 1. Water rehabilitation projects under current drought response finalized - meeting all donor requirements (including plans for continuous monitoring sustainability) 2. Early recover strategy designed 3. Integrated water for resilience project documented and success stories shared 4. UN Joint Programme on Water for Health, Food Security and Resilient Livelhoods finalized and at least two other relevant proposals developed  STANDARD MINIMUM QUALIFICATIONS 1. Education: Advanced university degree in one or more of the following disciplines: water and land management, agricultural engineering, environmental management, or a related field. 2. Experience: At least five (5) years of experience sustainable land and water management, either in private sector enterprises, in non-profit value chain related projects or research institution 3. Languages: Fluency (oral and written) in English and Kiswahili necessary; proficiency in other languages spoken regionally in Kenya is an asset.  KNOWLEDGE AND SKILLS 1. Strong expertise in sustainable water, land and environment management (experience working as or with agricultural engineers is of advantage) 2. Excellent project management skills, including programme design, budgeting, procurement, implementation, monitoring and reporting skills 3. Experience working agro-pastoral/pastoral communities and organizations, and designing and implementing development projects, preferably in Kenya arid and semi-arid lands 4. Demonstrated ability to engage with public and private entities, planning and working together 5. Ability to work in a team and establish effective working relations across multi-functional teams as well as with a results-oriented private sector, research, think tanks and other key stakeholders 6. Solid operational skills, including creative thinking, problem solving, negotiation skills, meeting tight deadlines and working under pressure 7. Strong presentation skills and experience in public speaking of advantage. 8. Ability to frequently travel within the country  Work Hours: 8  Experience in Months: 60  Level of Education: Associate Degree"
  },
  {
    "title": "Attachment Opportunities",
    "company": "National Water Harvesting & Storage Authority",
    "location": "Nairobi",
    "description": "About National Water Harvesting & Storage Authority. (NWHSA)  National Water Harvesting & Storage Authority. (NWHSA) mandate is to undertake on behalf of the National Government, the development of National Public Water Works for Water Resources Storage and flood control among others.  Attachment Opportunities  We offer attachment opportunities to students who are still in college and in need of the necessary working skills and experience as part of their requirement for course completion. These opportunities are given as and when available in all our Departments and Divisions that include Technical, Human Resources, Procurement, Communication, ICT, Marketing, Audit and Legal.  Requirements for attachment  Application letter addressed to the Chief Executive Officer  National Water Harvesting & Storage Authority  P.O. BOX 30173-00100 Nairobi  Letter of attachment from the learning institution.  Student attachment insurance cover"
  },
  {
    "title": "Technical Manager at Bomet Water Company Ltd",
    "company": "jobwebkenya",
    "location": "Nairobi",
    "description": "Bomet Water Company Limited was formed following the introduction of the devolved system of government which is enshrined the Constitution of Kenya 2010. The company was registered on 18th June 2013 under the companies act (CAP. 486), Laws of Kenya. The objects of the company is to provide water and sewerage services within Bomet County.  The company has entered into a 5 year service provision agreement with Lake Victoria South Water Services Board (LVSWSB) which is the licensee for the region which covers Bomet County. The SPA was approved by the Water Services Regulatory Board (WASREB) to start from 30th September 2014. The company operates 8 water supply schemes namely; 1. Bomet water supply 2. Sotik water supply 3. Longisa water supply 4. Sigor water supply 5. Olbutyo water supply 6. Ndanai water supply 7. Itare water supply 8. Kamureito water supply Job Purpose  Reporting to Managing Director, he/she will be responsible for coordination, control and management of the Company's... infrastructure in order to supply water and sanitation services to the required standards and in compliance with company's policy while meeting costs and profit targets. Main Duties& Responsibilities  Develop departmental policies, plans, strategies and action plans that are in keeping with overall company missions and objectives. Provide high quality water to domestic, commercial and industrial customers ensuring that all such operations are carried out in effective and efficient manner and in compliance with the legal as well as Company Provisions Ensure the sewerage treatment and disposal plant functions effectively and efficiently in accordance with legal and company provisions and at minimum costs Develop a customer focus to the provisions of services by forming and maintaining good working relationship with customers.  Manages the company assets such as plant, machinery and other equipment through effective maintenance and repairs and installation and replacement, as well as technical audits so as to maximize return on capital investment. Prepare and submits comprehensive Department reports including Engineering Budgets , to the managing Director to facilitate decision making Carries out any other duties as may be assigned by the Managing Director.  QUALIFICATIONS, EXPERINCES AND SKILLS  Bachelor's Degree in Civil Engineering, Water Engineering, or related fields supported by at least six (6) years hands on experience in Engineering work preferably in the water and sanitation sector or related field with at least three (3) years at senior management level. Must be a registerable with EBK or IEK Master's Degree shall be an added advantage Will have demonstrated project management skills and hands on experience of managing external consultants, partners and donors Knowledge and experience in the use of GIS will be an added advantage Be at least 30 years of age.  Terms of Service : The positions are on a 3-Year Renewable Contract based on satisfactory performance.  Interested candidates must: Have demonstrated thorough understanding of the National Goals, Policies and Development Objectives including the Kenya Vision 2030; Have leadership and management capacity including knowledge of Financial Management and Strategic persons management; and  All applicants must comply with Chapter 6 of the Constitution of Kenya 2010 by submitting up to date clearance certificates from:  Ethics and Anticorruption Commission(EACC) Higher Education Loan Boards(HELB) Credit Reference Bureau (CRB) Directorate of Criminal Investigations(DCI) Kenya Revenue Authority (KRA)  RENUMERATION  An attractive remuneration package commensurate with the responsibilities of the job and the experience of the individual will be negotiated with the best evaluated candidate"
  },
  {
    "title": "Project Officer  Water Engineer",
    "company": "Fuzu",
    "location": "Nairobi",
    "description": "Job SummaryContract Type:Sign up to view job details.ABOUT THE ROLEPractical Action is implementing a 2-year project funded by the Water Sector Trust Fund (WSTF) under SWASAP project to implement activities in Kalokol area, Turkana Central Sub- County. The project goal is to increase community resilience and adaptation to climate change through sus....."
  },
  {
    "title": "Managing Director at Bomet Water Company Ltd",
    "company": "Bomet Water Company Ltd",
    "location": "Nairobi",
    "description": "Bomet Water Company Limited was formed following the introduction of the devolved system of government which is enshrined the Constitution of Kenya 2010. The company was registered on 18th June 2013 under the companies act (CAP. 486), Laws of Kenya. The objects of the company is to provide water and sewerage services within Bomet County.  The company has entered into a 5 year service provision agreement with Lake Victoria South Water Services Board (LVSWSB) which is the licensee for the region which covers Bomet County. The SPA was approved by the Water Services Regulatory Board (WASREB) to start from 30th September 2014. The company operates 8 water supply schemes namely; 1. Bomet water supply 2. Sotik water supply 3. Longisa water supply 4. Sigor water supply 5. Olbutyo water supply 6. Ndanai water supply 7. Itare water supply 8. Kamureito water supply  TERMS OF EMPLOYMENT: Contract (Three years' renewable based on performance).  MAIN PURPOSE OF JOB  Reporting to the Board of... Directors, the Managing Director will be responsible for giving strategic guidance and direction consistent with the Company's Vision and Mission Statement, He/she will ensure that the Company achieves its short and long term objectives to the board to ensure that the Company achieves its financial vision, mission and long term objectives.  He/She manages the company's resources, motivates workforce, cultivates strong relationships with all stakeholders and entrench a high performance Corporate culture.  KEY PERFORMANCE AREAS Provides leadership in the development and implementation of the Company's Strategic Plan and enhances profitability and shareholder value; Prepares and recommends to the Board of Directors for approval, the annual budget based on Corporate Strategic Plan and Annual Business Plan; Represents the Company at national and international stakeholder forum including government bodies, donors and the community; Responds to customers' concerns/issues and determines appropriate resolutions to maintain positive Company and customer relations; Implements the Strategic Plan and ensures that the operationalization of all the remaining merger processes with the former Tililbei Water and Sanitation Company are completed; Carry out resource mobilization for the expansion of water and sanitation infrastructure; Enhances the Company's Corporate image; Promotes sound corporate governance and ethical standards; Gives strategic advice and presents results and findings to the Chairman and Board members; Manages resources, including the attracting, hiring, retention and motivation of high performing personnel; Takes active role in Water Service Providers Association (WASPA); Monitors the annual budget and ensures that revenue targets are met; Prepares and presents MDs reports during full board meeting.  SKILLS, KNOWLEDGE & OTHER JOB REQUIREMENTS  Bachelor's Degree in Engineering (Civil/Water/), Commerce or from a recognized University; Master's Degree shall be an added advantage Must be a registered member of relevant professional body At least Ten (10) years progressive and relevant work experience, five (5) of which must be at senior management level in an organization serving a large and demanding public utility;  Must be familiar with the reform programs in commercial and public settings and demonstrable through understanding of the national goals, policies and development objectives including the Kenya Vision 2030. All applicants must comply with Chapter 6 of the Constitution of Kenya 2010 by submitting up to date clearance certificates from:  Ethics and Anticorruption Commission(EACC) Higher Education Loan Boards(HELB) Credit Reference Bureau (CRB) Directorate of Criminal Investigations(DCI) Kenya Revenue Authority (KRA)  TERMS OF SERVICE The successful candidate will be offered a Three (3) year renewable Contract based on satisfactory performance.  RENUMERATION  An attractive remuneration package commensurate with the responsibilities of the job and the experience of the individual will be negotiated with the best evaluated candidate"
  },
  {
    "title": "Assistant Electrician",
    "company": "Nyahururu Water and Sanitation Company Limited",
    "location": "Nairobi",
    "description": "JOB DETAILS: NWSCO/AE/8/2023 Job Specifications  Certificate in Electrical Installation  Previous work experience will be an added advantage.  KCSE certificate.  Computer skills  Personal attributes, must be a person with:  Good communication skills  Self - driven  Integrity  Teamwork  Duties and Responsibilities  Undertake routine checks and preventive maintenance of electrical equipment and appliances  Undertake installation, servicing and maintenance of all electrical equipment and instruments.  Assist in preparing electrical equipment/s specifications for purchase orders.  Recommends important or modification of existing electrical equipment or appliances.  Provides input to the annual preventive maintenance schedule and recommends equipment upgrades or replacement.  Liaison with KPLC in ensuring continuous power supply to boreholes, water and waste water works pumping stations and offices  Job Experience: No Requirements  Work Hours: 8  Experience in Months:  Level... of Education: Professional Certificate"
  },
  {
    "title": "Project Officer  Water Engineer Job Vacancy in Lodwar, Kenya...",
    "company": "NGO",
    "location": "Lodwar",
    "description": "Project Officer  Water Engineer Job Vacancy in Lodwar, Kenya Practical Action  Position Title: Project Officer  Water Engineer  ABOUT US  We are an international development organization dedicated to translating ingenious ideas into impactful actions, empowering people in poverty to transform their world. Our mission involves finding innovative solutions to some of the most challenging global issues exacerbated by climate change and gender inequality. We partner with communities to develop sustainable, locally-driven solutions spanning agriculture, water and waste management, climate resilience, and clean energy. Our knowledge-sharing ethos ensures that successful solutions are scaled for widespread impact.  We are a dynamic global group comprising a UK registered charity with community projects spanning Africa, Asia, and Latin America. Additionally, we house an independent development publishing company and offer technical consulting services. Our combined expertise allows us to... amplify our influence, contributing to a world that works better for everyone.  OUR AIMS  We are on a mission to confront the worlds most pressing challenges, which have been aggravated by catastrophic climate change and persistent gender inequality. Our key aims are to:  1. Enhance Agricultural Resilience: Improve agricultural practices for smallholder farmers, with a particular focus on women, enabling them to adapt to climate change and achieve a higher quality of life.  2. Promote Accessible Clean Energy: Facilitate greater access to affordable, clean energy sources, reducing avoidable deaths caused by indoor smoke from stoves and fires.  3. Foster Safer, Cleaner Cities: Work towards creating cleaner, healthier urban environments in lower-income countries.  4. Build Disaster Resilience: Incorporate disaster resilience into the lives of individuals at risk from hazards, reducing the impact on livelihoods and well-being.  PRACTICAL ACTION IN KENYA  In Kenya, Practical Action has a rich history of dismantling systemic barriers that hinder access to transformative energy, promoting healthier and safer cities, optimizing agriculture for small-scale farmers, and bolstering community and governmental resilience.  We employ a strategic blend of community-based programming and consultancy services to achieve our objectives.  ABOUT THE ROLE  Practical Action is at the helm of a 2-year project funded by the Water Sector Trust Fund (WSTF) under SWASAP. Our mission: to implement initiatives in the Kalokol area, Turkana Central Sub-County. The projects overarching goal is to enhance community resilience and adaptation to climate change by promoting sustainable, peaceful use of natural resources. This includes improving access to water and sanitation services in Turkana County.  Key Project Objectives:  Enhance integrated water resources management, supporting 785 households.  Increase access to sustainable sanitation services for 900 households through CLTS (Community-Led Total Sanitation).  Benefit 2,500 learners in 3 public institutions with increased access to sustainable water services.  Strengthen governance and management of available water resources.  Improve incomes for 400 men and women through diversification initiatives.  Practical Action seeks a talented Project Officer-Water Engineer to lead the programs technical aspects, provide advisory support, drive fundraising efforts, and ensure result-oriented monitoring and evaluation in line with global standards.  ACCOUNTABILITIES  Leadership and Strategic Alignment  Contribute to Practical Actions strategic business planning process, with a specific focus on the Climate and Resilience Change Ambitions.  Strengthening Profile, Generating Funding, and Managing Relationships  Act as a representative of Practical Action within the project area, engaging with local government, communities, NGOs, and other stakeholders as required.  Participate in local coordination and networking meetings.  Document valuable lessons from the project and disseminate them within and outside Practical Action.  Foster professional relationships with development agencies, government bodies, county governments, technical and economic specialists, universities, and other professional institutions.  Support fundraising initiatives aligned with Practical Actions Climate and Resilience Change Ambition.  Collaborate effectively with partners to foster learning and the adoption of innovative, gender-responsive, and inclusive interventions.  Delivering Quality  Plan, implement, and report on assigned projects, with a specific focus on coordinating hardware components with the team.  Oversee the construction of new water supply systems and sanitation facilities.  Initiate community consultation and sensitization campaigns.  Develop project work plans and implement capacity-building initiatives.  Participate in capacity building training and project activities.  Train community members on the operation and maintenance of water supply and sanitation systems.  Coordinate with external agencies involved in contractual work within the project site.  Lead technical advisory efforts and respond to proposal opportunities.  Ensure project budgets are sound and adhere to timelines.  Monitor and inspect project activities to meet global standards.  Prepare technical field reports related to onsite inspection and monitoring.  Ensure timely preparation of payment reports.  Manage on-site water committee meetings.  Oversee construction and consultancies reports.  Contribute to stakeholder meetings and workshops.  Prepare tender documents.  Participate in groundwater investigation and mapping.  Supervise borehole drilling operations.  Assist in report compilation.  Ensure technical support documents are readily available.  PERSON PROFILE  To excel in this role, the ideal candidate will demonstrate:  Experience & Knowledge  Bachelors degree in water engineering or equivalent from a recognized institution.  Diploma in Water Engineering with at least five years of progressive experience in a similar capacity.  Proficiency in word processing, spreadsheets, AutoCAD, GPS, ArcGIS, and Google Earth is highly desirable.  Essential  Familiarity with local circumstances.  Strong knowledge transfer and communication skills.  Ability to perform under pressure.  Expertise in water development, monitoring, and sustainability.  Experience in groundwater management and drilling supervision.  Competence in water point maintenance and management.  Technical capacity in drilling applications.  Desirable  Extensive experience in water systems design.  Knowledge of pumping systems.  Proficiency in GIS and remote sensing related to water infrastructure.  Familiarity with hydrogeological, geological, and EIA assessment techniques.  Experience with EPRA and NEMA guidelines.  Ability to collaborate with diverse teams.  EXPERT Tips To Be A Successful Applicant  Tailor Your Application: Customize your CV and cover letter to align with the specific qualifications and responsibilities outlined in the job description. Highlight relevant experience in water engineering and project management.  Showcase Technical Skills: Clearly demonstrate your proficiency in software tools such as AutoCAD, GPS, ArcGIS, and Google Earth, as these are essential for the role.  Highlight Local Knowledge: Emphasize your familiarity with local conditions, a valuable asset in implementing water projects effectively.  Provide Concrete Examples: When discussing your experience, use quantifiable achievements. For instance, mention the number of households or communities youve impacted positively in previous roles.  Team Collaboration: Highlight your ability to work collaboratively with diverse teams, essential for successful project implementation.  Continuous Learning: Mention any ongoing professional development or courses related to water engineering or project management.  How to Apply  If you are ready for an exciting challenge with an organization whose mission and values are particularly relevant in these rapidly changing times, please forward your application, curriculum vitae, and cover letter to Practical Action, Kenya Office via email at recruitment@practicalaction.or.ke by no later than 13th October 2023. Please use Practical Action: Job Title Position in the email subject line. Your cover letter should articulate why you are the right candidate for this position. Dont forget to include"
  },
  {
    "title": "WASH Officer  Sanitation and Hygiene",
    "company": "IRC - The International Rescue Committee",
    "location": "Lodwar",
    "description": "**Job Description**  The position holder is responsible for the technical oversight, implementation, monitoring, and regular consultation with project stakeholders on hygiene and promotion interventions. Ensure complementarity with other sectorial interventions, i.e. Health, Nutrition, DRR and livelihood as well as proper coordination, consultation and information sharing with partners and other stakeholders.  *Main Responsibilities**  The WASH Hygiene officer shall be responsible for the technical aspects of hygiene and sanitation promotion. S/he shall be responsible for planning, design, implementation, monitoring and evaluation of high quality, innovative Hygiene and Promotion interventions. She/he will ensure that an engagement approach to working with communities, the local authorities, partners other stakeholders is employed, and all activities are carried out in a way that is sensitive to community needs and promotes the full and equal participation of women, men, children... and youth.  Primary responsibilities include:  *Project planning and design**  \\- Support in the planning for and Design of the community hygiene and sanitation initiatives and methodology. \\- Support in the project assessments and proposal development for potential sanitation and hygiene promotions.  *Project implementation**  \\- Ensure that the hygiene and sanitation promotion activities of the project are implemented according to the approved donor guidelines and humanitarian standards. \\- In collaboration with the WATSAN officer, ensure that hygiene and sanitation promotion activities accompany the water supply and sanitation interventions. \\- Working with the WATSAN Officer facilitate training WMCs, other Community structures (SMCs, CHWs, CHEWs, Youth Groups) and local authorities on improved hygiene/sanitation practices and management.  *Project monitoring and evaluation**  \\- Ensure timely delivery of projects activities. \\- Ensure that up to date project documents are in place including approved work plans, log frame, detailed project implementation plan and financial forecasts. \\- Documentation of lessons learnt and good practices. \\- In consultation with MEAL, design and conduct all quantitative and qualitative assessments, KAP surveys, and follow-up assessments with concrete feedback findings.  *Fundraising and networking**  \\- Support in the development of technically sound proposals.  *Coordination and Collaboration**  \\- Co-ordinate and network with the relevant County Government ministries and departments, , Community based organizations, Faith based organizations and NGOs and other relevant departments in providing technical support and assistance to WASH activities \\- Liaise directly with communities, and community structures on water supply and sanitation issues as well as other agencies (particularly those carrying out similar activities) regularly to ensure coordination and effective implementation of activities through guidance of the Supervisor/FC. \\- Under the guidance of the supervisor (or Field Coordinator) contributes towards strengthening of integration of WASH programming with the other key IRC program Sectors  *Reporting**  \\- Develop and delivery in a timely manner monthly, quarterly, semi- annual and end of projects reports in accordance with donors and IRC Kenya requirements. \\- Support development, monitoring and evaluation WASH project indicators and standards \\- Provide regular update reports on hygiene and sanitation activities and program progress against work plan as maybe required. \\- Maintain an up to-date activity tracking tool (soft copies and hard copies) of all water supply and sanitation infrastructure related activities. \\- Actively participate in inter-sectoral activities \\- Support WASH department in other tasks, roles and responsibilities as may be assigned by the supervisor.  *Qualifications**  \\- Degree in environmental health science, community development, social development public health, or related field. A minimum of Three years experience working/programming in WASH, humanitarian work or development.  *Required Experience & Competencies:**  \\- Minimum of 3 years relevant work experience in WASH, Public health, community development \\- Strong skills in PHAST, CLTS, sanitation marketing, design for behavior change models essential. \\- Experience in community engagement approaches, participatory approaches, and community negotiation \\- Excellent verbal and written communication skills \\- Strong interpersonal skills and ability to establish and maintain effective working relations with a team. \\- Ability to conduct community WASH needs assessment, program planning, implementation, monitoring, and evaluation of WASH activities. \\- Good understanding of SPHERE and other humanitarian standards \\- Good computer application skills (MS-Office, application software to engineering designs).  **Standards of Professional Conduct:*** *The IRC and IRC workers must adhere to the values and principles outlined in the IRC Way  Code of Conduct. These are Integrity, Service, Accountability and Equality. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Harassment-Free Workplace, Fiscal Integrity, Anti-Retaliation, Combating Trafficking in Persons, and several others.*  **Gender Equality:*** *IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce including parental leave, gender-sensitive security protocols and other supportive benefits and allowance.*  **Kenyan nationals are encouraged to apply. International allowances are not available for this position. Salary and employee benefits are compliant to the Kenyan NGO Sector.***  **IRC is an Equal Opportunity Employer and considers all applicants based on merit without regard to race, sex, color, national origin, religion, sexual orientation, age, marital status, veteran status or disability.***  **Disclaimer:***  **Please take note that the International Rescue Committee (IRC) does not ask for any fees in connection with its recruitment processes"
  },
  {
    "title": "Human Resource and Administration Manager at Bomet Water Company Ltd",
    "company": "Bomet Water Company Ltd",
    "location": "Nairobi",
    "description": "Bomet Water Company Limited was formed following the introduction of the devolved system of government which is enshrined the Constitution of Kenya 2010. The company was registered on 18th June 2013 under the companies act (CAP. 486), Laws of Kenya. The objects of the company is to provide water and sewerage services within Bomet County.  The company has entered into a 5 year service provision agreement with Lake Victoria South Water Services Board (LVSWSB) which is the licensee for the region which covers Bomet County. The SPA was approved by the Water Services Regulatory Board (WASREB) to start from 30th September 2014. The company operates 8 water supply schemes namely; 1. Bomet water supply 2. Sotik water supply 3. Longisa water supply 4. Sigor water supply 5. Olbutyo water supply 6. Ndanai water supply 7. Itare water supply 8. Kamureito water supply Job purpose  Responsible for developing, implementing and effectively managing Human capital and Administration policies... strategies, systems and processes and ensures these are aligned to the corporate strategic objectives and increase productivity and enhance organizational effectiveness.  Coordinate the implementation of administrative support services such as visitor reception, mail delivery, document/information management, occupational safety and maintenance of office facilities. Reporting relationship  This role reports to the Managing Director.  Supervisory Role  Human Resource Officer, Human Resource Assistant, Administrative office, Administrative Assistant, Office Assistant, Drivers, Security Officers, ground's men/women, Registry Assistant  Job Specification.  The HRAM will report to the Managing Director.  The duties and responsibility of the officer will entail:  Provide professional leadership in the development and implementation of human capital and administration plans and budgets, outlining activities to be undertaken, resource requirements, key performance measures and indicators as well as expected outcomes. Ensure Performance management by operationalizing performance contracts and staff appraisal system. Oversee the management of change process within the company, team building and positive work attitude.  Payroll Management  Provision of guidance and counselling services to the employees Ensure timely Preparation of Departmental Work plan, Budget and reports  Coordinate compilation and submission of relevant Departmental performance reports for the attention of the Managing Director in collaboration with the executive Secretary. Automation of HR function to enhance efficiency and effectiveness Develop and implement performance rewards and motivation system  Developing and updating sound human resources policies based on the Labour laws, create awareness of the policies and ensure safe custody, implement human resource policies and procedures aimed at enhancing workplace relations and ensuring that employees are treated fairly, uniformly and equitably.  Conduct workforce analysis, determine optimum staff requirements and design organizational structures that maximize synergies across functions to support the implementation of the approved strategic plans. Develop job descriptions and competency profiles in liaison with other departments to facilitate human capital planning, staff recruitment and selection, performance management, training and development, job evaluation and pay structure design as well as career planning.  Develop and implement the performance management system and ensure that individual and team performance is continuously monitored and measured against targets aligned to the strategic direction by clearly defining performance measures and indicators, expected timeframe as well as resource requirements.  Assess training needs and carry out baseline attitude surveys in order to design and implement relevant training programme aimed at building staff capacity.  Resolve employee grievances and disciplinary cases, recommending appropriate action to solve problems and assist employees in finding satisfactory solutions to personal problems through counselling services.  Ensuring timely and economic provision of administrative services such as adequate office supplies, transport, insurance and maintenance of plant & equipment. Manage the recruitment and selection policies and process in consultation with the  Managing Director in order to ensure that BOMWASCO has qualified human capital with the required competencies necessary for implementation of functional strategic management plans.  Develop and coordinate the implementation of staff induction and on-the-job orientation programme aimed at providing new staff with relevant information about the technical and social aspects of their work.  Ensure that the terms and conditions of service and remuneration are revised periodically in conformity with the prevailing Labour market and WASREB guidance as need arises to promote staff morale and enhance sense of belonging amongst staff. Oversee the implementation of an effective human resource management information system for monitoring, tracking and evaluating employee activities including staff training, performance management, medical, pension and welfare programme Oversee proper maintenance, storage and security of personnel records to ensure integrity of data and information related to human capital development programmes as well as administrative support services.  Oversee the administration of employee medical and insurance packages including workers compensation through the appropriate benefit schemes such as NHIF, NSSF, and other employee welfare programmes.  Oversee and coordinate the functions of the administration section and provides guidance on related matters such as cost-effective mail delivery systems, data/information management, office security, vehicle maintenance, communication facilities and front office reception services. xxiv. Prepare and submit relevant reports as and when required xxv. To provide leadership, guidance and inspiration to the team to ensure high level of staff engagement. xxvi. Administer and coordinate Staff welfare issues. Any other duties as may be assigned from time to time by the Managing Director or the Board  Person Specification For appointment to this position, the person must have;  Bachelors' degree in HRM, Business Administration/Management, Social Sciences from a recognized university; Membership to a professional body IHRM CHRP (K) or Higher National Diploma Ten (10) years relevant experience, Five (5) years at Senior Management level Master's Degree shall be an added advantage Understanding of Labour laws. Computer Knowledge and understanding of ERP system Report Writing Skills Demonstrated high performance and leadership in previous roles Meet the requirements of Chapter Six (6) of the Constitution  Key Competence and Skills  High level of integrity and maturity including team working / building skills Effective interpersonal and communication skills Public Relations Skills Ability to work under pressure and multitask Ability to drive change and innovations Professional in good standing Planning Skills Negotiations and conflict resolution Skills Sound judgement  Terms and Condition of Service:  The Position of Human Resource and Administration Manager will be on Three (3) years renewable Contract based on satisfactory performance.  RENUMERATION  An attractive remuneration package commensurate with the responsibilities of the job and the experience of the individual will be negotiated with the best evaluated candidate"
  }
]