[
  {
    "title": "Site Engineer",
    "company": "Selibeng",
    "location": "Lesotho",
    "description": "ConcorNthane Brothers M&K JV has been awarded the contract for the construction of Mabunyaneng and Khubelu Bridges on behalf of the Lesotho Highlands Water Authority. The Project entails the engineering and contracting services which is inclusive of construction of two bridges and associated ancillary works, on the A1 road in Mapholaneng.  Thus, suitably qualified and experienced individuals are required for the following position, to join the Joint Venture on a Limited Duration Contract. The successful candidate/s shall be site based.  REFERENCE NO: CNB-JV-PA-003  POSITION: Site Engineer  QUANTITY: 1  QUALIFICATIONS/COMPETENCIES  A recognised Civil Engineering Degree or Diploma/Eligible for SACPCMP or ECSA registration / Relevant Safety Training (e.g. Legal Liability, Construction Regulation etc.) / Excellent Computer Skills (in Microsoft Office, CCS advantageous, ERP systems etc.) / Leadership skills, Interpersonal and Communication Skills(Oral/Writing)/ COLTO, FIDIC / Valid... Drivers Licence / Medically Fit.  EXPERIENCE  Minimum 5 years experience in working in Major construction projects for the main contractor (Site Establishment, Earthworks and Roadworks) / Managing construction teams and working with all project support teams / Technical and Quality management skills / Cost monitoring, control and reporting / Planning and Procurement processes  Submissions of applications:  Application letters must be accompanied by CVs with minimum three contactable references, certified copies of relevant qualifications, confirmation of physical address and drivers licence should be submitted to the Mokhotlong DAs office, LHDA Tlokoeng offices and Mphokojoane Council offices OR emailed to cv@cnbjv.co.za. Each application should be addressed to Concor-Nthane Brothers M&K JV Recruitment, and specify the position, and applicable reference number.  Enquiries (Only via email): cv@cnbjv.co.za.  Closing Date: 05 OCTOBER 2023 at 12:00.  Only shortlisted candidates will be contacted.  Lesotho Highlands Water Project  Phase II  Zutari  Bokamoso Business Suites, Orpen Road, Maseru  Tel: +266 22315788  Lesotho Highlands Water Project  Phase II"
  }
]