[
  {
    "title": "VAC-6227 Technical Lead  Water & Wastewater Management careers in...",
    "company": "UNICEF",
    "location": "Bamako",
    "description": "This Job listing For Year 2022 is about UNICEF in Bamako, Mali  About the job  Job Description CTG Overview  CTG staff and support humanitarian projects in fragile and conflict-affected countries around the world, providing a rapid and cost-effective service for development and humanitarian missions. With past performance in 17 countries  from the Middle East, Africa, Europe, and Asia, we have placed more than 20,000 staff all over the world since operations began in 2006.  CTG recruits, deploys and manages the right people with the right skills to implement humanitarian and development projects, from cleaners to obstetricians, and mechanics to infection specialists, were skilled in emergency response to crises such as the Ebola outbreak in West Africa. Key to successful project delivery is the ability to mobilise at speed; CTG can source and deploy anyone, anywhere, in less than 2 weeks and have done so in 48 hours on a number of occasions.  Through our efficient and agile HR... logistical and operational services, CTG saves multilateral organisations time and money. We handle all our clients HR related issues, so they are free to focus on their core services.  Visit www.ctg.org to find out more  Overview Of Position  The Technical Lead will provide hands on water, wastewater management & strategic advice on the operational management of water & wastewater treatment within challenging operational contexts. The Technical Lead manages all the Site Managers across Mali, travelling between the different locations to control the operations, the maintenance procedures & the safety requirement.  The Technical Lead is the interface between the Project Manager & the Site Managers for the maintenance & the operations of the Water Treatment Plants (WTP) & the Wastewater Treatment Plants (WWTP).  Role objectives  Interprets instructions & documentations from the Project Manager, transferring them into tangible work plans & actions for the different sites.  Setting up work sites with health & safety as a top priority, including placing warning signs, barriers & warning flags.  Installing or maintaining repairs & replaces all job related to WTP & WWTP installations.  Inspecting tools & equipment to meet the required safety standard.  Following all project rules, procedures, safety requirements, including wearing required safety equipment.  Troubleshooting recurrent equipment & site performance problems.  Undertaking review of & / or conducting risk assessments, root causes & developing appropriate risk mitigation measures.  Training / capacity building of local staff as required.  Provide technical advice to Site Managers.  Project reporting  The Technical Lead will report directly to the Project Manager.  Key competencies  Advanced University Degree (Masters or equivalent) in Water & Wastewater, Mechanical, Civil, Chemical or Environmental Engineering.  At least 7 years technical experience in the design, planning, installation & commissioning of water & wastewater projects in similar environments.  At least 5 years experience in engineering project management & the leadership & / or capacity building of engineering & technical teams.  Experience in all aspects of water & wastewater management.  Experience in fieldwork in remote sites, fragile states & post conflict settings.  Experience within the UN system is desirable.  Fluency in both English & French in writing, reading & speaking is required.  Team management  The Technical Lead manages all the Site Managers across Mali.  Further information  Qualified female candidates are encouraged to apply for this role.  At no stage of the recruitment process will CTG charge candidates a fee, this includes during the application stage, interview, processing, assessment & training.  Company: UNICEF  Vacancy Type: Full-time  Associate  Job Location: Bamako, Mali  Application Deadline: N/A  Apply Here  ml.q4jobs.com"
  },
  {
    "title": "Operations / Site Manager  Water Plant Operations",
    "company": "CTG",
    "location": "Bamako",
    "description": "CTG overview:  CTG staff and support humanitarian projects in fragile and conflict-affected countries around the world, providing a rapid and cost-effective service for development and humanitarian missions. With past performance in 17 countries  from the Middle East, Africa, Europe, and Asia, we have placed more than 20,000 staff all over the world since operations began in 2006.  CTG recruits, deploys and manages the right people with the right skills to implement humanitarian and development projects, from cleaners to obstetricians, and mechanics to infection specialists, were skilled in emergency response to crises such as the Ebola outbreak in West Africa. Key to successful project delivery is the ability to mobilise at speed; CTG can source and deploy anyone, anywhere, in less than 2 weeks and have done so in 48 hours on a number of occasions.  Through our efficient and agile HR, logistical and operational services, CTG saves multilateral organisations time and money. We... handle all our clients HR related issues, so they are free to focus on their core services.  Visit www.ctg.org to find out more  Overview of position:  The Operation / Site Manager  Water Plant Operations role is mainly to implement the right processes & practices across the base especially for the water management.  Responsibilities include the following:  Reports to & receives assignments instructions & direction from his Technical Lead.  Reads, interprets instruction, documentation & plans work activities.  Installs or maintains, repairs, replaces all job related to WTP & WWTP installation.  Follows up daily preventive maintenance & keep record of log sheet.  Inspects tools & equipment to meet the company safety standard.  Follows all project rules, procedures, safety requirements, including wearing required safety equipment.  Handles the sample collection for the laboratory analysis & conducts the field analysis.  S/ He performs other task & activities as directed.  Project reporting:  This role reports to the Tehnical Lead managing the project.  Key competencies:  Must hold a Bachelor Degree in a relevant discipline.  Solid experience in conducting of similar operations inside a watre treatment plant.  Must be fluent in English & French  Team management:  The incument is responsibile for managing technicians & their daily tasks  Further information:  Qualified female candidates are encouraged to apply for this role.  At no stage of the recruitment process will CTG charge candidates a fee, this includes during the application stage, interview, processing, assessment & training"
  }
]