[
  {
    "title": "WASH Project Officers (2)",
    "company": "Water For People",
    "location": "Malawi",
    "description": "Join Our Team We are HiringA. SummaryWater For People is an international non-governmental organization (NGO) that works with people and partners to develop innovative and long-lasting solutions to the water, sanitation, and hygiene problems globally. The organization strives to continually improve, experiment with promising new ideas, and leverage resources to multiply its impact.Water For People in collaboration with World vision are prospecting a US$10 million funding that will support the implementation of Water, Sanitation, and Hygiene (WASH) services for everyone in Chiradzulu District project. In preparation for this project which is planned to commence in January 2022 once funding is secured Water For People is hiring the following positionsC. WASH Project Officers (2)The WASH Project Officer is responsible for the day to day implementation of the project.Major ResponsibilitiesEnsure effective delivery all annual WASH targetsLiaise with Chiradzulu District Council... Coordinating Team in planning and tracking progress towards achievement of project objective as outlined in the Multiyear Operational Plans (MOP).Collaborate with and other relevant government department in the dissemination of information related to water, sanitation and hygiene and development of IEC materials to assist in the promotion of water supply management, sanitation, and hygiene.Collaborate with District Councils and District Health Office in facilitating demand creation activities for improved sanitation.Lead teams in conducting Knowledge, Attitude and Practices (KAP) surveys including willingness to pay and customer satisfaction surveys in all targeted areas.Work closely with Councils in identifying, training and mentoring Water Point Committees and other management committees on sustainable water and sanitation management.Facilitate strong and sustainable linkages between District Councils, water supply scheme management committees, and expert service providers to enhance sustainable management of water systems.Work closely with local implementing partners (NGOs, private sector, and CBOs) in the targeted areas to enhance the efficiency and effectiveness in the implementation of programme activities.Participate and ccontribute in the development of Joint Action Plans and Reviews of interventions in the target areas with other district stakeholdersLead the development/review of training manuals, checklists, and advanced monitoring tools on water scheme which enhance scheme performance, monitoring, reporting, and data management.In liaison with other project staff, participate actively in development of Monitoring and Evaluation plan for Water, sanitation, and hygiene component of the program in project area.Qualification and experienceA minimum of bachelors degree in Social Science, Environmental Health, Water Resources management and Development, Civil Engineering, or related field is preferred.Over 3 years of experience in water and sanitation projects working in partnership with NGOs and private sector is necessary.F. Employment ConditionsPosition is based at Water For Peoples Malawi office;Trips within and outside Malawi will be required from time to timePlease send your application letter and CV including copies of relevant certificates through email to The Country Director at [email protected] the email heading should read Senior WASH Program ManagerClosing date of application is December 13th, 2021Note: Due to the many number of applications that we normally receive shortlisting and interviews will be done on a rolling basis without waiting for the closing date. Only short-listed candidates will be contacted.  Application email or URL: malawi@waterforpeople.org"
  },
  {
    "title": "PROJECTS MANAGER",
    "company": "Water Mission",
    "location": "Lilongwe",
    "description": "This post is located in Malawi. We are accepting applications through April 9, 2023.  Who is Water Mission?  Water Mission is a nonprofit Christian engineering organization that designs, builds, and implements safe water, sanitation, and hygiene (WASH) solutions for people in developing countries and disaster areas. Guided by love, excellence, and integrity, we are driven to share clean, safe water and Gods love with all. To date, we have served more than 7 million people in 57 countries. Working at Water Mission is as much a calling as it is a career, and we are searching for people with the courage, passion, and drive to help us change the world. Read more about our Statement of Faith and Christian Mission.  What is the opportunity?  Reporting directly to Water Missions Country Director in Malawi, the Projects Manager will perform project management tasks within the Country Program following established standards and procedures. The position is based in Lilongwe, Malawi. It is... primarily office-based but requires travel to remote locations in respective regions to carry out inspections or training. It includes frequent field visits and national and occasional international travel.  A successful Projects Manager will:  * Maintain a strong Christian witness and model servant leadership to colleagues, partners, the communities we serve, and the public.  Understand, support, and nurture the Vision, Mission, and Core values of Water Mission.  Provide project management oversight of all projects by tracking the scope of works, project schedule, and budget using Water Missions project management software systems.  Provide direction and assistance for staff, contractors, and volunteers in the field.  Provide as-needed onsite project management in support of approved projects.  Conduct field inspections and site assessments as needed under the direction of the Country Director.  Maintain regular contact with Department Heads, Water Mission headquarters Program Manager, and stakeholders.  Oversee project procurement planning and the submission of procurement requisitions to the procurement department.  Assist with proposal writing, grant applications, and grant reporting.  Ensure all service contracts are properly tracked, and pay apps are updated accordingly every month and provided to finance as and when needed.  Oversee the effective coordination of all project activities between engineering, community development, and procurement.  Oversee management of local contractors.  Support staff resource tracking and scheduling to ensure suitable utilization of staff time  Support vehicle tracking and scheduling to ensure controlled mileage.  Perform other duties as assigned.  What is required?  * Personal and growing relationship with Jesus Christ.  Alignment with Water Missions Statement of Faith and core values of Love, Excellence, and Integrity.  Alignment with the principles of servant leadership as embraced within Water Mission.  Bachelors degree required.  Additional professional qualification preferred, preferably in project management.  3+ years of experience in project management.  Possession of a valid driving license.  Self-starter who demonstrates initiative.  Excellent written and verbal communication skills, with the ability to articulate ideas and feedback in a constructive way.  Ability to work both independently and collaboratively with a team.  Ability to travel domestically and internationally for up to three consecutive weeks, three to four times a year.  Legal authorization to work in Malawi without sponsorship.  Commitment to ending the global water crisis.  Application instruction  Applications should be online through the Water Mission Website:  https://watermission.bamboohr.com/careers/236?source=aWQ9MTc%3D or https://watermission.org/careers/  Only short-listed applicants will be contacted for an interview"
  },
  {
    "title": "Young Proffessionals",
    "company": "Ministry of Water and Sanitation",
    "location": "Lilongwe",
    "description": "MINISTRY OF WATER AND SANITATION  A CALL FOR APPLICATION FOR SHORT TERM ENGAGEMENT OF  YOUNG PROFESSIONALS UNDER MALAWI RESILIENCE AND DISASTER RISK MANAGEMENT PROJECT (MRDRMP) AND MALAWI WATERSHED SERVICES IMPROVEMENT PROJECT (MWASIP)  The Government of the Republic of Malawi through the Ministry of Water and Sanitation with support from the World Bank is implementing a program to address climate change vulnerability, land, and forestry degradation, and resuscitate the delivery of watershed services which have become critical and continue to seriously affect crucial sectors such as agriculture, water and energy which have a bearing on the countrys economy. The program which involves two projects namely Malawi Watershed Services Improvement Project (MWASIP) and Malawi Resilience and Disaster Risk Management Project (MRDRMP) is being implemented through a multi-sectoral approach whereby individual project components, subcomponents and activities are implemented through relevant... Ministries, Departments, and  Agencies (MDAs). A Program Management Unit (PMU) was setup having considered the complexity and diverse nature of the project activities and putting more focus on delivery of project objectives rather that sector based.  The PMU is responsible for the overall coordination and management of the project, including planning, procurement, communication, financial management, implementation of Environmental and Social standards, and results monitoring and evaluation.  An opportunity has risen for short term (maximum 1 year) engagement of Young Professional on volunteer basis under various units within the PMU to support the implementation of project activities as this has been provided for under the two projects and build capacity of the young professionals in the country as follows.  Name of Unit  Number  Required  Requirements  1. Safeguards (Environment)  1  Degree in Environmental Engineering/ Environmental Sciences/ Natural Sciences  Proficiency in English with excellent communication skills demonstrated by an ability to express ideas clearly, logically, and effectively both orally and in writing.  Computer literate with competences in Microsoft Office and the use of Internet;  2. Safeguards (Social)  1  Degree in Social Science/ Land or Public Administration  Proficiency in English with excellent communication skills demonstrated by an ability to express ideas clearly, logically, and effectively both orally and in writing.  Computer literate with competences in Microsoft Office, and the use of Internet;  3. Monitoring and Evaluation  2  Degree in Economics or Social Science majoring in Economics  Proficiency in English with excellent communication skills demonstrated by an ability to express ideas clearly, logically, and effectively both orally and in writing.  Computer literate with competences in Microsoft Office and the use of Internet;  4. Procurement  2  Degree in Procurement, Engineering, Law, Business administration  Proficiency in English with excellent communication skills demonstrated by an ability to express ideas clearly, logically, and effectively both orally and in writing.  Computer literate with competences in Microsoft Office and the use of Internet;  5. Contract Management  2  Degree in Civil/Structural/Water Engineering  Proficiency in English with excellent communication skills demonstrated by an ability to express ideas clearly, logically, and effectively both orally and in writing.  Computer literate with competences in Microsoft Office and the use of Internet;  6.Communication  2  Degree in Communication, journalism, media for development  Basic knowledge and hands on video editing skills and graphic design  Excellent social media skills  Have journalistic skills in writing for different media, social media, website and even mainstream media;  Interested Young Professionals should provide information demonstrating that they have the required qualifications and basic skills by submitting their applications accompanied by CVs and copies of their academic qualification to the address below (in person, or by mail, or by e-mail) by 30th September 2022.  Only shortlisted candidates will be invited for interviews. Those successful will be expected to sign agreement forms stipulating conditions for engagement.  Further information can be obtained at the address below during office hours from 8.00 to 12.00; 13.00 to 16.00 hours local time (Monday to Friday, except national public holidays)  Address for the Clarification, further details and submission of the EOIs:  The Program Coordinator (Attn: The Procurement Officer),  Malawi Resilience and Disaster Risk Management Project & Malawi Watershed Services Improvement Project  Physical Address:  MRDRMP & MWASIP  Veterinary Campus  Lilongwe Old Town,  Off Kamuzu Procession Road,  Opposite Lilongwe Town Hall (at the Roundabout)  Postal Address:  Private Bag A192  Lilongwe,  Malawi.  Phone : +265 999 552 139 / 0999295433  Email : procurement.pmumw@gmail.com / gchilunga@gmail.com/ vanessachawaphiri@gmail.com"
  },
  {
    "title": "Water, Sanitation and Health Specialist",
    "company": "CCM Worldwide",
    "location": "Malawi",
    "description": "Description  -At least a Master of Science in Public Health Engineering, Master of Science in Water, Sanitation and Health Engineering or other related field  -At least 7 years experience in conducting baseline surveys for water and sanitation projects.  -S/he should have proven knowledge and experience in data collection and analysis for baseline surveys.  -S/he should have experience in working in sub-Saharan region.  -S/he should be fluent in English.  Application email or URL: https://www.developmentaid.org/jobs/view/1415457/water-sanitation-and-health-specialist?useNavigation=true"
  },
  {
    "title": "Water Resources Engineer",
    "company": "Ministry of Water and Sanitation",
    "location": "Lilongwe",
    "description": "Applications are invited from suitably qualified Malawians, Civil Servants or non-civil servants, as the case may be, depending on the requirements of the post, for the vacancies listed below existing in the Civil Service:  MINISTRY OF WATER AND SANITATION  Vac. 74/23  Post: Water Resources Engineer (Grade H)  Salary: Within the Grade H salary scale segment  Location: Ministry of Water and Sanitation  Qualifications:  Applicants should be in possession of Bachelor of Science in any of the following fields: Civil Engineering, Water Resources Engineering, water Resources Management or Hydrology, obtained from accredited institutions.  Duties:  Assisting in identification of surface water resources development projects;  Identifying and selecting new sites for dam construction;  Assisting in preparation of development project proposals for possible donor funding;  Carrying out necessary surveys for construction of small community dams and other surface water resources development... projects;  Designing small community multi-purpose dams;  Supervising construction, rehabilitation and maintenance of small community multi-purpose dams;  Supervising catchment conservation and protection works;  Assisting in preparation of budget estimates; and  Any other duties that may be assigned from time to time.  Note:  Documentary evidence of major requirements specified in the advertisement shall be required during interviews. Serving officers will also be required to demonstrate during the interviews that they are  permanent and pensionable officers in the Civil Service by producing letters of confirmation in appointment in addition to letters of condition of appointment on probation (PSR 19).  Civil Service Commission is an equal opportunity employer: All qualified individuals are welcome to apply. Interested qualified candidates should submit their applications together with copies of relevant Certificates and Curriculum Vitae to:-  The Secretary  Civil Service Commission  P.O. Box 30133  LILONGWE 3  Email: cservice@csc.gov.mw  To reach him not later than 14th April, 2023  Application email or URL: cservice@csc.gov.mw"
  },
  {
    "title": "WASH Infrastructure Specialist",
    "company": "Water For People",
    "location": "Malawi",
    "description": "Join Our Team We are HiringA. SummaryWater For People is an international non-governmental organization (NGO) that works with people and partners to develop innovative and long-lasting solutions to the water, sanitation, and hygiene problems globally. The organization strives to continually improve, experiment with promising new ideas, and leverage resources to multiply its impact.Water For People in collaboration with World vision are prospecting a US$10 million funding that will support the implementation of Water, Sanitation, and Hygiene (WASH) services for everyone in Chiradzulu District project. In preparation for this project which is planned to commence in January 2022 once funding is secured Water For People is hiring the following positionsB. WASH Infrastructure SpecialistJob SummaryThe WASH Infrastructure Specialist is responsible for providing technical support the project to ensure effective designing, planning, construction supervision of WASH infrastructure under the... project. The WASH Infrastructure Specialist is expected to provide quality assurance and quality control for the design and construction of small to medium scale WASH infrastructure, including solar powered reticulated systems in compliance with Malawi Government standards. The WASH Infrastructure Specialist will also monitor the performance and activities of the contractors working on project. The WASH Infrastructure Specialist will be reporting directly to the Project Implementation Unit Project Manager and Water For People Programme Engineer.Major ResponsibilitiesSupport in the management of contractors to ensure timely and cost-efficient completion of project worksDirectly oversee WASH infrastructure projects and activities led by sub-contractors, with majority of time spent in the field.Support production of Requests for Proposals/ Requests for Quotations/ Bills of Quantities (RFPs/ RFQs/BOQs) and provide inputs on WASH infrastructure site selection, surveys and designs, specifications, deliverables and evaluation criteria;Support the IPC (at times) to participate in bid evaluation committees to select qualified construction firms (sub-contractors) or vendors for equipment and materials;Ensure timely completion of infrastructure activities in compliance with the contract requirements, (specifications, drawings, environmental monitoring and contractual conditions)Liaise and coordinate Government water/sanitation, education and health staff and beneficiary communities in the delivery of all infrastructure interventions;Regular and timely updates to the Project Manager of the Project and the Program Engineer weekly, monthly, quarterly, and annual reports, as well as annual work plan;In liaison with the Monitoring Specialist support in annual monitoring to ensure quality data collection and results for measuring progress.Compile and submit quality project monitoring reports (monthly, quarterly or bi-annual) to the Program EngineerQualificationsBachelors degree in Civil engineering or a related fieldMust have at least 5 years proven hands on experience in engineering design, preparation of drawings, technical specifications, BOQs, tender documents & construction supervision of water infrastructure projects in WASH related activities;F. Employment ConditionsPosition is based at Water For Peoples Malawi office;Trips within and outside Malawi will be required from time to timePlease send your application letter and CV including copies of relevant certificates through email to The Country Director at [email protected] the email heading should read Senior WASH Program ManagerClosing date of application is December 13th, 2021Note: Due to the many number of applications that we normally receive shortlisting and interviews will be done on a rolling basis without waiting for the closing date. Only short-listed candidates will be contacted.  Application email or URL: malawi@waterforpeople.org"
  },
  {
    "title": "Notification of Intention to Award Contract  Supply and Delivery...",
    "company": "Blantyre Water Board (BWB)",
    "location": "Blantyre",
    "description": "Notification of Intention to Award Contract  Supply and Delivery of ranger couplings (Blantyre Water Board (BWB))  [embeddoc url=\"https://ntchito.com/wp-content/uploads/2023/11/Notification-of-Intention-to-Award-Contract-Supply-and-Delivery-of-ranger-couplings.pdf\" viewer=\"google\"]"
  },
  {
    "title": "Field Water Technician",
    "company": "Innovation: Africa",
    "location": "Malawi",
    "description": "Seeking Hard-Working, Dedicated Field Technician in Malawi  Innovation: Africa  Background  Innovation: Africa (iA) is a non-profit 501(c)(3) organization whose team of dedicated problem solvers work together to bring solar and water technologies to rural communities in Africa. We use solar energy to pump clean water and provide schools, orphanages, and medical clinics with light and refrigeration to store vaccines and medicines. iA has completed over 650 solar, water, and agricultural projects, providing light, clean water, food, and proper medical care to more than 3 million people in Ethiopia, Tanzania, Malawi, South Africa, Uganda, Cameroon, Senegal and the Democratic Republic of Congo.  Job Summary  We are seeking a highly trained and qualified individual to join our Malawi team as a Field Water Technician. The Field Water Technician works under the supervision of the Program Manager and is responsible for the operation and maintenance of iAs solar water pumping systems, as well... as providing technical support to all in-process and existing water projects. Further you will be responsible for supervising any ongoing construction works by the hired contractors. The Field Water Technician will also be responsible for all iA field activities, including identifying and selecting the beneficiaries of our projects, actively engaging in community mobilization and sensitization, establishing and maintaining regular communication with the communities we serve, implementing project-related activities, providing regular reports and ongoing monitoring of the projects.  Reports To  Program Manager  Responsibilities  Supervise the on-site work of all iA contractors, including hydrogeological surveys, drilling and pump tests, water quality analysis, and all construction and installation works related to ongoing water projects  Assess the need for maintenance work on existing water projects, identify faults and malfunctions, and provide sustainable solutions  Procure and source invoices of all approved system components to ensure organizational transparency and identification of reliable vendors with high quality, cost effective, items  Ensure that all the completed water projects are fully functional and report any issue which arises among the projects  Conduct effective community technical training and sensitization to all iA water beneficiaries, including establishing project steering committees  Maintain regular contact with iAs engineers based in the Mangochi office and in Israel to successfully implement and monitor new solar water technologies and remote monitoring systems  Establish and manage relationships and communication with local, national, and international stakeholders  Install and maintain water supply system equipment including pumps, taps, solar panels and controls units of iA solar water pumping systems  Coordinate scheduled maintenance and work directly with contractors should larger issues arise  Ensure that all water supplied to beneficiaries meets quality standards  Monitor and ensure adequate stock of spare parts is always available and provide lists of periodic requirements  Participate in technical implementation of all solar electrification system implementation  With support from the Program Manager or the Electrical Engineers, assess needs for maintenance work (post-project completion) in projects where a malfunction exists  Oversee all field operations related to solar powered projects, including prospective project search, solar project installation, and monitoring and evaluation  Work closely with the local contractor to plan and design all solar electrification systems  Submit daily updates through the iA phone application and send regular progress reports to international management team regarding prospective projects, construction and implementation of current projects, and monitor existing projects  Office work  filling forms, submitting reports, taking pictures and uploading them, answering emails  Manage and fully participate in visits from the international team, donors and guests  Represent Innovation: Africa at the community and government level at all relevant forums and meetings  Respond to any communication such as emails, Whatsapp or Slack within a timely manner (24 hours)  Executing any other task required by the Program Manager and international team according to the work plan  Qualifications  The ideal candidate is a dedicated team-player with strong interpersonal skills who has a background in water engineering, community development and mobilization, and working with international stakeholders. The candidate must demonstrate a proven passion for working with the community and possess detail orientation and problem-solving skills.  Compensation  Commensurate with experience.  Requirements  Bachelors Degree or professional diploma in Electrical or Water Engineering or closely related field, Masters degree preferred  Technologically oriented with excellent computer skills, including proficiency in email and Microsoft Office software  At least 3 years of working experience in implementations of rural water systems  Drivers license  Ability to commit to flexible working hours  Live and speak the local language(s) of Mangochi Region  High proficiency in English and Chichewa; both writing and speaking  As an international organization, our team works in New York, Israel, and Africa, and is constantly on the move. To maintain close contact despite our travel schedules, we regularly use technology solutions, such as Slack, Zoom and more. The ideal candidate thrives in this type of fast paced environment and is comfortable working with colleagues in different time zones and continents.  Application Instructions  Please send your cover letter and CV as a single PDF attachment to mw.technician@innovation-africa.odoo.com (please note that we can only accept applications that are sent in PDF format)  The file name should be saved as your full name.  Please include the position and country for which you are applying to work in the subject line of the email Field Water Engineer in Cameroon  Female candidates are encouraged to apply.  Innovation: Africa is an equal opportunity employer, dedicated to inclusivity, a diverse workforce and valuing difference. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.  Application email or URL: mw.technician@innovation-africa.odoo.com"
  },
  {
    "title": "Effluent Plant Operator",
    "company": "Sunseed Oil Limited",
    "location": "Lilongwe",
    "description": "Overview  SUNSEED OIL LIMITED  Effluent Plant Operator  Duties  Maintain and operate waste water treatment plant  Tends pumps, conveyors, blowers, vacuum filters and other equipment used to treat waste water.  monitor the processes that removes, adds treatment substances into the plant systems  Control equipment, reads meters and other gauges to make sure plant is working properly.  Skills  Good knowledge in operating machinery that converts waste water into a form that is safe to release into the environment.  Qualification  MSCE plus relevant Plant Operation Certificates.  Method of Application  Interested candidates should send their application letters together with their updated CVs through post to:  The Human Resources Manager, Sunseed Oil Limited, P. O. Box 748, Lilongwe.  Or through email: hrm@sungroupmw.com  Closing Date : 19th August, 2022.  Only shortlisted applicants will be acknowledged.  Application email or URL: hrm@sungroupmw.com"
  },
  {
    "title": "WASH Project Officer",
    "company": "Water For People",
    "location": "Chiradzulu",
    "description": "Join Our Team  We are Hiring  A. Summary  Water For People is an international non-governmental organization (NGO) that works with  people and partners to develop innovative and long-lasting solutions to the water, sanitation, and hygiene problems globally. The organization strives to continually improve, experiment with promising new ideas, and leverage resources to multiply its impact.  Water For People in collaboration with World Vision Malawi are implementing a US$10  million funding that will support the improvement of Water, Sanitation, and Hygiene (WASH) services for everyone in Chiradzulu District. As part of the Project Implementation, Water For People now intends to recruit a Project Officer to be part of the Project Team.  B. WASH Project Officer (1)  The WASH Project Officer is responsible for the day to day implementation of the project.  Major Responsibilities  Ensure effective delivery all annual WASH targets  Liaise with Chiradzulu District Council Coordinating Team... in planning and tracking  progress towards achievement of project objective as outlined in the Multiyear  Operational Plans (MOP).  Collaborate with and other relevant government department in the dissemination of  information related to water, sanitation and hygiene and development of IEC materials  to assist in the promotion of water supply management, sanitation, and hygiene.  Collaborate with District Councils and District Health Office in facilitating demand  creation activities for improved sanitation.  Lead teams in conducting Knowledge, Attitude and Practices (KAP) surveys including  willingness to pay and customer satisfaction surveys in all targeted areas.  Work closely with Councils in identifying, training and mentoring Water Point  Committees and other management committees on sustainable water and sanitation  management.  Facilitate strong and sustainable linkages between District Councils, water supply  scheme management committees, and expert service providers to enhance sustainable  management of water systems.  Work closely with local implementing partners (NGOs, private sector, and CBOs) in the  targeted areas to enhance the efficiency and effectiveness in the implementation of  programme activities.  Participate and ccontribute in the development of Joint Action Plans and Reviews of  interventions in the target areas with other district stakeholders  Lead the development/review of training manuals, checklists, and advanced monitoring tools on water scheme which enhance scheme performance, monitoring, reporting, and data management.  In liaison with other project staff, participate actively in development of Monitoring and Evaluation plan for Water, sanitation, and hygiene component of the program in project area.  Major Responsibilities  Qualification and experience  A minimum of bachelors degree in Social Science, Environmental Health, Water Resources management and Development, Civil Engineering, or related field is preferred.  Over 3 years of experience in water and sanitation projects working in partnership with  NGOs and private sector is necessary.  Knowledge, Skills, Ability  The following are important  Demonstrated success in project implementation.  A good understanding of the requirements in the implementation, monitoring,  evaluation, and reporting of international grant funds; its effectiveness and accountability  Must be flexible, able to work under tight deadlines and have excellent follow through  skills. Be a self-starter and work with limited supervision.  Excellent verbal/written communications and presentation skills and good analytical  skills  Experience and Knowledge of Development work related issues in Malawi.  Competent in use of MS Word, Excel, and a statistical analysis program (preference for  SPSS or Access)  C. Employment Conditions  Position is based at Water For Peoples Malawi office;  Trips within and outside Malawi will be required from time to time  Please send your application letter and CV including copies of relevant certificates through  email to The Country Director at [email protected] The email heading should read Project Officer  Churadzulu  Closing date of application is 11th November, 2022.  Application email or URL: malawi@waterforpeople.org"
  },
  {
    "title": "Project Officer",
    "company": "Water Witness",
    "location": "Blantyre",
    "description": "Are you passionate about driving transformative change in water security and community adaptation within the dynamic landscape of climate change? Water Witness Malawi is seeking visionary individuals to join our team as Project Officer, contributing to innovative initiatives aimed at enhancing water security and inclusion in Malawi  Background  Water Witness leads action, research, and advocacy for a fair water future where all people can access the water needed to thrive, and are protected against floods, drought, pollution, ecosystem degradation and water conflict.  We stand with those at the sharp end of the global water crisis to shine a light on its impacts, to understand its root causes and to activate an effective response. We work with inspirational local partners to trigger social justice and system change to ensure sustainable management and equitable use of the worlds most precious resource.  Over the past decade our team have been on the frontline: working to improve... water security for over 1 million vulnerable people, driving improved policy, practice, and investment, building new approaches and communities of practice, and holding duty bearers to account for improved performance on water. Our hands-on field experience is backed up by cutting-edge research and global analyses, and this provides us with a clear understanding of the action needed to deliver on the water-related Sustainable Development Goals.  Our new 2030 strategy builds on our track record as a dynamic NGO which unlocks improved water resource governance and water security for vulnerable communities. In the decade ahead we will work with our partners to focus on the following five imperatives:  1. Accountable governance: to implement effective and equitable water policy and law.  2. Progressive financing: to unlock funding and financial incentives for water security.  3. Redefining corporate responsibility: to transform private sector behaviour for shared water security.  4. Confronting climate chaos: to prevent catastrophic water shocks and build resilience.  5. Activating people power: to trigger political, social, and economic change for water security.  Water Witness is now seeking an exceptional individual to join our team in Malawi with the skills and experience to assist in the delivery of our exciting water projects  The Role  Job Title: Project Officer (PO)  Place of Work: Blantyre, Malawi  Pay: Commensurate with experience  Reports to: International Programme Manager  Travel: Occasional periods of travel in Tanzania  Term: 3 years, extension subject to performance and funding  Job Summary and Purpose  The Project Officer will play a crucial role in the successful delivery of our exciting water projects and contribute to the overall achievements of Water Witness Malawi. S/he will be responsible for coordinating and supporting project activities, ensuring smooth execution, which contribute to the achievement of WW Malawis objectives. S/he will collaborate closely with team members, stakeholders, and community partners to promote water security, foster behavioural adaptation, and enhance inclusivity in water management practices.  This position involves assisting in the design, planning, and execution of our interventions aimed fostering and researching behavioural changes among stakeholders, communities, and individuals to promote sustainable water practices. Working closely with the multi-country project team, the Project Officer will support the implementation of community behaviour-change interventions and action research aimed at enhancing water security while ensuring the inclusion of marginalized groups in decision-making processes.  The role involves delivering community interventions and local and national-level influencing, tracking project progress, monitoring outcomes, and conducting regular assessments to gauge the projects effectiveness and identify opportunities for improvement. Through proactive engagement with partners, beneficiaries, and relevant authorities, the Project Officer will contribute to building resilient water systems that can adapt to changing environmental conditions and ensure equitable access to water resources for all. This role demands a strong commitment to sustainability, innovation, and community engagement, as the project aims to address pressing water-related challenges and create positive impacts on vulnerable communities.  As the Project Officer, you will be instrumental in advancing water security and inclusivity, promoting behavioural shifts, and leaving a lasting positive impact on communities and the environment. As an important team player in WW Malawi, you will contribute to important research into climate adaptation behaviours in Africa. If you are that dynamic individual with a high level of integrity, accuracy, and attention to detail in their work with the qualifications, experience, energy, and confidence to evolve our dynamic NGO as a widely recognized agency working for you!!  Duties and responsibilities  The Project Officer is responsible for the smooth day-to-day functioning of the WW Malawi, contributing to the achievements of its overall objectives.  1. Project Planning and Coordination:  Assist in the development of project plans, timelines, and milestones for WW Malawi projects and programmes.  Coordinate project activities, ensuring effective communication and collaboration among team members, stakeholders, and partners.  Monitor project progress, track deliverables, and ensure adherence to project schedules.  Identify and address potential risks, challenges, and issues that may impact project implementation.  2. Research and Analysis  Support the research team in conducting studies, surveys, and data collection related to climate adaptation, behaviour, and resilience.  Assist in data analysis, interpretation, and preparation of research reports, ensuring accuracy and quality.  Contribute to the identification of gaps in knowledge and emerging trends in climate adaptation and resilience.  Stay updated with relevant literature, research findings, and best practices in the field.  3. Stakeholder Engagement  Collaborate with stakeholders, including community groups, government agencies, NGOs, and private sector organizations, to foster partnerships and engagement.  Organize and facilitate meetings, workshops, and consultations to gather input, feedback, and insights from diverse stakeholders.  Promote inclusivity in decision-making processes, ensuring the perspectives of marginalized communities and people who are marginalized within those communities (through age, gender disability etc) are considered.  Communicate project objectives, outcomes, and progress to stakeholders through presentations, reports, and other communication channels.  4. Capacity Building and Knowledge Sharing  Support the development, delivery and follow up of training programs and capacity-building initiatives on climate adaptation and resilience.  Assist in the creation of educational materials, toolkits, and resources to enhance understanding and awareness of climate-related challenges.  Facilitate knowledge sharing among project partners, stakeholders, and beneficiaries through workshops, webinars, and conferences.  Contribute to the dissemination of research findings and project outcomes through publications, presentations, and social media platforms.  5. Monitoring and Evaluation  Establish monitoring and evaluation frameworks to assess the effectiveness and impact of project activities.  Collect and analyse relevant data to measure project outcomes and progress towards established goals.  Prepare regular progress reports and contribute to project evaluations and impact assessments.  Identify lessons learned and recommend improvements for future projects and initiatives.  6. Programme Administration and Communication  Work closely with the Programme Support Officer to monitor spend against budget, ensuring budget lines are not exceeded.  Work closely with the Programme Support Officer to ensure project and programme spend is correctly allocated.  Manage Information and Communications across the organization.  Supply digital content (blogs, stories, photos, case studies, testimony etc)  Key working relationships and logistical arrangements  The successful applicant will join a growing team of professionals based at Water Witness Malawi offices in Blantyre. S/he will report to the Country Manager and will work closely with the team to ensure high impact delivery.  Person Specification  The successful applicant will be able to demonstrate the following:  Experience and qualifications:  Essential   Bachelors or Masters degree in a relevant field such as environmental science, climate studies, sustainable development, or a related discipline.   Minimum of three (3) years relevant experience   Demonstrated experience in project planning and coordination, preferably in the context of research or climate change adaptation.   Experience in the use of monitoring and evaluation frameworks and methodologies.   Experience in grant management and reporting.   Experience in organizing and conducting workshops and training successfully.   Experience in accurate data collection and analyses.   Experience of working in or with NGOs/CSOs projects.   Strong understanding of climate change issues, resilience, and social inclusion concepts.   Demonstrable experience in data analysis and interpretation using relevant software tools.  Desirable   Risk analysis and risk management experience.   Experience of events management.  Skills and attributes:  Essential   Effective and inspirational individual with strong collaboration skills.   Effective oral and written communication and interpersonal skills for engaging with diverse stakeholders, training, reporting. Fluent in spoken and written English and Chichewa language.   Highly numerate and able to produce accurate work to tight deadlines.   Extremely well organised with excellent planning and prioritisation skills to be able to produce high-quality work, deliver events and manage a wide-ranging and complex workload.   Self-motivated person, able to think strategically, with strong analytical/problem solving skills and can take initiative.   Excellent organizational skills with the ability to multitask, prioritize, and meet deadlines.   IT literate and excellent knowledge and skills in using QuickBooks and Microsoft Excel and Word packages.   Able to work effectively both without close supervision and as part of a multidisciplinary team.   Trustworthy, able to maintain confidentiality, deal with sensitive information and to take responsibility for important operational functions.   Willing to work additional hours at crucial times.  Desirable   Understanding of behavioural and psychological science  How to apply  All correspondence should be sent to jobs@waterwitness.org with PO  WW Malawi in the subject line. Please provide a CV and cover letter in ONE single document. The cover letter should be no more than two pages long, must explain why you want to work in this position, and should clearly set out how your skills and experience match the profile described in the job description. The CV should be no more than three pages long and should include the email addresses and telephone numbers of two referees.  Applications which do not meet these specifications will not be considered.  Timeline  Closing date: 17:00h BST, 12th December 2023  Selection day and final panel interviews: 18-21st December 2023 (To be confirmed)  Expected start: January 2024  Equality Statement  Equality and respect for diversity are at the core of WWIs values. Staff are expected to work collectively and individually to promote a constructive and sensitive approach to others from a variety of backgrounds, where the work of others is valued and respected. Please let us know if you need any assistance in making your application or if you have any special requirements should you be selected for an interview. On this occasion only people with the right to work in Malawi should apply.  Selection Process  Only shortlisted candidates will be contacted. Please assume that you have not been shortlisted if you have not heard from us within 10 working days of the closing date. Shortlisted candidates may be required to undertake an additional assessment prior to the interview.  Queries  If you have any queries on any aspect of the appointment process, need additional information, or would like to have an informal discussion, please email jobs@waterwitness.org in the first instance"
  },
  {
    "title": "WASH Manager",
    "company": "WaterAid",
    "location": "Lilongwe",
    "description": "WaterAid is an international development organization that is working to transform the lives of vulnerable communities with safe water, sanitation and hygiene (WASH). WaterAids vision is of a world where everyone has access to safe water, sanitation and hygiene. We believe that sustainable development cannot be achieved in Malawi without the attainment of rights to WASH for all. By 2030, we want everyone in Malawi to have clean water, decent sanitation and good hygiene. WaterAid is working in consortium with CARE International in Malawi which has been awarded a cooperative agreement from the U.S. Agency for International Developments office of Food for Peace (USAID/FFP), to implement a five-year Development Food Security Activity (DFSA) to improve and sustain the food and nutrition security of vulnerable populations in Zomba and Mangochi Districts. The project will work at the individual, household, community and institutional levels to address the underlying causes of food... insecurity and strengthen transformative opportunities. This includes a focus on improving food access and incomes through agriculture and other livelihoods initiatives; enhancing natural resource and environmental management; combating under-nutrition, especially for children under two and pregnant and lactating women; and mitigating disaster impact through early warning and community preparedness activities. The project which is called Titukulane is intended to strengthen resilience in populations vulnerable to acute chronic hunger and recurrent shocks, stresses, and crises, and to reduce future need for ongoing or emergency. The consortium includes Save the Children, Emmanuel International, WaterAid, NASFAM, and IFPRI as well as other associated organizations. Working with CARE and other consortium partners, WaterAid is providing technical leadership on water, sanitation and hygiene (WASH) which is key to combating under-nutrition. Integrated WASH Interventions will lead to more households and health care facilities practicing improved hygiene behaviours as well as having at least basic access to safe water and improved sanitation facilities which are sustainably managed. Under the Titukulane Project, WaterAid is looking for an experienced individual to play a vital role in contributing towards Titukulane project objectives and WaterAids overall mission in Malawi. This a 2-year tenure role and is based in Zomba. Position: WASH Manager The WASH Manager will be based at the project management unit (PMU) in Zomba. He/she will be reporting to the WaterAid Head of Programmes with additional oversight from CAREs Food Security Technical Coordinator. The WASH Manager will be responsible for providing technical leadership for WASH interventions to achieve the Titukulane Project purpose. This will include overall refinement, coordination, management, compliance and reporting of the WASH component of the Titukulane Project. This role is also responsible for setting, achieving and maintaining quality standards in the delivery of the project in collaboration with WaterAids SBCC, M&E and WASH Governance Specialists. This role will ensure that WaterAid maintains functional working relationships with all consortium partners for the successful implementation of the Titukulane Project at national and district levels. Specifically, the WASH Manager will be responsible for the following: 1. Programme Planning, Development and Management Lead in programme refinement, implementation, monitoring and evaluation of the WASH component of the Titukulane Project and ensure and monitor its contribution to Country Programme strategic objectives. Provide sound technical and institutional advice to consortium partners for effective delivery of planned water, sanitation and hygiene interventions to the targeted communities in Zomba and Mangochi districts and at national level Lead annual planning and budgeting processes and regular budget performance monitoring for the WASH component of Titukulane Project in line with contractual agreement with CARE Lead WaterAid Titukulane Project team in the preparation of concise project reports and contribute to the production of WaterAid Malawi Country Programme reports. Ensure an integrated way of working with consortium partners within the Titukulane Project through joint development of clear working modalities for technical support, information sharing and support Lead WaterAid Titukulane Project team in ensuring compliance to WaterAids quality programme standards and Titukulane Project quality requirements including financial management Contribute towards ensuring that the Titukulane Project WASH component has functional M&E frameworks and complies with CARE and WaterAids PMER core procedures 2. Contracts Management Work with the WaterAid Head of Programmes and Head of Resource Mobilisation and Grants to develop and maintain healthy relationships with CARE and other consortium members Ensure WASH interventions in the Titukulane Project comply with all relevant donor requirements and contractual obligations in line with agreement with CARE 3. Partnerships, Collaboration and Networking With support from WaterAid SMT ensure that WaterAid maintains good working relationships with all consortium partners within the Titukulane Project Lead the WaterAid Titukulane Project team to establish, develop and maintain relationships with other agencies working in the water and sanitation, health, nutrition and education sectors, academia, media and research institutions, donors and officials of the Malawian government at national, regional and district levels in line with the Titukulane Project objectives Collaborate with other technical leads and teams to represent the Titukulane Project and build and maintain relations with any other relevant individuals and institutions. 4. Leadership & People management Lead the recruitment of staff with requisite skills in the Titukulane Project Ensure effective performance management of staff in the programme, development of team and individual skills and capacity in line with the Titukulane Project demands Ensure that all staff and partners adhere to WaterAids safeguarding policies To be successful, youll need: A Masters Degree in Development Planning, Development Studies from a recognized University, or professional qualifications in civil engineering, water and sanitation, environmental and or public health. In addition, he or she must have at least Minimum of five years experience in programme planning, development and management at managerial level Prior experience working on US government grants and/or cooperative agreements as well as knowledge of their rules and regulations will be a great asset. Proven experience in water and sanitation work in the Malawian context. Understanding of rural and urban WASH programme and policy contexts Developing and managing projects including staff, budgeting and budget management. Experience in implementation of integrated programmes as part of a consortium Experience in leading development of models and approaches and packaging learning Experience of development and management of partnerships Experience of working in matrix relationships will be an added advantage How to apply Interested applicants should send their current CV with names of their three most recent referees and a motivation letter to Email: [email protected] by 22nd May 2020. WaterAid is committed to ensuring that wherever we work in the world there is no tolerance for the abuse of power, privilege or trust. WaterAid reinforces a culture of zero tolerance towards any form of inappropriate behaviour, abuse, harassment, or exploitation of any kind. The safeguarding of our beneficiaries, staff, volunteers and anyone working on our behalf, is our top priority, and we take our responsibilities extremely seriously. All staff and volunteers are required to share in this commitment through our Global Code of Conduct.  Application email or URL: recruitmentmw@wateraid.org"
  },
  {
    "title": "Groundwater Development Officer",
    "company": "Ministry of Water and Sanitation",
    "location": "Lilongwe",
    "description": "Applications are invited from suitably qualified Malawians, Civil Servants or non-civil servants, as the case may be, depending on the requirements of the post, for the vacancies listed below existing in the Civil Service:  MINISTRY OF WATER AND SANITATION  Post: Groundwater Development Officer (Grade I) Salary  Within the Grade I salary scale segment  Location : Ministry of Water and Sanitation  Qualifications:  Applicants should be in possession of Bachelors degree in any of the following fields: Earth Science, Hydrogeology, Geology, Mathematical Engineering, water Resource Management, Mathematics, Geography and Mechanical Engineering, obtained from accredited institutions.  Duties:  Carrying out geophysical surveys for borehole construction for large and small scale ground water developments activities;  Carrying out pumping tests for groundwater assessment development and borehole design and for sustainable groundwater resource usage and appropriate designs;  Supervising borehole... drilling activities and well logging;  Conducting inventory of all technical equipments used in the section; and  Carrying out consultancy on groundwater development activities.  Note:  Documentary evidence of major requirements specified in the advertisement shall be required during interviews. Serving officers will also be required to demonstrate during the interviews that they are permanent and pensionable officers in the Civil Service by producing letters of confirmation in appointment in addition to letters of condition of appointment on probation (PSR 19).  Civil Service Commission is an equal opportunity employer: All qualified individuals are welcome to apply. Interested qualified candidates should submit their applications together with copies of relevant Certificates and Curriculum Vitae to:-  The Secretary  Civil Service Commission  P.O. Box 30133  LILONGWE 3  Email: cservice@csc.gov.mw  To reach him not later than 14th April, 2023  Application email or URL: cservice@csc.gov.mw"
  },
  {
    "title": "Water Quality Specialist",
    "company": "Innovation: Africa",
    "location": "Mangochi",
    "description": "Seeking a Full Time Water Quality Specialist for Innovation: Africas Mangochi, Malawi Office  Background  Innovation: Africa (IA) is a non-profit 501(c)(3) organization with a team of dedicated problem solvers with a mission to bring solutions and know-how to those in need living in rural African villages. We use solar energy to pump clean water and provide schools, orphanages and medical clinics with light and refrigeration to store vaccines and medicines. IA has completed over 700 solar and agricultural projects, providing light, clean water, and proper medical care to more than 3,5 million people in Ethiopia, Tanzania, Malawi, South Africa, eSwatini, Uganda, Cameroon, Zambia, Senegal, and the Democratic Republic of Congo.  Job Summary  Our dynamic, growing organization seeks a Water Quality Specialist to join our team based in Mangochi, Malawi. The position entails implementing and overseeing a comprehensive water quality monitoring and treatment program for all existing and... future water projects, as well as working closely with the Engineering and Africa Programs departments at headquarters in Israel.  Reports To  Country Manager (Local Office), Head Water Quality Specialist (HQ)  Requirements  Sc./M.Sc. in science-related discipline such as Environmental Sciences, Hydrology, (Geo/Bio) Chemistry, Biology, or Microbiology  Advanced knowledge of water quality control and quality assurance principles and practices  Advanced knowledge of environmental regulations, health & safety regulations, water industry and technologies  Knowledge of general principles and procedures of water treatment and distribution  Experience working in or with water testing laboratories  Experience with field laboratory equipment and field sampling  Proficiency in data science and using Microsoft Excel  Drivers license and off-road driving experience  Ability to commit to flexible working hours  Strong organizational skills  ability to multi-task and keep track of the water quality status and results for dozens of projects at once  Strong communication skills, a team player  High proficiency in English; both writing and speaking is a must and regional dialects in any two or three of such languages in the areas that we serve will be an added advantage  Responsibilities  Conduct field sampling and analysis; coordinate and participate in the collection, interpretation, and evaluation of water quality data.  Operate and troubleshoot analytical equipment and instrumentation.  Assist in coordinating laboratory services, collecting and processing samples, using equipment, managing supply inventory and on-going maintenance.  Research and implement applicable off-grid water treatment solutions.  Understand trends and patterns and assess compliance with regulatory standards and potential risks to consumers.  Visit sites of concern and carry out training of local staff on how to identify potential sources of pollution or contamination, and sources of complaints about drinking water quality.  Perform administrative duties where necessary for monitoring program managers to ensure timely completion of workloads.  Compensation  Commensurate with experience.  Application Instructions  Please send your cover letter and CV as a single PDF attachment to mw.wqs@innovation-africa.odoo.com (please note that we can only accept applications that are sent in PDF format) Please make the file name your full name.  As an international organization, our teams are spread out between the USA, Israel and Africa, and team members are constantly on the move. We strive to use technological solutions to keep our staff in close contact, despite busy travel schedules. To ensure our operations run smoothly, we keep close communication via phone, Zoom, WhatsApp, Slack and more. This position requires the ability to keep up with this fast-paced environment, and to be comfortable working with colleagues across time zones and continents.  Application email or URL: mw.wqs@innovation-africa.odoo.com"
  },
  {
    "title": "Hydrological Officer",
    "company": "National Water Resources Authority",
    "location": "Lilongwe",
    "description": "The National Water Resources Authority (NWRA) is a statutory organization established by the Water Resources Act of 2013 with a specific function to regulate and manage water  resources. Furthermore, the NWRA seeks to ensure the sustainable use of water resources  and address the water resources planning, development and management challenges.  In its effort to sustainably manage water resources, the NWRA seeks to recruit energetic,  highly motivated, focused and result-oriented individuals to form part of its NWRA members of staff. In this regard, NWRA invites applications from suitable qualified and experienced persons to fill the following vacant position:  Job Title: Hydrological Officer  Department: Water Resource Management and Development  Grade: NW5  Reporting to: Senior Hydrological Officer  Purpose of the Job  To administer, coordinate programs and activities relating to surface water resources management and conservation.  Key Duties and Responsibilities  Apply research... findings to help minimize the environmental impacts of pollution, water-borne diseases, erosion, and sedimentation.  Compile and evaluate hydrologic information.  Conduct research and communicate information to promote the conservation and preservation of water resources.  Design and conduct scientific hydrological investigations to ensure that accurate and appropriate information is available for use in water resource management decisions.  Evaluate research data in terms of its impact on issues such as still and water conservation, flood control planning, and water supply forecasting.  Measure and graph phenomena such as lake levels, stream flows, and changes in water volumes.  Study and document quantities, distribution, disposition, and development of underground and surface waters.  Study public water supply issues, including flood and drought risks, water quality, wastewater, and impacts on wetland habitats.  Collect and analyze water samples as part of field investigations and/or to validate data from automatic monitors.  Carryout modelling on surface and water catchment;  Install, maintain, and calibrate instruments such as those that monitor water levels, rainfall, and sediments.  Prepare hydrological evaluations of known or suspected hazardous waste sites and ; land treatment and feedlot facilities.  Review applications for site plans and permits, and recommend approval, denial, modification, or further investigative action.  Minimum Qualifications and Work Experience  Bachelor of Science Water resource management or Engineering or any water related field  Minimum of four (4)years work experience on a similar position within a major hydrologic unit, government department or a utility providing institution. Those with experience in water resources modelling will have an added advantage.  Additional Skills and Abilities  Self-starter, responsible and good communication skills  A team player  Should have undergone training in hydrology environmental and social impact assessment  Analytical and problem solving skills  Computer knowledge in GIS and MS packages  Able to work long hours with minimal supervision  The NWRA is an equal opportunity employer. Therefore, male and female persons including  persons with disabilities, who meet the prerequisite qualifications and experience are encouraged to apply.  An attractive remuneration package comprising a competitive salary and benefits will be offered to the successful candidates. The NWRA also offers excellent career development  opportunities.  Interested persons should submit their application with up-to-date detailed curriculum vitae (CV) including names and addresses of three traceable referees, to reach the undersigned not later than the 18th November, 2022  Only complete applications will be considered  All late applications shall not be considered.  The Executive Director,  National Water Resources Authority,  TAURUS House,  Private Bag 363, Lilongwe 3.  You can also send your application through email below:  [email protected]  Copy: [email protected], dwightk[email protected]  Application email or URL: Bandayvone3@gmail.com"
  },
  {
    "title": "Water Resources Engineer",
    "company": "H.E Jackson Engineering Ltd",
    "location": "Lilongwe",
    "description": "Designing and construction of water supply systems, project management of complex projects, Enhancing team work skills, Development of climate resilient water supply systems.  Application email or URL: https://www.linkedin.com/jobs/view/3330598905/?alternateChannel=search&refId=Gn4B6Lh5OrT4I8tmjpO57g%3D%3D&trackingId=ZixCrU9P1aqQuzGOtz4siA%3D%3D&trk=d_flagship3_search_srp_jobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_search_srp_jobs%3BWEZ4ojcCSj2IuKYWTVyCoQ%3D%3D"
  },
  {
    "title": "Director of Water Resources Management and Development",
    "company": "National Water Resources Authority",
    "location": "Lilongwe",
    "description": "The National Water Resources Authority (NWRA) is a statutory organization established by the Water Resources Act of 2013 with a specific function to regulate and manage water resources. Furthermore, the NWRA seeks to ensure the sustainable use of water resources and address the water resources planning, development and management challenges.  In its effort to sustainably manage water resources, the NWRA seeks to recruit energetic, highly motivated, focused and result-oriented individuals to form part of its executive management.  In this regard, NWRA invites applications from suitably qualified and experienced persons to fill the following vacant positions:  Post: Director of Water Resources Management and Development  Grade: NW 2  Reporting to: Executive Director  Responsible for: Surface Water Manager, Groundwater Manager and Water Quality Manager  Purpose of the Job:  To lead in management and development activities of the water resources and catchments across the country.  KEY... DUTIES  a) Developing Directorates plans, programmes, projects and budgets based on priorities within resources allocated.  b) Formulating, implementing and monitoring short-term and long-term water resource Management and development operation strategies.  c) Taking lead in the development of water resource technical specifications including safety, environmental and quality standards for the existing and potential investors.  d) Responsible for resource mobilisation for the institution in liaison with the Director of Corporate Services through provision of technical guidance that will help NWRA increase its revenue base.  e) Lead in the establishment and management of the catchments  f) Developing and implementing monitoring mechanisms to ensure sustainability of water  resources quality and quantities.  g) On delegation from the Executive Director represent the NWRA in forums dealing with technical matters relating to the management and development of the water resources.  h) Analysing inspection reports on new and existing players in water resource management and development and recommending appropriate action to management.  i) Monitoring, evaluating and certifying installation of water equipment and infrastructure.  j) Monitoring and evaluating the efficiency and performance of water sub sectors in meeting agreed standards.  k) He/she will be liaison officer between the Kamuzu Barrage, Stakeholders and the Executive Director.  l) Identifying risks associated with water resources management and development and propose measures to management on how to address them.  m) Lead in enforcement of performance management system (PMS) within the Directorate.  MINIMUM QUALIFICATIONS AND EXPERIENCE  Masters Degree in Water Resource management, Engineering or Related field.  Minimum of five (5) years experience at Managerial position in Water Resources Management.  Experience in setting up and managing structures, systems, processes, procedures and regulations that aid sustainable management of water resources.  Demonstrable Resource Mobilisation and Utilization background.  An appreciation and understanding of how budgets are developed, monitored and controlled.  Registered Water Engineers will have an added advantage.  DESIRED QUALITIES  Demonstrate strong leadership, team building and management skills.  Familiar working with any trending water resource based models  Demonstrate Project Management Skills  Demonstrate problem solving and analytical skills  Strong networking and collaboration skills  Ability to work in a multi-cultural and multi-discipline environment  Good communication skills both oral and written  Good understanding of relevant laws and office procedures  Attention to detail  Integrity, honesty and confidentiality  The NWRA is an equal opportunity employer. Therefore, both male and female persons including persons with disabilities, who meet the prerequisite qualifications and experience are encouraged to apply.  An attractive remuneration package comprising a competitive salary and benefits will be offered to the successful candidates.  The NWRA also offers excellent career development opportunities.  Interested persons should submit their applications, vision statements for the position, up-to-date detailed curriculum vitae (CVs) including names and addresses of three traceable  referees and certified copies of certificates to the address below not later than the 18th November, 2022. Those who previously applied are encouraged to re-apply.  Shortlisting of candidates will be based on the quality of the documents that will be received from the applicants and their responsiveness to the requirements. All late applications shall  not be considered.  The Comptroller of Statutory Corporations  Department of Statutory Corporations  P. O. BOX 30061, LILONGWE 3.  Only shortlisted candidates will be acknowledged"
  },
  {
    "title": "Water Quality Technician",
    "company": "Southern Region Water Board",
    "location": "Zomba",
    "description": "Applications are invited from suitably qualified candidates to fill the following vacant positions tenable at various establishments of Southern Region  Application email or URL: https://www.alljobspo.com/url.php?id=aHR0cHM6Ly9qb2JtYWxhd2kubmV0L2pvYi93YXRlci1xdWFsaXR5LXRlY2huaWNpYW4v"
  },
  {
    "title": "Project Manager  Climate Just Communities",
    "company": "Water Witness",
    "location": "Blantyre",
    "description": "Are you passionate about driving transformative change in water security and community adaptation within the dynamic landscape of climate change? Water Witness Malawi is seeking visionary individuals to join our team as Project Manager, contributing to innovative initiatives aimed at enhancing water security and inclusion in Malawi  Background  Water Witness leads action, research and advocacy for a fair water future where all people can access the water needed to thrive, and are protected against floods, drought, pollution, ecosystem degradation and water conflict.  We stand with those at the sharp end of the global water crisis to shine a light on its impacts, to understand its root causes and to activate an effective response. We work with inspirational local partners to trigger social justice and system change to ensure sustainable management and equitable use of the worlds most precious resource.  Over the past decade our team have been on the frontline: working to improve water... security for over 1 million vulnerable people, driving improved policy, practice and investment, building new approaches and communities of practice, and holding duty bearers to account for improved performance on water. Our hands-on field experience is backed up by cutting-edge research and global analyses, and this provides us with a clear understanding of the action needed to deliver on the water-related Sustainable Development Goals.  Our new 2030 strategy builds on our track record as a dynamic NGO which unlocks improved water resource governance and water security for vulnerable communities. In the decade ahead we will work with our partners to focus on the following five imperatives:  1. Accountable governance: to implement effective and equitable water policy and law.  2. Progressive financing: to unlock funding and financial incentives for water security.  3. Redefining corporate responsibility: to transform private sector behaviour for shared water security.  4. Confronting climate chaos: to prevent catastrophic water shocks and build resilience.  5. Activating people power: to trigger political, social and economic change for water security.  Having secured funds to deliver the Climate Just Communities (CJC) programme under the Scottish Governments Climate Justice Fund, which supports locally led community projects in Malawi. CJC will take a participatory approach to developing and delivering climate justice interventions that tackle inequalities exacerbated by climate change and build community resilience to the material and social effects of climate change. Therefore, Water Witness is now seeking an exceptional individual to join our team in Malawi with the skills and experience to manage the delivery of the CJC programme.  The Role  Job Title: Project Manager (PM)  Place of Work: Blantyre, Malawi  Pay: Commensurate with experience  Reports to: WW Malawi Representative/Director  Travel: Majority time involved in delivery of project in Chikwawa.  Term: 2 years, extension subject to performance and funding  Job Summary and Purpose  The Project Manager holds a pivotal position within Water Witness Malawi, tasked with orchestrating the successful delivery of the CJC project while contributing significantly to the organizations broader objectives. This exciting role is multifaceted, encompassing coordination of project activities and ensuring their alignment with WW Malawis goals. Operating at the nexus of community empowerment and climate change resilience, the Project Manager collaborates closely with diverse stakeholders to foster resilient communities adept at navigating climate challenges.  The Project Manager will serve as the key player in project design, planning, and execution. Significantly, this role involves spearheading engagements with partners, stakeholders, and communities while supporting the implementation of interventions that prioritize marginalized groups inclusion in decision-making processes. Beyond project delivery, the Manager monitors progress, assesses outcomes, and identifies avenues for enhancement, embodying a commitment to sustainability, innovation, and inclusive community engagement.  As the Project Manager s/he will play a vital part in directing project implementation in Chikwawa district, by ensuring effective community engagement, partner relations, and knowledge development on climate change adaptation and resilience, thereby contributing to the broader organizational advancement in pertinent cross-cutting themes. This important project is based in Chikwawa, therefore the successful candidate should expect to spend at least 60% of their time in Chikwawa with additional travel to other parts of Malawi as required.  If you are that dynamic individual with a high level of integrity, accuracy, and attention to detail in their work with the qualifications, experience, energy and confidence to evolve our dynamic NGO as a widely recognized agency working to empower communities in Malawi, here is a great opportunity for you!  Duties and responsibilities  The Project Manager holds a pivotal position within Water Witness Malawi, tasked with orchestrating the successful delivery of the CJC project while contributing significantly to the organizations broader objectives. This role is responsible:  1. Team Leadership and Management:   Providing Strong Leadership: Inspire and guide teams, setting clear expectations and goals. Lead by example in line with organisational values, offering guidance, direction to team members to ensure alignment with project objectives.   Training and Performance Management: Conduct performance evaluations, offer feedback, and support career growth through personalized development plans and mentorship.   Fostering a Positive Work Environment: Create a collaborative and supportive atmosphere by encouraging open communication, teamwork, and a culture of mutual respect among team members. Promote innovation and creativity by recognizing and valuing diverse perspectives.  2. Project Management:   Planning and Organization: Strategize and outline project timelines, milestones, and deliverables from initiation to completion. Organize tasks and allocate resources effectively to ensure smooth project flow within project deadlines.   As part of the project team, assist with the hands-on delivery of the project, ensuring it delivery impact of quality within required timelines.   Coordination and Progress Tracking: Coordinate efforts between team members, government departments, partners and external stakeholders. Monitor project progress, track milestones, and adjust strategies to meet quality standards and deadlines.   Quality Assurance: Ensure that projects meet established quality standards and adhere to predefined timelines and budgets. Conduct regular project reviews of progress and implement corrective measures as needed.  3. Stakeholder Engagement:   Relationship Cultivation: Establish and nurture relationships with stakeholders, partners, and clients through effective communication and engagement. Build trust, understanding, and collaboration to foster mutually beneficial partnerships.   Key Point of Contact: Serve as the primary liaison, addressing inquiries, concerns, and needs of stakeholders promptly and effectively. Negotiate partnerships and agreements while ensuring stakeholder satisfaction.  4. Financial Oversight:   Budget Management: Manage and track project budgets, expenses, and financial resources efficiently to ensure adherence to budgetary constraints.   Financial Reporting and Recommendations: With the support for the finance and admin officer, prepare comprehensive financial reports detailing expenditures and financial performance. Make informed recommendations for cost-efficiency measures and resource allocation.  5. Problem-solving and Decision-making:   Analytical Problem-solving: Identify issues, analyze data, and develop innovative solutions. Troubleshoot issues and formulate and adapt effective strategies to address evolving circumstances.   Evaluate and manage project and organizational risks effectively, escalating significant risks to the project or organization to the WW Malawi Director/Representative.  6. Performance Review, Improvement and Reporting:   Outcome Assessment: Evaluate project outcomes and organizational performance against set objectives. Identify areas for improvement and implement enhancements to enhance efficiency and effectiveness.   Impact Measurement: Measure and quantify the impact of changes or interventions made, ensuring they align with the organizations goals and contribute positively to project success.   Reporting: Produce quality narrative and financial reports in line with reporting schedule. Regularly report progress, challenges arising and how they are being dealt with to the WW Malawi Director/Representative.  7. Knowledge Sharing and Development:   Learning Culture Cultivation: Encourage a culture of continuous learning and development within the team. Develop and facilitate learning sessions, and training initiatives to enhance team and partner skills, competencies, and professional growth.  Key working relationships and logistical arrangements  The successful applicant will join a growing team of professionals based at Water Witness Malawi offices in Blantyre. S/he will report to the Country Manager and will work closely with the team to ensure high impact delivery.  Person Specification  The successful applicant will be able to demonstrate the following:  Experience and qualifications:  Essential   Masters degree in a relevant field such as environmental science, climate studies, sustainable development, or a related discipline.   Minimum of five (5) years relevant experience in leadership and management   Demonstrated experience in project management and delivery, preferably in the context of climate change adaptation. This will include risk analysis and risk management experience.   Experience in managing private and public partnerships in other development organizations.   Strong understanding of climate change issues, resilience, and social inclusion concepts.   Experience in the use of monitoring and evaluation frameworks and methodologies.   Experience in grant management and reporting.   Experience in successful organisation and conducting of workshops and training.   Experience in organisation development, civil society engagement, communication, lobbying and policy advocacy engaging civil society, private sector and government.   Demonstrable experience in data analysis and interpretation using relevant software tools.  Skills and attributes:  Essential   Effective and inspirational individual with strong collaboration skills.   Effective oral and written communication and interpersonal skills for engaging with diverse stakeholders, training, reporting.   Fluent in spoken and written English and Chichewa language.   Highly numerate   Able to produce accurate impactful work to tight deadlines.   Extremely well organised with excellent planning and prioritisation skills to be able to produce high-quality work, deliver events and manage a wide-ranging and complex workload.   Self-motivated person, able to think strategically, with strong analytical/problem solving skills and can take initiative.   Excellent organizational skills with the ability to multitask, prioritize, and meet deadlines.   IT literate and excellent knowledge and skills in using QuickBooks and Microsoft Excel and Word packages.   Able to work effectively both without close supervision and as part of a multidisciplinary team.   Trustworthy, able to maintain confidentiality, deal with sensitive information and to take responsibility for important operational functions.   Willing to work additional hours at crucial times.   Able to work in a rural context, within Chikwawa and take up additional travel within Malawi as required.  How to apply  All correspondence should be sent to jobs@waterwitness.org with PM-CJC WW Malawi in the subject line. Please provide a CV and cover letter in ONE single document. The cover letter should be no more than two pages long, must explain why you want to work in this position, and should clearly set out how your skills and experience match the profile described in the job description. The CV should be no more than three pages long and should include the email addresses and telephone numbers of two referees.  Applications which do not meet these specifications will not be considered.  Timeline  Closing date: 17:00h BST, 12th December 2023  Final panel interviews: 18-21st December 2023 (To be confirmed)  Expected start: January 2024  Equality Statement  Equality and respect for diversity are at the core of WWIs values. Staff are expected to work collectively and individually to promote a constructive and sensitive approach to others from a variety of backgrounds, where the work of others is valued and respected. Please let us know if you need any assistance in making your application or if you have any special requirements should you be selected for an interview. On this occasion only people with the right to work in Malawi should apply.  Selection Process  Only shortlisted candidates will be contacted. Please assume that you have not been shortlisted if you have not heard from us within 10 working days of the closing date. Shortlisted candidates may be required to undertake an additional assessment prior to the interview.  Queries  If you have any queries on any aspect of the appointment process, need additional information, or would like to have an informal discussion, please email jobs@waterwitness.org in the first instance"
  },
  {
    "title": "Communication Assistant",
    "company": "Water For People",
    "location": "Malawi",
    "description": "Join Our Team We are HiringA. SummaryWater For People is an international non-governmental organization (NGO) that works with people and partners to develop innovative and long-lasting solutions to the water, sanitation, and hygiene problems globally. The organization strives to continually improve, experiment with promising new ideas, and leverage resources to multiply its impact.Water For People in collaboration with World vision are prospecting a US$10 million funding that will support the implementation of Water, Sanitation, and Hygiene (WASH) services for everyone in Chiradzulu District project. In preparation for this project which is planned to commence in January 2022 once funding is secured Water For People is hiring the following positionsD. Communication AssistantMajor ResponsibilitiesDeveloping and implementing communications interventions & work-plans, campaigns and eventspreparing fact-checking, editing, and producing professional media and communications materials for... various audiences and ensuring their timely disseminationProviding considered professional communications advice to project team on an ongoing basis, and preparing communications workshopsCreating high quality media and multimedia content for dissemination in countryEnsuring visibility, reputation, and positioning as the leading organisation on WASHMaintain an up to date database of journalists and media organizations, respond to media enquiries on deadline, and build dialogue with individual journalists, editors and news desks.QualificationBachelor degree in journalism, mass communication or any other relevant degree.F. Employment ConditionsPosition is based at Water For Peoples Malawi office;Trips within and outside Malawi will be required from time to timePlease send your application letter and CV including copies of relevant certificates through email to The Country Director at [email protected] the email heading should read Senior WASH Program ManagerClosing date of application is December 13th, 2021Note: Due to the many number of applications that we normally receive shortlisting and interviews will be done on a rolling basis without waiting for the closing date. Only short-listed candidates will be contacted.  Application email or URL: malawi@waterforpeople.org"
  },
  {
    "title": "Customer Care Assistant (4 positions)",
    "company": "Central Region Water Board",
    "location": "Lilongwe",
    "description": "Central Region Water Board is a statutory corporation legally mandated by the Waterworks Act No. 17 of 1995 to provide water and sanitation services in all towns and market centers in the central region except Lilongwe City.  Applications are invited from suitably qualified and experienced persons to fill the following vacant positions within Central Region Water Board.  Customer Care Assistant (CRWB 8) 4 positions  Purpose of the job  Provide customer services in a timely and properly manner in line with billing cycle and ensure accuracy in unaccounted for water (UFW).  Key Roles and responsibilities  Takes charge of meter reading services in the scheme including the formulation and implementation of meter reading programs  Supervises and allocates meter reading jobs to junior a staff in the section and monitors their performance  Collects and compiles meter readings for submission to Scheme Cashier in batches.  Sorts out and dispatches /distributes water bills to customers.  Carries... out disconnection exercises on overdue water accounts  Conducts door to door sensitization campaigns on water usage and handles queries and complaints in the process  Taking water supply audits to check flow and quality  Performing any other duties relevant to the post.  Minimum academic and professional qualifications and experience  Malawi School Certificate of Education plus two years experience at meter reader and customer care Assistant.  If you feel you fully qualify for the position, as per above specifications, please submit your Curriculum Vitae containing details of three (3) traceable referees and a covering application letter in sealed envelope clearly marked the position you are applying for  The submissions of the vacancy applied for, should be made not later than 7th October, 2022 to the:  Chief Executive Officer  Central Region water Board  Private Bag 59  Lilongwe"
  },
  {
    "title": "Assistant Water Quality Officer",
    "company": "Southern Region Water Board",
    "location": "Zomba",
    "description": "Applications are invited from suitably qualified candidates to fill the following vacant positions tenable at various establishments of Southern Region Water Board: ASSISTANT WATER QUALITY OFFICER Candidates should possess a minimum of Bachelor of Science  Application email or URL: https://www.alljobspo.com/url.php?id=aHR0cHM6Ly9qb2JzZWFyY2htYWxhd2kuY29tL2pvYi9hc3Npc3RhbnQtd2F0ZXItcXVhbGl0eS1vZmZpY2VyLw=="
  },
  {
    "title": "Water Monitoring Assistant",
    "company": "Blantyre District Council",
    "location": "Blantyre",
    "description": "Blantyre District Council is inviting applications from suitably qualified persons of Malawian origin to fill the following vacant positions:Job Title: Water Monitoring AssistantGrade: M/M11 Location: Blantyre District Council Age: Be aged between 21 to 40 years Salary: Within the range of government (M/M11) salary segmentEducational QualificationsApplicants must be in possession of a Malawi school certificate of Education (MSCE) with Credits in English, Mathematics, Biology, Geography and Physics.Duties and Responsibilities1. Sensitize and mobilize communities in water supply and Sanitation activities and disseminate gender, Hygiene, Sanitation, and Health (including HIV and AIDS) messages;2. Facilitate the establishment and sustenance of Local Extension Workers Coordination Committees, Village Health and Water Committees (VHWC) and Water Points Committees (WPCs);3. Collect, analyse and report data on Water Supply and Sanitation;4. Facilitate participatory Water site collection;5... Monitoring community financial management for Operation and maintenance activities;6. Any other duties assigned from time to time.Interested individuals should submit their application letters together with copies of academic and professional certificates, updated CV with Valid Phone Numbers and names of three traceable referees. Clearly mark on the envelope the post being applied for and should be addressed to:The Chairperson The Appointments and Disciplinary Committee Blantyre District Council Private Bag 97 BLANTYREClosing date for receiving applications is 22nd December 2021. Only shortlisted candidates will be invited for interviews"
  },
  {
    "title": "Charity Water Project Manager",
    "company": "World Vision",
    "location": "Blantyre",
    "description": "With over 70 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith.  Come join our 33,000+ staff working in nearly 100 countries and share the joy of transforming vulnerable childrens life stories!  Key Responsibilities:  Purpose of the position:  The position will be responsible for providing leadership of Charity water project activities, coordinating and fostering partnerships within the sector in the districts.  MAJOR RESPONSIBILITIES  Project planning and Implementation  Provide management and technical leadership to WASH project and staff in order to ensure the projects meet or supersede established WASH & Infrastructure standards and targets  Lead the process of planning, design and implementation of WASH project in specified location  Provide Technical guidance to the projects team, ensuring quality... delivery of WASH services in the targeted program locations  Ensure effective use of appropriate WASH models during the whole cycle of implementation  Project monitoring and reporting  Lead in project monitoring and evaluation process of the WASH project (s) in the given locations, ensure relevant passement are conducted during project implementation, reports of which are shared and lessons incorporated in the project during the project cycle  Work with the M&E team to ensure that M&E tools are developed, understood and used by project staff  Ensure evaluation results are shared with relevant partners and effectively used for project redesign.  Lead the monitoring of projects operation, processes and outputs against budget plans in order to ensure prudent and efficient management of the human, financial and material resources entrusted to the project  Provide support in developing proposal designs for any new phase and amendments in collaboration with, local structures, BDGM Unit and WASH Technical program Unit  Take lead in assessment and evaluation processes for WASH projects in collaboration with local structures, Quality Assurance teams and Technical Program Unit;  Regular documented, monitoring of project implementation;  Produce quality and timely donor reports  People management and capacity building  Work within the organization system to get support to identify technical gaps in knowledge and skills of staff and develop capacity building plans to bridge them;  Train staff and partners in best-practice WASH modalities and approaches;  Conduct staff appraisal conducted and provide appropriate feedback toe ensure staff motivation, unity and trust.  Hold regular progress meetings with staff to review project performance and address challenges to implementation  Facilitate awareness raising of staff and partners in key mainstreaming issues including GESI and Child Protection, etc.;  Capacity plans in place and resourced;  Disciplinary measures undertaken in consultation of with line manager and P&C when required;  In collaboration with Quality Assurance and Program Design Unit train WASH & Infrastructure staff and partners in design, reporting, monitoring and evaluation  Networking and Coloration  Develop strategic partnerships with stakeholders at District and Traditional Authority to promote coordination and to raise profile of WASH programming for marketing and fundraising purposes  Represent WVS in coordination inn relevant coordination at district level, providing regular updates as required and seeking leadership roles when appropriate;  Collaborate with Communications Department to document project success stories and pressing practices for scale up and marketing purposes  Collaborate with local authorities and relevant user groups and management committees;  Work closely with local structures to facilitate the implementation and sustainability of WASH interventions  Strengthen coordination with the District Council  Timely provision of feedback to the Number of networks and government stakeholders signed.  KNOWLEDGE, SKILLS AND ABILITIES  Minimum education, training and experience requirements to qualify for the position:  Bachelors degree in Civil Engineering or Water and environmental Engineering.  MA in project planning and management an added advantage  Additional technical practical skills in GIS and Water mapping  At least 7 years experience in WASH programming in development organization two of which should be years in project management.  Strong in grant management/ excellent in budget management  Proposal and concept paper development.  Demonstrated interpersonal and leadership skills.  Strong supervisory abilities, and demonstrated capacity of teamwork and of coordination with relevant actors.  Registered Water Engineer.  At least 5 years experience working in the NGO sector  Knowledge about WASH related approaches and policies  Working in a cross-cultural environment  Very good oral and written communication skills in English and ability to write quality report  Applicant Types Accepted:  Local Applicants Only  Application email or URL: https://worldvision.wd1.myworkdayjobs.com/WorldVisionInternational/job/Blantyre-Malawi/Charity-Water-Project-Manager_R19599"
  },
  {
    "title": "Inspection Officer",
    "company": "National Water Resources Authority",
    "location": "Lilongwe",
    "description": "The National Water Resources Authority (NWRA) is a statutory organization established by the Water Resources Act of 2013 with a specific function to regulate and manage water  resources. Furthermore, the NWRA seeks to ensure the sustainable use of water resources  and address the water resources planning, development and management challenges.  In its effort to sustainably manage water resources, the NWRA seeks to recruit energetic,  highly motivated, focused and result-oriented individuals to form part of its NWRA members of staff. In this regard, NWRA invites applications from suitable qualified and experienced persons to fill the following vacant position:  Post: Inspection Officer  Grade: NW5  Responsible to: Senior Inspections Officer  Purpose of the Job  To facilitate the inspection and enforcement processes.  Key Duties and responsibilities  Ensure that licences are submitted and processed as per standard operating procedure  Inspect water resources users to verify if the... volume abstracted is in accordance with licence  Make follow ups with industries to ascertain that the effluent discharged is not harmful  Collect water samples for further inspection by laboratory  Ensure defaulters are fined and their water sources closed  Monitor catchment areas and recommend interventions if there is environmental degradation  Conducting regular investigations to assess compliance to set standards in water resource management and development  Preparing periodic reports.  Minimum Qualification and Experience  Bachelors Degree in Water Resource Management, Social Sciences or Engineering or Related field.  Minimum of four (4) years relevant expbrience.  Additional Skills and Abilities  Problem solving and analytical skills  Strong interpersonal skills  Ability to work in a team environment  Good communication skills both oral and written  Good understanding of relevant laws and office procedures  Attention to detail Integrity, honesty and confidentiality  The NWRA is an equal opportunity employer. Therefore, male and female persons including  persons with disabilities, who meet the prerequisite qualifications and experience are encouraged to apply.  An attractive remuneration package comprising a competitive salary and benefits will be offered to the successful candidates. The NWRA also offers excellent career development  opportunities.  Interested persons should submit their application with up-to-date detailed curriculum vitae (CV) including names and addresses of three traceable referees, to reach the undersigned not later than the 18th November, 2022  Only complete applications will be considered  All late applications shall not be considered.  The Executive Director,  National Water Resources Authority,  TAURUS House,  Private Bag 363, Lilongwe 3.  You can also send your application through email below:  Bandayvone3@gmail.com  Copy: Fchisambula1@gmail.com, dwightkambuku@engineer.com  Application email or URL: Bandayvone3@gmail.com"
  },
  {
    "title": "Programme Support Officer",
    "company": "Website Water Witness International",
    "location": "Blantyre",
    "description": "Background  Water Witness leads action, research and advocacy for a fair water future where all people can  access the water needed to thrive, and are protected against floods, drought, pollution, ecosystem  degradation and water conflict.  We stand with those at the sharp end of the global water crisis to shine a light on its impacts, to  understand its root causes and to activate an effective response. We work with inspirational local  partners to trigger social justice and system change to ensure sustainable management and  equitable use of the worlds most precious resource.  Over the past decade our team have been on the frontline: working to improve water security for  over 1 million vulnerable people, driving improved policy, practice and investment, building new  approaches and communities of practice, and holding duty bearers to account for improved  performance on water. Our hands-on field experience is backed up by cutting-edge research and  global analyses, and this... provides us with a clear understanding of the action needed to deliver on  the water-related Sustainable Development Goals.  Our new 2030 strategy builds on our track record as a dynamic NGO which unlocks improved water  resource governance and water security for vulnerable communities. In the decade ahead we will  work with our partners to focus on the following five imperatives:  1. Accountable governance: to implement effective and equitable water policy and law  2. Progressive financing: to unlock funding and financial incentives for water security  3. Redefining corporate responsibility: to transform private sector behaviour for shared  water security  4. Confronting climate chaos: to prevent catastrophic water shocks and build resilience  5. Activating people power: to trigger political, social and economic change for water  security  We are now seeking an exceptional individual to join our team in Malawi with the skills and  experience to assist with the smooth running of WW Malawi operations and support to our  partners and the WW Malawi Board of Trustees.  The Role  Job Title: Programme Support Officer (PSO)  Place of Work: Blantyre, Malawi  Pay: Up to GPB 13,000 per annum before tax depending on experience  Reports to: International Programme Manager  Travel: Occasional periods of travel in Tanzania  Term: 2 years, extension subject to performance and funding  Job Summary and Purpose  This is a new position within a people focused NGO, which will place the successful applicant at the heart of efforts to improve water security through sustainable and inclusive development in  Malawi. The successful candidate will be responsible for efficient day-to-day support to operations, ensuring that the appropriate systems are in place, and that timely support is given to our team,  our partners and the WW Malawi Board of Trustees.  This important role is essential to the smooth running of the team, providing timely financial, administrative and logistical support. Key areas of responsibility include ensuring robust financial  management; facilitating audit activities; supplying digital content, managing Information and Communication, across the organization and providing excellent logistical and administrative support to the projects, team, partners and WW Malawi Board.  We are looking for someone who has a high level of integrity, accuracy and attention to detail in their work with the qualifications, experience, energy and confidence to evolve our dynamic NGO as  a widely recognized agency working for water security for all in Malawi.  Duties and responsibilities  The Programme Support Officer is responsible for the smooth day-to-day functioning of the WW Malawi, contributing to the achievements of its overall objectives.  1. Financial and contract/grant management  Managing day-to-day financial operations including accounts payable, accounts receivable/grants claims, bank reconciliations, general accounting functions in line with recognized accounting protocols.  Improving economy and efficiency across the organisation and ensuring a robust internal control environment, including through identification, development, implementation and enhancement of relevant systems and processes.  Coordinate with manager in the preparation of annual budgets, developing and strengthening budget monitoring, reporting and preparation of quarterly financial forecasts, management  reports, and statutory annual accounts, keeping the manager fully informed of significant financial issues and developments.  Processing and preparing monthly accounts to the management and to the Malawi Board of Trustees.  Preparing and coordinating financial reporting to WWI in the UK and audits and ensuring recommendations are implemented as appropriate.  Ensuring that accounting and administrative processes are understood and adhered to across the organisation.  Ensuring that the charity is compliant with all legislation, guidelines, and best practice relevant to finance and taxation applicable to charitable organisations e.g. taxation.  Ensuring compliance in submitting accounts, reports and other information to the NGO registrar and other such duties as required.  Managing and supporting external stakeholder relationships including with banks, suppliers, landlord, accountants, and auditors.  Providing financial advice, support or training to non-finance staff as required.  Install payroll system (as agreed by WWI and the Malawi Board), then process the payroll on a monthly basis, ensuring salary payments are correct and timely.  2. Office Administration  Managing the office and premises and lease. Applying Value for Money principles, maintaining/purchasing office furniture, equipment, and stationery, and managing relationships with suppliers of services such as utilities, transport, telephones, stationery, cleaning, and postage/courier services.  Providing administrative support in accordance with WWI policies and donor contracts, ensuring documentation of the procedures.  Ensuring that risk is managed according to the risk policy, and that the risk policy is regularly reviewed and updated, and the risk register is maintained.  Overseeing paper and electronic filing systems and storage systems, ensuring these are used consistently across the organisation, that the data is accurate, well maintained, and easy to retrieve.  Overall responsibility for ensuring that WWI staff are all conversant and compliant with internal policies, especially Safeguarding and Health and Safety requirements.  3. Programme logistics  Providing logistical support in line with project plans (workshops, training, scheduling, and organizing meetings and organizing travel logistics for project staff etc.).  Organise Board travel and meeting arrangements.  4. Programme Communications  Managing Information and Communications across the organization.  Supply digital content (blogs, stories, photos, case studies, testimony etc)  Set up and manage photo database  5. Board Support  Prepare meeting agendas, supporting material and draft minutes for review  Key working relationships and logistical arrangements  The successful applicant will work with a team of professionals based at Water Witness Malawis offices in Blantyre. S/he will report to the Manager and will work closely with the team to ensure high  impact delivery.  Person Specification  The successful applicant will be able to demonstrate the following:  Experience and qualifications:  Essential  Fully completed accounting qualification/certification e.g. CA, ACCA, CIMA, CPA or  relevant business management qualification or similar. Masters qualification will be  considered an added advantage.  Minimum of three (3) years relevant experience include managing and administration of organisational finances, audits, producing monthly, quarterly, and annual accounts with analysis and commentary.  Demonstrable experience of NGO/CSO project support;  Experience of writing digital content and communications.  Excellent understanding of current legal requirements and best practice in financial  management and accounting, includes government policies and regulations on employment and taxation.  Desirable  Risk analysis and risk management experience.  Experience of events planning and management.  Skills and attributes:  Essential  Effective and inspirational individual with strong collaboration skills.  Fluent in spoken and written English and Chichewa language.  Highly numerate and able to produce accurate work to tight deadlines.  Extremely well organised with excellent planning and prioritisation skills to be able to  produce high-quality work, deliver events and manage a wide-ranging and complex  workload.  Ability to think strategically.  Strong analytical/problem solving skills.  Excellent (proven) interpersonal both oral and written communication skills.  IT literate and excellent knowledge and skills in using QuickBooks and Microsoft Excel and  Word packages.  Personal qualities:  Essential  Trustworthy, able to maintain confidentiality, deal with sensitive information and to take  responsibility for important operational functions.  Self-motivated person, able to take initiative and work without close supervision.  Able to work effectively in a diverse team environment, supporting colleagues on complex  financial matters where required.  Willing to work additional hours at crucial times  How to apply  All correspondence should be sent to jobs@waterwitness.org with PSO  WW Malawi in the  subject line. Please provide a CV and cover letter in ONE single document. The cover letter should  be no more than two pages long, must explain why you want to work in this position, and should  clearly set out how your skills and experience match the profile described in the job description.  The CV should be no more than three pages long and should include the email addresses and  telephone numbers of two referees.  Applications which do not meet these specifications will not be considered.  Timeline  Closing date: 17:00h BST, 2nd August 2023  Selection day and final panel interviews: To be confirmed  Expected start: 1st September 2023  Equality Statement  Equality and respect for diversity are at the core of WWIs values. Staff are expected to work  collectively and individually to promote a constructive and sensitive approach to others from a  variety of backgrounds, where the work of others is valued and respected. Please let us know if  you need any assistance in making your application or if you have any special requirements should  you be selected for an interview. On this occasion only people with the right to work in Malawi  should apply.  Selection Process  Only shortlisted candidates will be contacted. Please assume that you have not been shortlisted if  you have not heard from us within 10 working days of the closing date. Shortlisted candidates may  be required to undertake an additional assessment prior to the interview.  Queries  If you have any queries on any aspect of the appointment process, need additional information,  or would like to have an informal discussion, please email jobs@waterwitness.org in the first  instance  Application email or URL: jobs@waterwitness.org"
  },
  {
    "title": "Supply and delivery of Post-paid Water Meters, Pipes and Fittings",
    "company": "Blantyre Water Board",
    "location": "Blantyre",
    "description": "SPECIFIC PROCUREMENT NOTICE  Country : Malawi  Name of Project : Malawi Water and Sanitation Project  1  Contract Title : Supply and delivery of Post-paid Water Meters, Pipes and Fittings  Grant No. : IDA E159-MW  RFB Reference No. : MW-BWB-350920-GO-RFB  The Malawi Government has received financing from the World Bank toward the cost of the Malawi Water and Sanitation Project  1 (MWSP-1) and intends to apply part of the proceeds toward payments under the contract for Supply and delivery of Post-paid Water Meters, Pipes and Fittings. For this contract, the Borrower shall process the payments using the Direct Payment disbursement method, as defined in the World Banks Disbursement Guidelines for Investment Project Financing, except for those payments, which the contract provides to be made through letter of credit.  Blantyre Water Board now invites sealed Bids from eligible Bidders for the following goods:  Lot 1: Supply and Delivery of Post- Paid Water... Meters  Item  N  Description of Goods  Quantity  Delivery Period  1  15 mm postpaid water meters  10,000  30  60 Days  Lot 2: Supply and Delivery of PVC Pipes  Item  N  Description of Goods  Quantity  Delivery Period  1  20 MM PVC pipes Class 16  1,000  30  60 Days  2  25 MM PVC pipes Class 16  1,000  30  60 Days  3  32 MM PVC pipes Class 16  1,500  30  60 Days  4  40 MM PVC pipes Class 16  1,500  30  60 Days  5  50 MM PVC pipes Class 16  1,500  30  60 Days  6  63 MM PVC pipes Class 16  2,000  30  60 Days  7  75 MM PVC pipes Class 16  600  30  60 Days  8  90 MM PVC pipes Class 16  600  30  60 Days  9  110 MM PVC pipes Class 16  600  30  60 Days  10  160 MM PVC pipes Class 16  200  30  60 Days  11  200 MM PVC pipes Class 16  200  30  60 Days  Lot 3: Supply and Delivery of Galvanized Iron (GI) Pipes and Fittings  Item  N  Description of Goods  Quantity  Delivery Period  1  15MM G I Pipes  100  30  60 Days  2  50 MM G I Pipes  30  30  60 Days  3  100 MM G I Pipes  50  30  60 Days  4  150MM G I Pipes  50  30  60 Days  5  200 MM G I Pipes  20  30  60 Days  6  15 MM Union Sockets  3,000  30  60 Days  7  15 MM Plain Sockets  3,000  30  60 Days  8  15MM Hex Nipples  3,000  30  60 Days  9  15 MM M&F Bends  2,000  30  60 Days  10  20MM Union Sockets  1,000  30  60 Days  11  20 x15MM Reducing Bushes  1,000  30  60 Days  12  25MM Union Sockets  600  30  60 Days  13  32 MM Gate Valves  50  30  60 Days  14  40 MM Gate Valves  50  30  60 Days  15  50 MM Sluice Valves  50  30  60 Days  16  80 MM Sluice Valves  50  30  60 Days  17  100 MM Sluice Valves  30  30  60 Days  18  150 MM Sluice Valves  30  30  60 Days  19  200 MM Sluice Valve  20  30  60 Days  Lot 4: Supply and Delivery of HDPE Pipes and Fittings  Item  N  Description of Goods  Quantity  Delivery Period  1  50MM HDPE Pipes (100m in length)  3  30  60 Days  2  110MM HDPE Pipes (100m in length)  5  30  60 Days  3  20 MM HDPE Couplers  3,000  30  60 Days  4  20 MM HDPE male adapters  3,000  30  60 Days  5  50MM HDPE Couplers  600  30  60 Days  6  63MM HDPE Couplers  600  30  60 Days  7  75MM HDPE Couplers  500  30  60 Days  8  90MM HDPE Couplers  300  30  60 Days  9  110MM HDPE Couplers  100  30  60 Days  10  50MM Male Adapters  500  30  60 Days  11  63 MM Male Adapters  500  30  60 Days  Lot 5: Supply and Delivery of VJ Couplings  Item  N  Description of Goods  Quantity  Delivery Period  1  50MM VJ Couplings (Range 59-73)  150  30  60 Days  2  500MM VJ Couplings (Range 88-103)  150  30  60 Days  3  100MM VJ Couplings (Range 108-128)  450  30  60 Days  4  150MM VJ Couplings (Range 159-182)  450  30  60 Days  5  200MM VJ Couplings (Range 192-209)  90  30  60 Days  6  200MM VJ Couplings (Range 218-235)  60  30  60 Days  7  250MM VJ Couplings (Range 271-291)  90  30  60 Days  8  250MM VJ Couplings (Range 271-294)  90  30  60 Days  9  300MM VJ Couplings (Range 334-350)  60  30  60 Days  10  400MM VJ Couplings (Range 401-417)  30  30  60 Days  11  400MM VJ Couplings (Range 417-437)  60  30  60 Days  12  450MM VJ Couplings (Range 477-493)  40  30  60 Days  13  500MM VJ Couplings (Range 494-510)  30  30  60 Days  14  500MM VJ Couplings (Range 577-593)  30  30  60 Days  15  50MM CI Saddles  200  30  60 Days  16  75MM CI Saddles  100  30  60 Days  17  100 MM CI Saddles  200  30  60 Days  Lot 6: Supply and Delivery of Meter Testing Equipment and Water Leak Detectors  Item  N  Description of Goods  Quantity  Delivery Period  1  Portable Meter Testing Equipment and Accessories  3  30  60 Days  2  Smart Acoustic Water Leak Detector  4  30  60 Days  3. Bidding will be conducted through National Competitive Bidding (NCB) using a Request for Bids (RFB) as specified in the World Banks Procurement Regulations for IPF Borrowers November 2020 (Procurement Regulations), and is open to all eligible Bidders as defined in the Procurement Regulations.  4. Interested eligible Bidders may obtain further information from the Chairperson, Internal Procurement and Disposal of Assets Committee Blantyre Water Board, P.O.Box 30369, Chichiri, Blantyre 3, Malawi, Email: piu@bwb.mw and inspect the bidding document during office hours [0730 to 1630 hours] at the address given below:  5. The bidding document in English may be purchased by interested Bidders upon the submission of a written application to the address below and upon payment of a nonrefundable fee of MK10,000.00.  6. Bids must be delivered to the address below on or before 4th December 2023 at 14:00 Hours (Local Time). Electronic Bidding will not be permitted. Late Bids will be rejected. Bids will be publicly opened in the presence of the Bidders designated representatives and anyone who chooses to attend at the address below on 4th December 2023 at 14:00 Hours (Local Time)  7. All Bids must be accompanied by a Bid-Securing Declaration.  8. Attention is drawn to the Procurement Regulations requiring the Borrower to disclose information on the successful bidders beneficial ownership, as part of the Contract Award Notice, using the Beneficial Ownership Disclosure Form as included in the bidding document.  9. The address(es) referred to above is (are):  (i) Address for Clarifications  The Chief Executive Officer  Blantyre Water Board  Off Makata Road  P.O. Box 30369  Chichiri  Blantyre  MALAWI.  Tel: +265 1 895 000  E-mail: piu@bwb.mw  (ii) Address for Inspection of Bidding Documents, Bid Submission and Opening:  The Chairperson  Internal Procurement and Disposal Committee Chairperson  Blantyre Water Board  Off-Makata Road  P.O. Box 30369  Chichiri  Blantyre  MALAWI.  (iii) Account Number for direct cash deposits for purchasing bid documents is:  Blantyre Water Board Project Account  FDH Bank  Blantyre Branch  Account Number: 1040000136471  Swift Code: FDHFMWMW"
  },
  {
    "title": "Senior Community Water Supply Officer (Wells)",
    "company": "Ministry of Water and Sanitation",
    "location": "Lilongwe",
    "description": "Applications are invited from suitably qualified Malawians, Civil Servants or non-civil servants, as the case may be, depending on the requirements of the post, for the vacancies listed below existing in the Civil Service:  MINISTRY OF WATER AND SANITATION  Vac. 37/23  Post : Senior Community Water Supply Officer (Wells) (Grade H)  Salary: Within the Grade H salary scale segment  Location: Ministry of Water and Sanitation  Qualifications:  Applicants should be in possession of Bachelor of Science in Engineering in any of the fields: Civil Engineering, Water Engineering, Municipal/Water Utilities, Water Supply Engineering and water Resources Engineering obtained from accredited institutions.  Duties:  Facilitating the rehabilitation and reduction of unaccounted for water of existing water supply systems;  Supervising reticulated systems and water points maintenance and other water supply related infrastructure;  Facilitating collection of water point data in liaison with all... stakeholders and relevant authorities;  Ensuring that mitigation measures are undertaken for water points that are not providing potable water in terms of quantity and quality;  Preparing operation and maintenance guidelines for water points;  Monitoring implementation of water supply project activities;  Supervising duties of junior staff under him/her;  Facilitating availability and distribution of water supply plant spare parts;  Participating in planning and coordinating meeting on WASH issues at the district;  Facilitating implementation of capacity building activities (including trainings) for user communities of water supply and sanitation facilities;  Disseminating National Policies and guidelines on WASH;  Participating in advocacy campaigns for promoting proper use water supply sources; and  Participating in designing developing and revising policy documents on WASH.  Note:  Documentary evidence of major requirements specified in the advertisement shall be required during interviews. Serving officers will also be required to demonstrate during the interviews that they are permanent and pensionable officers in the Civil Service by producing letters of confirmation in appointment in addition to letters of condition of appointment on probation (PSR 19).  Civil Service Commission is an equal opportunity employer: All qualified individuals are welcome to apply. Interested qualified candidates should submit their applications together with copies of relevant Certificates and Curriculum Vitae to:-  The Secretary  Civil Service Commission  P.O. Box 30133  LILONGWE 3  Email: cservice@csc.gov.mw  To reach him not later than 14th April, 2023  Application email or URL: cservice@csc.gov.mw"
  },
  {
    "title": "Director of Finance",
    "company": "Northern Region Water Board",
    "location": "Mzuzu",
    "description": "Applications are invited from suitably qualified Malawians to fill the vacant position of Director of Finance for Northern Region Water Board, tenable at its Head Office in Mzuzu.  THE ORGANISATION  Northern Region Water Board is a Statutory Corporation established under the Water Works Act, Chapter 72:01 of the Laws of Malawi with statutory mandate to supply potable water and provide waterborne sewerage sanitation services in urban and peri- urban areas in the Northern Region of Malawi.  JOB SUMMARY  The Director of Finance is accountable to the Chief Executive Officer and is responsible for overseeing financial management and accounting services in order to ensure prudent utilisation and accounting for financial resources.  PRINCIPAL ACCOUNTABILITIES AND RESPONSIBILITIES  The principal accountabilities and responsibilities for the Director of Finance include the following:  Providing oversight on financial planning and budgetary control processes.  Developing and implementing... efficient and effective financial control systems for effective and efficient management of financial risks.  Developing and implementing efficient and effective financial accounting systems.  Developing effective and efficient management accounting and reporting systems.  Designing and implementing efficient and effective treasury and cash management systems.  Ensuring efficient and effective statutory reporting systems.  Designing and implementing efficient tax management processes.  Developing and executing financial management policies and procedures.  Conducting financial analysis for water supply and waterborne sewerage sanitation infrastructure investment projects.  Facilitating external audit processes and ensuring timely implementation of recommendations from auditors.  Developing and executing corporate plans and capital expenditure budgets in liaison with other heads of department.  QUALIFICATIONS AND EXPERIENCE  The ideal candidate must have the following:  An Accounting Professional Certificate recognized by local and international professional bodies such as Institute of Chartered Accountants in Malawi (ICAM), Association of Chartered and Certified Accountants (ACCA), Chartered Institute of Management Accountants (CIMA) and American Institute of Certified Public Accountants (AICPA).  A minimum of a Bachelors Degree or equivalent relevant professional qualification in Accounting or Accounting related fields and a Masters Degree in Finance Management or Business Administration or relevant qualification obtained from a recognized institution.  A minimum of eight (8) years post-professional qualification experience of which three (3) years must be at senior executive or middle management position in a busy organization.  SPECIAL ATTRIBUTES  The ideal candidate must have the following attributes:  A mature self-starter  Good analytical and problem-solving skills  A good team builder with ability to manage and motivate subordinates.  Ability to work under pressure  Ability to set priorities and make optimal allocation of resources.  Not more than 57 years of age so as to be eligible to serve for a minimum of three years before reaching the mandatory retirement age of 60.  APPOINTMENT AND REMUNERATION  The successful candidate shall be offered a negotiable performance-based contract for a period of three (3) years that will be subject to renewal on satisfactory performance and mutual agreement, with an attractive salary, benefits, and gratuity package commensurate with seniority of the position and qualifications of the successful candidate.  METHOD OF APPLICATION  Interested candidates should submit their applications together with detailed Curriculum Vitae and names of three traceable referees by 15th December, 2023 to:  Comptroller of Statutory Corporations  P.O. Box 30061  LILONGWE 3.  The applications must be clearly marked Application for the Post of Director of Finance for Northern Region Water Board.  Northern Region Water Board is an equal opportunities employer and women are encouraged to apply.  Only shortlisted applicants will be acknowledged and invited for interviews"
  },
  {
    "title": "Plumbers",
    "company": "Lilongwe Water Board",
    "location": "Lilongwe",
    "description": "The Lilongwe Water Board is a Statutory Corporation established in 1947 and re-constituted  under the Water Works Act (Cap 72). It is responsible for the provision of water supply services to the City of Lilongwe and other surrounding areas designated as its supply area. The Board is inviting applications from suitably qualified candidates of Malawian origin to fill the following TEMPORARY positions that exist within the Board.  PLUMBERS  Reporting to the Distribution Engineer, the Plumbers will be responsible for the following  Key duties and responsibilities:  2.1 Key Duties and Responsibilities  a) Undertaking routine and planned maintenance works in compliance with standards;  b) Installing new connections and geo referencing;  c) Undertaking leak detection exercise within the area;  d) Marking frequently bursting pipes within the area using Geographical Information System (GIS) and arrange replacement of the same;  e) Reporting all open trenches and road sections for... reinstatement after repair of faults;  f) Enforcing water board bye-laws;  g) Supervising and appraising staff under his/her care;  h) Participating in carrying out maintenance work on mains and supply pipes in emergencies and or when need arises;  i) Preparing reports;  j) Responding to queries on matters related to water supply aspects;  k) Monitoring resource utilization for maintenance works done in the area;  l) Building the capacity of Water supply in the area at all levels.  m) Implementing meter replacement programs;  n) Demonstrating outstanding commitment to service delivery programs of the Board by  personally identifying and reporting water bursts/leakages to customer care Division of  which verifiable repair records shall be tendered to be used as one of the components  for assessment during ones performance appraisal time.  2.2 Minimum Qualification and Experience  A Minimum of a Malawi School Certificate of Education (MSCE) plus a Grade 1 Trade Test  Certificate/ level 3 TEVET Certificate in Plumbing from a recognised institution with two  (2) years experience in plumbing.  METHOD OF APPLICATION  All interested candidates who meet the above requirements should submit their  applications coupled with a detailed Curriculum Vitae and names and contact details of  three traceable referees not later than Friday, 13th October, 2023 to:  The Chief Executive Officer  Lilongwe Water Board  P.O Box 96  LILONGWE  Lilongwe Water Board is an Equal Opportunity Employer. Canvassing will Lead to Disqualification"
  },
  {
    "title": "Chief Impact Officer",
    "company": "Water For People",
    "location": "Malawi",
    "description": "Water For People is a global nonprofit working across nine countries, bringing together communities, local entrepreneurs, and governments to build and maintain water and sanitation services that will last. We have a sustainable solution to end the global water and sanitation crisis, and our employees across the world help drive this solution. POSITION OBJECTIVE: Reporting directly to one of the Co-Chief Executive Officers (Co-CEO), the Chief Impact Officer (CIO) ensures effective communication, execution, and adaptation of our organizational strategy for 2030 and our three-year rolling Strategic Plan. This position provides oversight and leadership to the Influence Team and to the Strategic Accountability and Adaptation Team as they work to implement our global influence plan and our organizational MEL framework, including evidence-based planning processes. The CIO will represent both teams as a member of our Global Leadership Team and will play a critical role in transitioning Water... For People to place greater emphasis on the national impact pathway (national systems strengthening) as part of the organizational strategy. The role will also be responsible for thought leadership and support to country programs on addressing challenges to achievement of sustainable WASH services locally. The CIO will also represent Water For People externally on programmatic topics to enhance our visibility and reputation. ESSENTIAL JOB FUNCTIONS & DUTIES: Strategy Development and Implementation Lead implementation of our organizational strategy (called Destination 2030) and three-year strategic plan. This includes leading and formalizing required updates to the organizational strategy while focusing on learning, long-term trends and outlook, and competitive intelligence. Create and chair a Program Strategy and Delivery committee which will include the Director of Influence, Director of Strategic Accountability and Adaptation, the Africa Regional Director, the Latin America Regional Director, and the India Country Director, to meet regularly and make key. programmatic decisions, identify and ensure thoughtful rollout of global programmatic initiatives, etc. Facilitate process for each country program to develop and maintain a clear vision for their countries that are aligned to achievement of SDG 6.1 and 6.2, including definition of what needs to happen in each country for those targets to be achieved and Water For Peoples role. Ensure national impact pathway (national system strengthening) work is understood and prioritized across the organization, in support of strong WASH systems in the countries where we work. Support organizational change related to the addition of human and financial capacity in all growth areas of our Destination 2030 strategy. Provide thought leadership and support to country programs to address challenges to achieve sustainable WASH services in our district-level work. Collaborate with the other Global Leadership Team (GLT) members and ensure the strategy is understood, communicated, and implemented across the entire organization. Lead global development of organizational strategy scorecard, including annual priorities across the organization, and related tracking and reporting. Work closely with the Co-CEOs to keep the Board informed of strategic matters and progress and challenges related to our impact. Facilitate development of our rolling three-year strategic plans and our post-2030 organizational strategy. Strategic Accountability and Adaptation Manage the Director of Strategic Accountability and Adaptation and provide support on decision-making related to programmatic monitoring, evaluation, and learning (MEL) processes globally. Ensure implementation of all organizational MEL processes, including evidence-based planning aligned with the Destination 2030 results framework at local, national, and global levels. Report annually on progress of strategy implementation against impact targets established in the results framework. Report annually on progress of strategy implementation against the strategic plan annual priorities and targets. Lead review of and update (as needed) the D30 Strategy with team leads of D30 Alliance members and in coordination with the D30 Alliance Manager. Lead the annual review and update (as needed) of the strategic plan annually with the GLT. Global Influence Manage the Director of Influence and provide support on organizational influence, consulting, and partnerships to achieve the global impact pathway objectives of our strategy. Ensure technical support is provided to country programs on national impact activities (including thematic areas climate/WRM, market systems development, finance and planning, etc.), and on the pursuit and implementation of funding opportunities, as requested. Develop recommendations for strategic partnerships and collaborations in the WASH sector for Water For People to gain global influence. Represent Water For People at key international conferences, in WASH alliances and at WASH functions. Ensure impactful contributions from Water For People in partnerships including Sanitation and Water for All (SWA), Agenda For Change, Millennium Water Alliance, etc. Programmatic Leadership and Coordination In collaboration with the Director of Influence and the Director of Strategic Accountability and Adaptation, across the two teams: Build a global team culture through modeling and promoting an inclusive environment, proactive communication, individual and team resilience, and effective change management Identify opportunities for professional development for all team members. Lead staff planning and budgeting for growth and ensure alignment with countries, regions, and our organizational transformation commitments which include JEDI and subsidiarity. Ensure increased prioritization of programmatic evaluation as a key part of MEL. Ensure effective and efficient programmatic support to country programs on institutional funding opportunities, pre- and post-award, with prioritization of in-country opportunities. Ensure alignment, effective communication, information sharing, and effective collaboration across the two teams. Inspire innovative program design that is aligned with the organizational strategy, with a primary focus on national impact (scaling) pathways to strengthen WASH systems. Lead decision-making on aspects of Water For Peoples consulting work aligned to our strategy that are of a global nature, including rate structure, revenue sharing, efficiency considerations, improving processes, etc. Lead decision-making and provide oversight to Water For Peoples potential new programs in the US and/or Canada. Collaborate with the Chief Financial Officer, Chief Administrative Officer, and Regional Directors to support corporate functions including continuous improvement in risk management, talent management, finance, and other areas. Support Donor Impact Team with fundraising initiatives as requested, including donor meetings and in-country fundraising. Lead other organizational initiatives as requested by the Co-CEOs. EXPERIENCE, KNOWLEDGE & SKILLS REQUIRED*:* Bachelors degree required and masters degree preferred (or an equivalent combination of education and experience). A minimum of 10 years experience in strategic planning and/or global operations in international development. Seasoned professional, with a strong strategy orientation, who has previously held several operational roles in fast-paced and complex environments. Work experience should include success in a period of growth and/or transition. Ability to apply a variety of strategic frameworks to analyze problems and to guide and develop solutions. Ability to translate and communicate complex topics in a variety of forums, tailoring communications to effectively fit and influence the targeted audience. Strong executive presence, presentation, and communication skills. Ability to lead the entire range of problem-solving work from problem definition to analysis, recommendation, and the development of implementation plans. Ability to influence on a global and virtual stage, demonstrating courage, an approachable style and inspiring confidence. Ability to bridge cultural boundaries and norms to overcome barriers and improve outcomes Ability to work collaboratively with key internal and external leaders, partners, suppliers, and customers. Proven record of accomplishment with strategy and operational planning, development, and execution. Professional-level proficiency in English, written and spoken is essential; Spanish preferred. Advanced computer proficiencies in MS Office 365 and specifically Microsoft Excel. PHYSICAL REQUIREMENTS/WORKING CONDITIONS: Ability to travel up to 15% of the time domestically and internationally including to developing countries where travel is rugged. Ability to work outside typical offices hours at times to collaborate across multiple time zones. This position has the option to work from an office or remotely in one of the following countries where Water For People is present: Guatemala, Honduras, India, Malawi, Peru, Rwanda, Uganda, the United Kingdom, or the United States. Candidates must be a citizen or legally authorized to work in the country in which they live. Water For People will not support remote work from other countries besides those listed above and from the following states: NY, NJ, WA, VT, and CA. Water For People will consider a candidate who wishes to relocate for this position but will not sponsor a visa. Note: This job description is not intended to be an exhaustive list of all duties, responsibilities, or qualifications associated with the job. Salary Range: US anticipated salary range $138,500  $175,500 per year. (If based outside the US an equivalent country market  based salary will be determined) Actual salary will be determined based on experience and other job-related factors. Benefits: Benefits are one of the ways we encourage healthy living for you and your family. Our generous package includes medical, dental and vision coverage. But health is more than a well-working body: it encompasses body, mind, and social well-being. To that end, we provide a global EAP and Telehealth benefit to address your holistic health. Healthy living also includes financial wellness tools including, digital tools, classes, counseling, paid time off and generous retirement savings plan**. If the position is based outside the US, benefits will be dictated by the country in which the selected candidate is located.** Water For People cannot provide immigration sponsorship for this position. Water For People is committed to protecting children encountered during our work and by our employees, preventing sexual abuse and exploitation of all individuals with a particular focus on women and children and other marginalized communities in the performance of our work, preventing human trafficking in the performance of our work and in our supply chain and to having a drug-free workplace. During the recruitment processes, additional documentation will be requested to comply with our policies and in accordance with the legal requirements in your country of residency, this includes a background check. If you apply for employment, we want you to be aware of our recruitment, selection and hiring processes including important policies regarding employee conduct. Water For People is an equal opportunity employer who is committed to creating a culture of justice, equity, diversity, and inclusion in our workplace. For this position we strongly encourage women and people with disabilities to apply. Water for people strives to create and maintain a level of diversity that reflects the communities we serve. Achieving thisregardless of race, ethnicity, ancestry, tribal affiliation, age, gender, sexual orientation, gender identity, religion, veteran status, disability, socioeconomic class, educational attainment, or other social identities is critical to our ability to have a world where every person has access to reliable and safe water and sanitation services. Our commitment ensures that we: Have a different array of thinking that comes from diverse backgrounds and cultures, enabling us to solve some of the worlds greatest challenges. Strive for a culture of inclusion and belonging by treating each other with dignity, respect, and appreciation enabling us to feel welcome, supported, and valued. Effectively connect, communicate, and build long-lasting relationships with stakeholders within our diverse communities. Have diversity of thought, perspectives, backgrounds, identities, and talents that will support our mission to develop high-quality drinking water and sanitation services are available to Everyone Forever. How to apply If you are both qualified and Water For People interests you, please visit our Career Center and apply with your resume and cover letter to this position.  Application email or URL: https://workforcenow.adp.com/jobs/apply/posting.html?client=WaterPeopl&ccId=19000101_000001&type=MP&lang=en_US"
  },
  {
    "title": "Site Agent  Irrigation and Water Engineer  (3 Positions)",
    "company": "SICO Civils Ltd",
    "location": "Malawi",
    "description": "Applications are invited from suitable qualified candidates to fill the following positions tenable at SICO Civils Ltd. The positions are tenable across MalawiSite Agent  Irrigation and Water Engineer  (3 Positions)Qualifications Candidate should have a Minimum of 5 years of Bachelors Degree in Water. Civil, or Irrigation Engineering or any relevant field. Those with Diploma and have minimum of 10 demonstrable years of experience, will be considered.Experience Experience in construction of dams, canals, pipe works and be able to monitor and evaluate projects progress in order to meet deadlines, cost and qualityHe/she will be able to plan and design hydraulic system structure using Auto Card, following construction and government standardsThe candidate should be well experienced in farmers involvement and participation in planning. designing and construction of projects.Implementation, operations and maintenance of litigation and drainage schemeDemonstrate experience in management... of construction teams.Send your applications to [email protected] Copy [email protected] carlosth[email protected] not later than 28th February 2022.  Application email or URL: mnguluwe@sico.mw"
  },
  {
    "title": "Plumbers",
    "company": "Lilongwe Water Board",
    "location": "Lilongwe",
    "description": "The Lilongwe Water Board is a Statutory Corporation established in 1947 and re-constituted  under the Water Works Act (Cap 72). It is responsible for the provision of water supply services to the City of Lilongwe and other surrounding areas designated as its supply area. The Board is inviting applications from suitably qualified candidates of Malawian origin to fill the following TEMPORARY positions that exist within the Board.  PLUMBERS  Reporting to the Distribution Engineer, the Plumbers will be responsible for the following  Key duties and responsibilities:  2.1 Key Duties and Responsibilities  a) Undertaking routine and planned maintenance works in compliance with standards;  b) Installing new connections and geo referencing;  c) Undertaking leak detection exercise within the area;  d) Marking frequently bursting pipes within the area using Geographical Information System (GIS) and arrange replacement of the same;  e) Reporting all open trenches and road sections for... reinstatement after repair of faults;  f) Enforcing water board bye-laws;  g) Supervising and appraising staff under his/her care;  h) Participating in carrying out maintenance work on mains and supply pipes in emergencies and or when need arises;  i) Preparing reports;  j) Responding to queries on matters related to water supply aspects;  k) Monitoring resource utilization for maintenance works done in the area;  l) Building the capacity of Water supply in the area at all levels.  m) Implementing meter replacement programs;  n) Demonstrating outstanding commitment to service delivery programs of the Board by  personally identifying and reporting water bursts/leakages to customer care Division of  which verifiable repair records shall be tendered to be used as one of the components  for assessment during ones performance appraisal time.  2.2 Minimum Qualification and Experience  A Minimum of a Malawi School Certificate of Education (MSCE) plus a Grade 1 Trade Test  Certificate/ level 3 TEVET Certificate in Plumbing from a recognised institution with two  (2) years experience in plumbing.  METHOD OF APPLICATION  All interested candidates who meet the above requirements should submit their  applications coupled with a detailed Curriculum Vitae and names and contact details of  three traceable referees not later than Friday, 13th October, 2023 to:  The Chief Executive Officer  Lilongwe Water Board  P.O Box 96  LILONGWE  Lilongwe Water Board is an Equal Opportunity Employer. Canvassing will Lead to Disqualification"
  },
  {
    "title": "District Irrigation and Water Development Officer",
    "company": "Dedza District Council",
    "location": "Dedza",
    "description": "Local Government Service Commission is inviting applications from suitably qualified Malawians to fill the following vacant post existing at Dedza District Council  POSITION: District Irrigation and Water Development Officer  GRADE: F/M4  LOCATION: Mchinji District Council  QUALIFICATIONS  Applicants must be serving Principal Community Water Supply and Sanitation Officers (Grade G/M5) heading District Water Offices with a minimum of four (4) years experience at that grade  Or  Serving Senior Community Water Supply and Sanitation Officers (Grade H/ M6) heading District Water Supply and Sanitation Offices with eight (8) years experience at that grade  MODE OF APPLICATION  Those meeting the required qualifications should send application letters with detailed Curriculum Vitae (CVs)and photocopies of relevant qualifications enclosed in an envelope clearly labelled the position applied for to:  The Executive Secretary  Local Government Service Commission,  P. O. Box 766,  Lilongwe  The... closing date for receiving application letters is 25th September, 2023"
  },
  {
    "title": "Licensing Officer",
    "company": "National Water Resources Authority",
    "location": "Lilongwe",
    "description": "The National Water Resources Authority (NWRA) is a statutory organization established by the Water Resources Act of 2013 with a specific function to regulate and manage water  resources. Furthermore, the NWRA seeks to ensure the sustainable use of water resources  and address the water resources planning, development and management challenges.  In its effort to sustainably manage water resources, the NWRA seeks to recruit energetic,  highly motivated, focused and result-oriented individuals to form part of its NWRA members of staff. In this regard, NWRA invites applications from suitable qualified and experienced persons to fill the following vacant position:  Post: Licensing Officer  Grade : NW5  Responsible to: Senior Licensing Officer  Purpose of the Job  To facilitate the licensing processes.  Key Duties and responsibilities  Analysing and recommending licence applications.  Reviewing and implementing license applications guidelines  Processing applications  Collecting and... maintaining licence data and  records  Communicating legal licensing requirements to clients.  To carry out enforcement and licencing inspections on water users  Printing and Issuing licences.  Preparing periodic reports.  Minimum Qualification and Experience  Bachelors Degree in Water Resource Management, Social Science or Related field.  Minimum of four (4) years relevant experience.  Additional Skills and Abilities  Problem solving and analytical skills  Strong interpersonal skills  Ability to work in a team environment  Good communication skills both oral and written  Good understanding of relevant laws and office procedures  Attention to detail  Integrity, honesty and confidentiality  The NWRA is an equal opportunity employer. Therefore, male and female persons including  persons with disabilities, who meet the prerequisite qualifications and experience are encouraged to apply.  An attractive remuneration package comprising a competitive salary and benefits will be offered to the successful candidates. The NWRA also offers excellent career development  opportunities.  Interested persons should submit their application with up-to-date detailed curriculum vitae (CV) including names and addresses of three traceable referees, to reach the undersigned not later than the 18th November, 2022  Only complete applications will be considered  All late applications shall not be considered.  The Executive Director,  National Water Resources Authority,  TAURUS House,  Private Bag 363, Lilongwe 3.  You can also send your application through email below:  [email protected]  Copy: [email protected], [email protected]  Application email or URL: Bandayvone3@gmail.com"
  },
  {
    "title": "Senior Engineer (Planning)",
    "company": "Central Region Water Board",
    "location": "Lilongwe",
    "description": "Central Region Water Board is a statutory corporation legally mandated by the Waterworks Act No. 17 of 1995 to provide water and sanitation services in all towns and market centers in the central region except Lilongwe City.  Applications are invited from suitably qualified and experienced persons to fill the following vacant position within Central Region Water Board.  Position: Senior Engineer (Planning) CRWB 4  Purpose, Roles and Responsibilities  Provide corporate planning services.  Key duties and responsibilities  Organizes programs that lead to the identification, assessment and monitoring of both ground and surface water sources  Coordinates teams in conducting water supply feasibility studies through surveys, data gathering, analysis and producing related reports.  Assists in the evaluation of Projects execution done by Project management division.  Produces monthly work progress reports.  Attends various relevant meetings with stakeholders to represent interests of the Board... and responds to complaints and queries related to planning matters  Provides technical guidance to the Board on issues of engineering corporate plans.  Provides technical guidance in policy analysis and review: monitoring: evaluation and research; program planning and budgeting;  Coordinates the preparation of proposals  Any other relevant related tasks that he/she may from time to time be reasonably requested to perform.  Minimum academic and professional qualifications and experience  BSc Degree in Civil, Environmental or Water Resources Engineering plus 4 years experience at Engineer Level  How to apply  If you feel you fully qualify for the position, as per above specifications, please submit your Curriculum Vitae containing details of three (3) traceable referees and a covering application letter in sealed envelope clearly marked the position you are applying for;  The submissions of the vacancy applied for, should be made not later than 7th October, 2022 to the:  Chief Executive Officer  Central Region Water Board  Private Bag 59  Lilongwe"
  },
  {
    "title": "Associate, Engineering (Malawi)",
    "company": "Evidence Action",
    "location": "Blantyre",
    "description": "Dispensers for Safe Water  Blantrye, MalawiAbout Evidence ActionOur organization was founded in 2013 to address a big gap in the fight against global povertymany of the most promising interventions are either implemented at a very small scale, or not at all. We set out to address this gap by building programs that would scale evidence-based and cost-effective interventions, leading to significant improvements in quality of life for hundreds of millions of people.Our model worked. In less than a decade, our two flagship programs, the Deworm the World Initiative and Dispensers for Safe Water, have grown to measurably impact over 280 million people each year. This success is achieved through the dedication and talent of our staff, the hard work of our partners, and the commitment of our supporters.By 2024, we seek to double our impact. We are strengthening and expanding our existing programs, and working to identify a new generation of evidence-based and cost-effective interventions... that we can scale to reach millions more.Job PurposeAssociate, Engineering position is primarily a workshop/warehouse-based position which plays an important role in the expansion of Chlorine Dispenser and In-Line chlorination programs in delivering safe water and hygiene knowledge in the targeted communities. The position is based at the workshop (in Blantyre-Malawi) and reports to the Senior Associate Engineering.The Associate will be part of the programs technical team, playing an important role in leading dispenser supply and logistics management, supporting product development activities and contributing to the overall chlorine dispenser safe water and ILC intervention.Key ResponsibilitiesProcurement of DSW materialPlace orders for materials as per the projection with support of the procurement specialist.Projection of the program requirement Hardware/devices Design-Support the Manager: Engineering in making improvement in the design of the Generation 3.5 Liquid Chlorine dispenser and ILC devices. Dispenser Workshop ManagementResponsible for overall management of the chlorine dispenser hardware and ILC devices assembly.Coordinate assembly of chlorine dispenser hardware within quality standards, including management of workshop staffManage workshop finances  including management of petty cash, quarterly budget projections, and internal financial management and billing for chlorine dispenser hardwareResponsible for managing workshop inventory and maintaining appropriate securityAct as a liaison between management and staff to make sure priorities are aligned and objectives are achieved Program SupportManaging relationships with local suppliers, including production timelines, quality control and general process improvementsManage field trials on dispensers for safe water hardware or ILC devices or any other innovation. Hardware MaintenanceMonitor hardware functionality in field sites by use data provided by MLISEnsure that the program has the necessary material and tools for dispenser hardware and ILC devices.Make design improvement to ensure a robust product in the fieldTraining-You will be involved in technical and engineering training to the staff and partners.Required Competencies and AttributesHigh level of integrity and stewardshipEmbraces team work and aspires and supports the ideals of working in a team work environment as a team championSelf-driven and highly motivated to deliver results within tight deadlines.Good communication skills and mobilization skills. Ability to communicate well within the organization and with the rural communities and local leadersBasic leadership skills in managing people, working with communities and teamsGood computer skills and comfort to advance the skills in a dynamic IT field.Proactive and ambitious to support innovation and change in a dynamic working environmentPositive attitude to work and to develop in a fast-paced work environmentIndependent, proactive and willing to take initiativeEnthusiastic to take on a role with significant responsibility while developing personally and professionallyKeen to quickly step into a position in a fast-paced, rapidly-growing programMotivated by the programs high potential for widespread impact on global healthInterested in a work environment that is flexible, creative, and constantly changingDemonstrations of enthusiasm and commitment in the discharge supply and logistics dutiesQualifications, Experience and SkillsExperience in manufacture, assembly3-5 years work experienceA Degree in Mechanical Engineering, Manufacturing Engineering or Product DesignExperience with injection molding (desired)Experience taking a project through different stages in the product lifecycle, from concept to large-scale production and distributionExperience developing design specifications, supervising quality control, and conducting field tests of product prototypesEqual Opportunity Statement Evidence Action does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor"
  },
  {
    "title": "Community Development Officer",
    "company": "Water Mission",
    "location": "Lilongwe",
    "description": "This position is located in Lilongwe, Malawi. We are accepting applications through September 15, 2023.  Who is Water Mission?  Water Mission is a nonprofit Christian engineering organization that designs, builds, and implements safe water, sanitation, and hygiene (WASH) solutions for people in developing countries and disaster areas. Guided by love, excellence, and integrity, we are driven to share clean, safe water and Gods love with all. We have served more than 8 million people in 59 countries. Working at Water Mission is as much a calling as it is a career, and we are searching for people with the courage, passion, and drive to help us change the world. Read more about our Statement of Faith and Christian Mission.  What is the opportunity?  Position of Community Development Officers (2 positions). The position reports to the Community Development Coordinator and is based in Lilongwe, Malawi but requires frequent travel to remote locations.  The successful Community Development... Officer will perform the following duties and responsibilities:  Implementing community development activities in Water Missions Safe Water Project Areas.  Implementing disaster response activities.  Carrying out assessments in a timely and efficient manner.  Conducting Water Sanitation and Hygiene (WASH) education to safe water targeted communities.  Providing capacity building and support to Safe Water Committees (SWC) in the sustainable management of safe water projects.  Preparing project activity reports and timely updating of the Water Missions reporting database.  Collaborating with other WASH stakeholders in ensuring smooth implementation of WASH services to communities.  Participating in the development of project proposals for continuity of WASH services.  Monitoring and evaluation of Safe Water Projects to ensure the projects are effectively serving the communities.  Perform any other duties as assigned from time to time.  What is required?  Bachelors degree in Community Development or a related field.  Minimum 3 years of work experience in WASH sector or Community Development.  Advanced skills with MS Office computer programs (Word, Excel, PowerPoint, Internet).  Excellent verbal and written communication skills (English, Chichewa and any indigenous languages).  Professing testimony of Christian conversion and belonging to a Christ Centered Church.  A clear calling to Christian service and integral mission.  High level of impeccable integrity, stewardship, and team player.  Excellent, analytical skills.  Excellent participatory facilitation skills.  Excellent team building and relationship skills.  Must have a valid driving license.  Application email or URL: https://watermission.bamboohr.com/careers/278"
  },
  {
    "title": "Program Manager, Food & Water Systems",
    "company": "CARE",
    "location": "Malawi",
    "description": "CARE is an international NGO with local staff and community partners in more than 90 countries. We create local solutions to poverty and inequality and we seek dignity for everyone every day and during times of crisis. These solutions have a broad range, from clean water to access to education; from microfinance to ensuring that everyone has nutritious food; from agriculture and climate change to disaster response. CARE puts women and girls at the center of everything we do because they have proven to be the best hope for creating lasting change in the world. Our staff live where they work, which makes us effective at understanding the challenges they face. Weve been doing this for over 70 years, since World War II. It started with the worlds first CARE Package of food for the post-war hungry in Europe. Our work today is as important as ever, we believe that poverty and inequality are historic injustices that we can end within a generation, for good. If you share our core beliefs... poverty is an injustice; poverty is solvable; and together, we have the power to end it, join us, and fight with CARE.Gender equality and empowerment of women and girls is at the center of CAREs Food and Water Systems (FWS) programs. CARE commits to support 75 million people, majority of them women and girls, to fulfill their rights to food, water and nutrition security as part of CAREs Vision 2030.CAREs proven, women-focused Farmers Field and Business School (FFBS) approach helps small-scale farmers build the skills they need to increase production, improve resilience, adapt to climate change, diversify diets and boost nutrition. Since 2014, FFBS has directly improved the lives of more than 2.5 million farmers especially, women and their families. CARE has now lunched a new global 6 years long program that will up-scale the FFBS model to new countries and promoting adoption of FFBS by governments. Up-scaling FFBS directly ties into CAREs strategic priorities contained in CAREs Vision 2030 and is aligned with CAREs Right to Food, Water and Nutrition Impact Area Strategy and the She Feeds the World (SFtW) strategic framework, which highlights FFBS as a critical lever for our work in food systems.The role of the FFBS Program Manager, reporting directly to the Gender Youth and Livelihoods (GYL) Director, will primarily be as follows:Responsibilities:Provide oversight for high quality FFBS scaling program implementation: the FFBS Program Manager will provide management oversight, guidance, and leadership to effectively implement the FFBS scaling initiative with quality and speed.Team management: lead, supervise, coach and regularly assess the performance of the staff reporting to her/him.Coordination and partnerships: s/he will chair the project steering committee; represent the project in relevant fora, inside and outside CARE; coordinate with relevant global and regional partners including FAO, IFAD, etc.; support country teams for effective collaboration with local, regional and national governments.Fundraising: s/he will engage with and support COs and fundraising teams to identify opportunities for levering the project funding with the potential funding sources.Qualifications:High education (Masters degree) on relevant topics (e.g. gender, development, agriculture, social studies).10 yrs. experience in the agriculture/food security sector, including field experience in a developing country context or within an international development organization.5 years of experience as project manager in the agriculture/food security sector.Training and experience on gender/women empowerment programing.Social skills, inclusive leadership skills, creativity and innovative mindset.Experience on FFBS, FFS or other community-based extension programing design and/or implementation.Excellent verbal and written communication skills in English.Preferred locations: Atlanta, DC, Kenya, Uganda, Burundi, Rwanda, Malawi, Zambia, Bangladesh, Niger, Turkey, Jordan, Colombia, Guatemala, Honduras How to applyTo apply for this position, please visit our website athttps://phg.tbe.taleo.net/phg02/ats/careers/v2/viewRequisition?org=CAREUSA&cws=52&rid=5818There are individuals who may use CAREs name and trademark in emails and on websites in an attempt to solicit fees from interested job-seekers. Some examples of these fees are placement fees or immigration processing fees. CARE does not use recruiting or placement agencies that charge candidates an up-front fee of any kind. Occasionally, CARE does employ recruiting or placement agencies to help us identify candidates for specific employment within CARE. If youre contacted by a legitimate recruiting or placement agency, there should be no charge to you. If you suspect that you have been a victim of fraud from someone purporting to be CARE, please contact us at *[email protected].***We provide equal employment opportunities (EEO) to all employees and qualified applicants for employment without regard to race, color, religion, gender, gender identity, ancestry, sexual orientation, national origin, age, handicap, disability, marital status, or status as a veteran. If youd like more information about your EEO rights as an applicant under the law, please click here. The closing date for this posting, if listed, is approximate. Job postings may be removed from CAREs career website at any time"
  },
  {
    "title": "WASH Project Officer",
    "company": "World Vision",
    "location": "Chiradzulu",
    "description": "World Vision is a Christian relief, development and advocacy organization dedicated to working with children, families and communities to overcome poverty and injustice. It is an international partnership of Christians whose mission is to follow our Lord and Savior Jesus Christ in working with the poor and oppressed to promote human transformation, seek justice and bear witness to the good news of the Kingdom of God. It is a child focused organization and its goal is sustained wellbeing of (150 million) children within families and communities especially the most vulnerable.  As a Child focused organization, World Vision is committed to the protection of children and does not employ staff whose background is not suitable for employment with children. All employment is conditioned upon the successful completion of all applicable background checks, including criminal record checks where possible.  World Vision International in Malawi therefore is currently looking for dedicated... professional Christians to fill the position below, under the Chiradzulu WASH for everyone which is a consortium project implemented by World Vision Malawi and Water for People for a period of 3 years to contribute towards Universal access to WASH services in Chiradzulu District. If you are passionate about child wellbeing and you are considering a career with a calling, we would love to talk to you.  WASH PROJECT OFFICER (Grade 14 ) 1 Position-based in Chiradzulu District  Purpose of the position:  Under the guidance of the Project Manager for Chiradzulu WASH Project, the WASH Project Officer will be responsible for implementation and district level coordination/ facilitation of WASH activities under the project. The position will provide technical leadership in community and school water supply, improved sanitation and hygiene promotion through hands on facilitation of the project in collaboration with the communities, schools, health existing social networks and partners. The position is also responsible for profiling the Chiradzulu WASH for Everyone in all relevant sector networks and technical working groups at district level.  Major Responsibilities:  i. Programme Implementation  Plans, organizes/ facilitates and implements project interventions within the District  Maintains programmatic accountability for programme activities within the districts including data collection for evaluation, record keeping of activities, and the completion of all necessary monthly progress and project -end reporting  Facilitates realization of project results that feed into the project outcomes.  Facilitates efficient and timely implementation of planned activities by all relevant committees, district and community partners to ensure the right techniques, methodologies and project standards are achieved.  ii. Partnership & Advocacy  Networks and collaborates with all local level stakeholders involved in WASH interventions in programme implementation and facilitate smooth transition for sustainability in the program.  Represents the program on relevant local level committees, taskforces, etc., in order to promote coordination and collaboration with other stakeholders and relevant efforts whenever possible  Work closely with Councils in identifying, training and mentoring Water Point Committees, Water User Association and other management committees on sustainable water and sanitation management.  Works closely with the relevant government ministries staff at different levels for the project implementation.  Facilitates strong and sustainable linkages between District Councils, water supply scheme management committees, and expert service providers to enhance sustainable management of water systems.  iii. Capacity building  Builds capacity of WASH structures at institutional and community levels.  Facilitates the training in development of Joint Action Plans in the target areas with other District stakeholders  iv. Programme monitoring and reporting  Provides technical support to the WMAs, HSAs, CDAs, SMC and community non implementation of the plans and submission of reports through monitoring and review sessions consistent with budgetary allocation and within the set time line.  In liaison with other project staff, participate actively in development of Monitoring and Evaluation plan for Water, sanitation, and hygiene component of the program in project area.  Reports on project implementation progress  v. Learning and Innovation  Participates and contribute in the development of Joint Reviews of interventions in the target areas with other district stakeholders  Leads the development/review of training manuals, checklists, and advanced monitoring tools on water scheme whicha0enhanceu00a0schemeu00a0performance, monitoring, reporting, and data management.  Lead teams in conducting Knowledge, Attitude and Practices (KAP) surveys including willingness to pay and customer satisfaction surveys in all targeted areas.  Knowledge, qualification and experience equired:  Minimum Bachelors Degree in Civil Engineering, Water Resources Management or Public/Environmental Health. Minimum of 5 years experience in implementing WASH projects in NGO settings.  Must have a Valid Motorcycle License  Knowledge of using GIS/m-Water for data collection and reporting  Demonstrated community mobilization and Stakeholder engagement skills.  Demonstrated experience in successful project design  Demonstrated Knowledge and experience in Construction works supervision  Demonstrated success in project implementation.  A good understanding of the requirements in the implementation, monitoring, evaluation, and reporting of international grant funds; its effectiveness and accountability  Must be flexible, able to work under tight deadlines and have excellent follow through skills. Be a self-starter and work with limited supervision  Excellent verbal/written communications, presentation skills and good analytical skills  Experience and knowledge in management of Gravity Fed/Solar reticulated drinking water systems.  Demonstrated performance of achieving Open Defecation Free (ODF) Status for at least 2 Tradition Authority.  Experience and Knowledge of Development work related issues in Malawi.  Competent in use of MS Word, Excel, and a statistical analysis program (preference for SPSS or Access)  Demonstrated community mobilization and Stakeholder engagement skills.  All interested applicants should send a cover letter with a detailed Curriculum Vitae with three traceable referees to: [email protected] not later than 4th November, 2022. Only short listed candidates will be acknowledged.  Disclaimer  World Vision Malawi does not use agents, nor solicit any form of payments for any application, training, interviewing, testing or any fees in connection with this recruitment. Report any acts of solicitation for payment and/or extortion to World Vision Malawi to the following; Tip offs Toll Free Line 847; [email protected]  Application email or URL: wvm_humanresources@wvi.org"
  }
]