[
  {
    "title": "Regional Coordinator",
    "company": "Global Water Partnership (GWP)",
    "location": "Beira",
    "description": "The proposed GEF-funded Management of competing water uses and associated ecosystems in Pungwe, Buzi and Save basins will be implemented by the International Union for Conservation of Nature (IUCN) and executed by the Global Water Partnership S"
  },
  {
    "title": "MOZAMBIQUE - LOGISTIC MANAGER (M/F) - MOCIMBOA",
    "company": "Solidarits International",
    "location": "Mocmboa da Praia",
    "description": "Job number: SRH05558  Status: Employee  Position: Missions  Country: Mozambique  Contract Type: Short term contract About us  Desired start date: 06/11/2023 Duration of the mission: 6 months Location: Mocimboa, Mozambique  SOLIDARITES INTERNATIONAL (SI) is an international humanitarian aid association which, since more than 40 years, has been providing assistance to populations affected by armed conflicts and natural disasters by meeting their basic needs for food, water and shelter. Particularly committed to the fight against diseases linked to unsafe water, the leading cause of death in the world, SI's interventions provide expertise in the field of access to drinking water, sanitation and hygiene promotion, but also in the essential area of food security and livelihoods. Present in some twenty countries, the SI teams  2500 people in total, made up of expatriates, national staff, permanent staff at HQ, and a few volunteers - intervene with professionalism and commitment while... respecting cultural norms. About the mission  Solidarits International intervened in Mozambique in March 2019 for a few months following the passage of Cyclone Idai, which hit the Province of Sofala and the city of Beira hard. Operations were suspended after the emergency phase and the mission closed. The evolution of the situation in Cabo Delgado province, hit by several cyclones and severely affected by the violent actions of armed groups claiming to be IS, which caused the displacement of nearly 700 000 people, led to an assessment in May 2021 and to the reopening of the mission. The assessment carried out in the most affected district highlighted needs, particularly in the WASH sector, and the lack of emergency actors. The mission has opened in a complex security and administrative environment, where access is a major issue.  Solidarits International was one of the first INGO actors to respond to the growing crisis in Cabo Delgado, leading emergency response and distributions in hard-to-reach areas. About the job  General objectives:  The Logistics manager will implement and supervise all logistics operations at his/her assigned base.  He/she will organize logistic support for programs, in keeping with Solidarits International procedures.  He/she will assist the base manager or the field coordinator in the implementation of safety rules.  The main challenges:  Rehabilitation of the base is not finalized  Log staff are not completely trained on link and other log tools  Lake of framework agreements/local market limited  Priorities for the 2/3 first months:  Continuing on the rehabilitation of the base  Implementing framework agreements  Improving the log pack  Improving the stock management  Training the staff  Your profile  Education / academic background:  Diploma in Supply Chain  Specific skills and experience:  Management of the supply chain and operational logistics: procedure, strategy, import/clearance, tool tracking, archiving, ...  Expertise in the technical areas of logistics  Team management (training skils / team building)  LINK / office 365  SI procurement process  Finance  Languages:  English  Portuguese SI will offer you  A salaried position: According to experience, starting from 2310 gross per month (2100 base salary + 10% annual leave allowance paid monthly) and a monthly Per Diem of USD 750.  SI also covers accommodation costs and travel expenses between the expatriate's country of origin and the place of assignment.  Breaks: During the assignment, a system of alternation between work and time off is implemented at the rate of 7 working days every three months (with a USD 850 break allowance, allocated by Sl). To these breaks periods, SI grants one (1) additional rest day per month worked.  Insurance package: Expatriates benefit from an insurance package which refunds all healthcare expenses (including medical and surgical expenses, dental care and ophthalmological expenses, repatriation) and a welfare system including war risks. Essential vaccination and antimalarial treatment costs are refunded.  LIVING CONDITIONS:  Live in the compound : GH + office + warehouse are a same place.  Guest House conditions : Basic, cold shower and electricity.  curfew 6 p.m.  Cook make a good food for lunch and dinner. Market is limited but some food come from Pemba with the visitor!  Internet and telephone network : Some instable network but whatsapp work to call other countries  Restaurant & social life : one restaurant identify; MSF team available to lunch with us. Palma saturday available to go in other restaurant in Palma (with swimmimg pool) Application process  Do you recognize yourself in this description? If yes, please send us your CV and cover letter!  Please note that CV-only applications will not be considered, and that the vacancy may close before the deadline.  Thank you for your understanding.  To learn more about Sl: www.solidarites.org  --  Solidarits International (SI) est dtermin  prvenir et  combattre tout type dabus  tout acte dexploitation, dabus et/ou de harclement sexuels (SEAH)  lencontre des membres des communauts bnficiaires ou de ses collaborateurs et collaboratrices, atteinte aux personnes et/ou aux biens, fraude, corruption, conflit dintrt non dclar, financement dactivits portant atteinte aux droits de lhomme - qui pourrait tre perptr dans le cadre de ses interventions. SI applique une tolrance zro  lgard de tout type dabus, particulirement des actes de SEAH.  Solidarits International est un employeur quitable qui combat toute forme de discrimination. SI ne demandera jamais une rtribution quelconque en vue de participer  un processus de recrutement.  Solidarits International (SI) is determined to prevent and fight all type of abuse  all act of exploitation, abuse and/or sexual harassment (SEAH) against members of beneficiary communities or collaborators, fraud, corruption, violation of persons and/or property, funding of activities harmful to human rights  that could be perpetrated in the frame of its interventions. SI implements a zero-tolerance policy regarding acts of abuse, notably acts of SEAH.  Solidarits International is an equitable employer committed to find all forms of discrimination. SI will ever ask for any remuneration to take part in a recruitment process. Apply"
  },
  {
    "title": "SHORT TERM CONSULTANT for WATER SANITATION AND HYGIENE (WASH) SERVICES",
    "company": "IsraAID",
    "location": "Pemba",
    "description": "Background  IsraAID is an Israel-based non-governmental organization that was founded in 2001 and has since its inception worked in emergency and long-term development settings in over 55 countries. IsraAIDs mission is to support people affected by humanitarian crises by partnering with local communities around the world to provide urgent aid, assist recovery, and reduce the risk of future disasters. IsraAID has operated in Mozambique since 2019 in the Provinces of Sofala and Cabo Delgado responding to different humanitarian crises, including cyclones Idai and Eloise, COVID-10 outbreak and displacement triggered by the armed conflict.  IsraAID is implementing a 1-year project on Child Protection and Water, Sanitation and Hygiene (WASH) titled Child Well-Being (CWB). The CWB project is being implemented in 7 primary and secondary schools in the districts of Metuge and Ancuabe (Cabo Delgado).  This project aims to build the resilience of communities affected by the armed conflict... including internally displaced children, by building the schools capacities in MHPSS and Child Protection as well as ensuring access to clean and safe water while adopting safe hygiene practices. The access to clean and safe water component of the project shall be carried out in one of the selected schools in Metuge, Impires Basic School, while the hygiene promotion activities shall be carried out in all the seven schools as confined to this assignment.  Consultancy Objectives:  The overall objective for this consultancy is to oversee the WASH component of the project, including the technical aspects of the construction of the water point at Impires Basic School as well as building the capacities and creating adapted content and materials for the hygiene promotion activities with children and their caregivers.  The Consultant will work under the in-country supervision of the Programme Manager and will also report remotely to the WASH Coordinator and the III Coordinator based in Tel Aviv.  The consultancy services will contribute to:  I. Children in targeted schools improve psychosocial well-being  Ii. Improved quality and availability of WASH facilities in Schools  Iii. School committees (e.g. PTAs, youth groups) are effectively promoting WASH standards and behaviors  In order to achieve the project objective ii i.e. Improved quality and availability of WASH facilities in Schools, IsraAID intends to drill and equip one borehole in the Basic School of Impire (Metuge District) and deliver trainings on maintenance of the infrastructure, water management and hygiene promotion to a Water Committee that will be in charge of overseeing the infrastructure.  The target group for the training will be the members of the Water Committee that will be in charge of managing the water infrastructure in Impires Basic School.  In order to achieve the project objective iii i.e. School committees (e.g. PTAs, youth groups) are effectively promoting WASH standards and behaviors, IsraAID intends to deliver a informative sessions to teachers from the seven schools of the project for them to conduct KAP surveys to identify needs and gaps around hygiene promotion and assess the impact of the intervention, and to train community mobilizers that will facilitate community-based raigin-awareness sessions.  The target group for the KAP survey informative session will be the teachers/members of the school council from all the projects schools that will be conducting the assessments. The informative sessions for the hygiene promotion activities will be delivered to community mobilizers (e.g.: religious leaders, youth groups, etc.) but the target group of the awareness-raising activities will be children and their caregivers.  Expected Outputs/Deliverables:  Elaboration of Terms of Reference (ToR) for the procurement of a constructor/drilling company to drill and equip the borehole in Impires Basic School;  Lead and supervise the overall process of borehole drilling including obtaining the permits from relevant authorities (province and district level), the requirement and negotiations with constructor/drilling company, logistics, procurement processes, etc.;  Oversee and ensure the quality of the installation of an adequate pump (Environmental policy, Quality of construction material, pumping test and water quality tests, etc.);  Conduct an assessment and design KAP surveys to understand the existing WASH-related gaps and needs in the projects schools that will determine the activities to be implemented at the community level as well as to assess the impact of the intervention;  Develop content and materials in Portuguese, Emakua and Makonde according to the assessments results for building the capacity of the Water Committee and to orient hygiene promotion activities targeting children and their caregivers;  Identification and delivery of a 5-days technical training to the Water Committee that will manage the water infrastructure at Impires Basic School, including contents on maintenance of the infrastructure, water management and hygiene promotion;  Deliver a 2-days refresher training session to the Water Committee;  Deliver an informative session on creative ways to engage in hygiene promotion with children and their caregivers to 7 identified community mobilizers that will facilitate quarterly hygiene promotion raising-awareness sessions and activities at schools and at the communities (in close coordination with IsraAIDs III Coordinator);  Oversee the implementation of WASH programmes, ensuring high quality and timely delivery of all programme activities and deliverables and ensuring that the objectives are ultimately met;  Conduct a post assessment to evaluate the process;  Compile and submit a final report of the activities and outputs delivered by the consultancy, including best practices, lessons learned and recommendations.  Qualifications and required competencies for the Consultant:  a) MUST be a Mozambican national or authorized to work in the country.  b) Masters Degree in one of the following academic backgrounds: Social sciences and development, environmental management, water engineering, development studies, public health & sanitation or related field;  c) At least 5 years of demonstrated experience in carrying out similar assignments within Cabo Delgado;  d) Strong analytical, facilitation, training and communication skills as well as negotiation skills;  e) Good understanding of inclusive WASH issues;  f) Demonstrated understanding, experience and application of inclusive WASH principles and concepts is an added advantage;  g) Excellent writing and reporting skills in both English and Portuguese and ability to conceptualize WASH issues (fluency in Emakua and/or Makonde will be an advantage);  h) Ability to work efficiently and deliver on committed outputs under the assignment within agreed timelines and deadlines.  Contractual conditions  a) The Consultant shall be a person of high integrity and competence in the application of the tasks at hand for the assignment.  b) Except with prior agreement with IsraAID, the Consultant shall not publicize or make public through media or in private any of the raw or finished material, recommendations or information provided within the framework of this contract.  c) All reference materials belonging to IsraAID that the Consultant may have in possession by virtue of the contract shall be surrendered to IsraAID at the end of the contract.  d) The Consultant shall split their working time between field and office on a ratio of 40% field work and 60% office work.  e) The Consultant shall have to adhere and comply with IsraAIDs Code of Conduct, PSEA policy and Child Safeguarding Policy.  f) In case of conflict arising from the implementation or execution of this contract, the parties agree to do their best to avoid legal action, but shall seek arbitration from a third party acceptable to both parties.  How to apply  Application Submission process  Applications should be submitted by e-mail to moz@israaid.org until July 16th 2023, including CV, Cover Letter and three professional references. In the email subject indicate the title of the position WASH Consultant MOZAMBIQUE"
  },
  {
    "title": "Water Sanitation and Hygiene Expert, MozMEL Activity",
    "company": "Tetra Tech",
    "location": "Moambique",
    "description": "Management Systems International (MSI), a Tetra Tech Company, is a Washington, D.C. metro area management consultancy with a 40-year history of delivering results for our clients. Our expertise is in the fields of monitoring and evaluation; democracy and governance; peace and stability; rule of law and accountability; education; gender and inclusion; strategic communications; and leadership and organizational development. MSI has implemented projects in 90 countries around the world such as Colombia, Indonesia, Jordan, Kenya, Mexico, Nigeria, Pakistan, Syria and Ukraine, and works domestically. We support clients ranging from the U.S. Government (e.g., the U.S. Agency for International Development, U.S. Department of Defense, U.S. Departments of State and Labor, and the Millennium Challenge Corporation) to large bilateral and multilateral donors (e.g., the World Bank and the United Nations Development Program). We also work with national and local governments, nongovernmental... organizations (NGOs), think tanks, foundations and universities. For more information, please visit our website at www.msiworldwide.com.  Project Summary  MSI implements USAIDs Mozambique Monitoring, Evaluation and Learning (MozMEL) Activity. MozMEL is a five-year initiative to support the USAID Mission in Mozambique with rigorous monitoring, evaluation, learning, training, logistical support, and other related tasks. USAIDs Bureau for Humanitarian Assistance (BHA) has engaged MSI to conduct third-party monitoring (TPM) that will monitor, verify, and evaluate BHA-funded activities in Mozambique.  Please note: All citizenships are eligible for this position.**  Position Summary  The Water Sanitation and Hygiene (WASH) Expert will support Third-Party Monitoring (TPM) across multiple BHA-funded activities in Mozambique. The WASH Expert will work closely with MSIs TPM team and the TPM Lead to provide regular support and guidance in WASH-related areas of TPM design (e.g., water trucking, infrastructure, water testing etc.), tool development, training, data collection, data analysis, data management, research and reporting responsibilities for MozMEL. The WASH Expert will also have additional tasks as agreed upon with the MozMEL Chief of Party (COP).  Responsibilities  Provide surge support to the WASH TPM team, to include inputs into reporting with summary statistics, brief description write-ups, and identification of recommendations for USAID using existing TPM templates and monitoring data.  Contribute to development of data collection instruments in consultation with the MozMEL team including the data collection team.  Join the data collection efforts including conducting interviews, direct observations, and document reviews.  Conduct relevant tests (e.g., Free Residual Chlorine testing), and verification of WASH infrastructure Bill of Quantities (BoQ) specifications.  Support TPM report development, especially sections related to their subject matter expertise.  Qualifications  Bachelors degree is required.  Minimum five years experience in WASH, including at least two years of experience working on WASH interventions in Cabo Delgado is required.  Experience conducting trainings and interviews in addition to collecting data is required.  Experience working on USAID or other international donor-funded WASH interventions is required.  Strong analytical, written, and verbal skills is required.  Oral and written fluency in Portuguese is required. Working knowledge of English and oral fluency in some of the Cabo Delgado local languages is preferred.  Deadline for applying for this position - October 10, 2023, 18:00 Mozambican time*  MSI is an equal opportunity employer that values diversity and inclusion. We strive to develop and maintain a culture that honors the perspectives and identities of our employees, our communities and those impacted by our work.  We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants and employees religious practices and beliefs, as well as any mental health or physical disability needs.  MSI is an Equal Opportunity Employer/Affirmative Action/Americans with Disabilities/Veterans Employer.  Reasonable Accommodations  MSI is dedicated to hiring an inclusive workforce. If you would like to request reasonable accommodations during the application process, please visit Tetra Techs Disability Assistance Page. Our recruitment team looks forward to engaging in an interactive process to provide reasonable accommodations for candidates.  Only candidates who have been selected for an interview will be contacted. No phone calls, please.  Additional Information  Organization: 216 MSI"
  }
]