[
  {
    "title": "Water Treatment Operator",
    "company": "CCBA",
    "location": "Oshakati",
    "description": "Coca-Cola Beverages Africa (CCBA) is the largest African Coca-Cola bottler, accounting for 40% of all Coca-Cola volumes on the continent. CCBA has an extensive footprint in Africa, employing over 17 000 employees, serving a combined population of over 300 million people across the continent.  The CCBA vision is to refresh Africa every day and make the continent a better place for all, growing successfully as a business and creating a better shared future for our people, customers, consumers, communities, planet and shareholders. We conduct ourselves with the utmost integrity for shared value and the greater good. We are a world class, customer-orientated, socially and environmentally conscious fast-moving consumer goods (FMCG) company that is driven by engaged, motivated and inspired employees.  Coca-Cola Namibia Bottling Company requires the services of a Water Treatment Operator, reporting to the Plant Engineer. The Water Treatment Operator will ensure that water used in the... bottling process meets the quality requirements.  Key Duties & Responsibilities  Operate the water treatment plant  Conduct all operational tests  Ensure sufficient stock available to carry out the necessary operation in the water plant  Identify potential hazardous practices and conditions within the process and initiate appropriate actions to prevent accidents.  Housekeeping according to 5S standards  Ability to conduct basic maintenance of plant and equipment in utility  Apply problem solving techniques to identify problems and carry out corrective actions  Analyze data, control charts and trend analysis to identify opportunities for continuous improvement  Agile in thinking and nimble in decision making  Direct outsourced technical support on safety standards and ensure adherence to safe work practices.  Skills, Experience & Education  Grade 12  Bachelor degree of Sciences or Diploma in Chemistry or National Vocational Certificate in water care or Management  Minimum two (2) years experience as an Operator in a Water treatment plant conducting tests preferably in a bottling industry  Ability to work constructively within a team  Performs and facilitates execution of administrative activities  Good numerical skills  Good understanding of hygiene requirements  Availability to work shifts and over weekends  Results driven & process orientated  Resilient and energetic"
  }
]