[
  {
    "title": "WATER AND HABITAT ENGINEER",
    "company": "Lextorah LDS",
    "location": "Lagos",
    "description": "Company Description  The ICRC is an impartial, neutral and independent humanitarian organization  Job Description  Assist the direct superior on the field assessment  Do technical proposals for Wathab interventions  Assist the Direct superior in the reporting of Field Trip, and participates with his/her technical inputs on the Monthly wathab Reporting  Contribute to the implementation and running of specific projects / programs, mainly independently  Maintain contacts with interlocutors / authorities at local level mainly independently  Qualifications  Bachelor degree in Geology/Engineering, some college coursework completed, an Associate Degree or equivalent higher education degree in water supply, sanitation, construction, engineering or any related technical field.  2-5 years of experience in water supply, sanitation, construction, engineering or similar technical position  Good command of written and spoken English  Good knowledge in computer skills  Familiarity with the standard... norms and rules in construction, local techniques and requirements for construction  Driving license  Additional Information"
  },
  {
    "title": "Senior Engineer Water Solution",
    "company": "Lextorah LDS",
    "location": "Lagos",
    "description": "Company Description  A reputable company based in Lagos is looking for suitable candidates for the following vacancies:  Job Description  The incumbent will be an integral part of a team vested with the responsibility of providing solution for refinery/petrochemical organization, power and industrial plants.  Carry out water advanced treatment, seawater treatment/sulfate and removal.  Carry out produced and process water treatment, waste water treatment.  Provide water treatment services (including flow back and mobile reverse osmosis) and produced water system.  Provide environmental services including VOC and H2S  Qualifications  Minimum requirement of a B.Sc in Chemical Engineering or petrochemical engineering.  Minimum of 5 years experience in:  SX/IX (solvent Extraction/ion exchange).  Industrial water treatment, physical/chemical analytical techniques.  Ore, slurry and solution sampling techniques, equipment sizing techniques.  Thermodynamics, solution chemistry and... chemical reaction.  Solvent extraction and ion exchange.  Must possess skill at hydraulics design of the treatment plant and general knowledge of other water related infrastructure such as pumps, pump stations, pipe lines"
  },
  {
    "title": "Factory Workers",
    "company": "Aquarkice Water Company",
    "location": "Lagos",
    "description": "Job Description  We seek Factory Workers who are ready to work with honesty.  Requirements  Candidates should possess minimum of FSLC qualifications with relevant work experience."
  },
  {
    "title": "Motor Boy / Stacker",
    "company": "Aquarkice Water Company",
    "location": "Lagos",
    "description": "Requirements  Candidates should possess minimum of SSCE / GCE / NECO.  Must live within Alimosho Local Government area or closer.  Candidates within Idimu, Council Bustop, Ikotun and its enviros will be most preferred."
  },
  {
    "title": "Water Supply Manager (DP World Project)",
    "company": "confidential",
    "location": "Bauchi",
    "description": "Job Description  Water Supply Manager (DP World Project)  Bauchi state, Nigeria  Deadline: November 9,  Contract type: 2 years (fixed term)  Location: Bauchi, Nigeria  WaterAid Nigeria has recently completed its - country programme strategy which sets a 5-year building block towards delivering a more influencing-led programme over a 10-year horizon. This new country strategy rather than reflect a progression from previous country programme strategies, outlines key shifts in focus required to catalyze change and achieve maximum impact for our work in Nigeria.  The Water Supply Manager will support initiatives that leverage DP World's investment to improve access to sustainable climate resilient WASH services in a selected community in Bauchi State building on ongoing interventions to reach underserved populations through construction of solar powered water schemes. s/he will lead in the use of behaviour centered design approaches to implement hygiene behaviour change intervention to... promote key hygiene behaviours in small-towns and/or rural communities as well as contribute to economic empowerment of women by training them to be kiosk managers, to maintain, operate and manage the water schemes and to be part of community WASH structures.  Key Deliverables include; Ensure that Partner Organizations are fully informed of the program's guiding principles and mainstream them towards implementation of sustainable WASH services Monitoring the performance of service providers such as contractors or utility companies to ensure that services are being delivered satisfactorily Support scheduling regular maintenance for equipment such as boilers, air conditioning systems, pumps, or water treatment facilities Overseeing the development of new utility systems or facilities Monitor and take responsibility for the delivery of quality work for programs in all thematic areas; ensure that all WaterAid Nigeria programs in Bauchi are grounded in WaterAid program quality standards and approaches; make informed decisions about program management to maintain quality and ensure execution of plans. Ensure programme designing, planning and budgeting are in line with the Country Programme Strategy (CPS) and Guidelines of the organization and donor's requirement. Advocate/facilitate networking and alliance buildings in respective programme areas Represent in various meeting/workshops/seminars, coordinate & facilitate all field visits, meetings with respective partner organizations, donor and other stake holders Promote a culture of knowledge management for WaterAid and partners in Bauchi state  To be successful in the Water Supply Manager role , you must meet the following requirements Bachelor's degree in engineering, hydrogeology, Business Administration or other relevant subject Minimum of 8 years of increasingly responsible experience in municipal utility maintenance, construction and repair of water systems, sewer systems and other Public Works activities, three years of which were in an administrative or supervisory capacity. Proven track record of reducing operational costs while maintaining or improving service levels Wide ranging experience in Strengthening of Water supply Systems to support sustainable delivery of services. Experience working with partners implementing grant funded projects. Strong programme/project management skills, including the ability to initiate, plan, manage and monitor programmes & projects; technical ability to develop programme plans/design log frames etc Experience of managing multiple project stakeholders including community level stakeholders; donors; government officials etc Experience of project documentation for use in influencing; writing case studies and success stories Excellent oral and written communication skills, including strong presentation skills Good planning & organisational skills. Able to manage own time, as well as plan and prioritise own and others work Above average competence in the use of IT tools. Proficiency in the use of Microsoft suite of computer applications-Word , Excel , PowerPoint etc. Experience in budget and financial management Commitment to WaterAid's values and a working style that reflects these  We started because no NGO like us existed. We'll end when no organisation like us is needed. In the meantime, we're making great progress - since , we have reached 25 million people with clean water and, since , 24 million people with sanitation.  We're looking for people who share a commitment to our vision. We're looking for people with an appreciation and respect for different people and ideas, and the energy and expertise to help tackle the most important challenges.  In return, you can expect to get inspiration from the change you help make happen, a sense of belonging and the feeling of being part of a global community. You will also experience stimulation and fulfilment, the chance to grow, and space to be yourself at your best. This is our pledge to you.  If you are interested in the position and have the right skills and attributes, kindly apply clicking on this LINK  Please note: to apply for this role you must be able to demonstrate your eligibility to work in Nigeria.  WaterAid is an equal opportunities employer and positively encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity. We particularly encourage applications from women who are underrepresented at this level in the organisation.  WaterAid is committed to ensuring that wherever we work in the world there is no tolerance for the abuse of power, privilege or trust. WaterAid reinforces a culture of zero tolerance towards any form of inappropriate behaviour, abuse, harassment, or exploitation of any kind. The safeguarding of our beneficiaries, staff, volunteers and anyone working on our behalf, is our top priority, and we take our responsibilities extremely seriously. All staff and volunteers are required to share in this commitment through our Global Code of Conduct.  Only candidates shortlisted for interviewing will be contacted within two weeks of the closing date for applications.  No recruitment agencies please"
  },
  {
    "title": "Water Treatment Plant Manager-Professional Engineering Goods and...",
    "company": "Smart Partners Consulting Limited (SPCL)",
    "location": "Lagos",
    "description": "Location: Lagos Employment Type: Full-time Job Summary The ideal candidate will be responsible for the overall operations within a water treatment facility, ensure proper operation of Water Treatment Plant and Distribution System, as well as the installation, maintenance and repair of all Water System Facilities. Responsibilities Oversee the treatment, distribution and daily operations of water treatment facilities. Supervise teams of operators, institute plant policies and procedures, direct training programs and complete employee performance reviews. Ensures that the plant and its operators comply with state health standards by regularly testing the water supply and keeping meticulous records. Ensures adequate water supply and delivery of water meeting all quality standards. Ensures scheduled maintenance and calibrations of all water treatment equipment is completed on the appropriate schedule. Ensures that all system emergencies are addressed in a timely manner and causes are... determined and remedial plans developed. Responsible for the administrative functions of the department including: Operations employee safety program implementation and updates. Responsible for maintaining a safe work environment and ensuring all equipment is in proper working condition. Requirements Bachelors Degree in Chemical / Mechanical Engineering. Minimum of 4 years working experience in the field of Sales / Marketing of Oil & Industry products and similar positions. Driving License is an added advantage. Experience and / or certification in wastewater treatment is highly desirable. Open to both Nigerians and Expatriates (Indians). Application Closing Date Not Specified. How to Apply Interested and qualified candidates should send their CV to: talent@smartpartnersng.comusing the Job Title as the subject of the mail"
  },
  {
    "title": "Programme Development Advisor",
    "company": "WaterAid",
    "location": "Nigeria",
    "description": "About the role:  The primary focus of the role is to support Country Programmes and Regional Teams in both project and programme design.  The post holder will also support fundraisers during proposal development.  This will be both through supporting the development of specific projects, programmes and proposals, and through the capacity building of staff in project and programme design.  The post-holder will ensure that project and programme design follows WaterAid's Planning, Monitoring, Evaluation and Reporting PMER core procedures, will make recommendations for their improvement and will develop and identify key resources to support staff in the project design process.  You'll:  Lead, facilitate and support quality project design and set-up processes, focusing particularly on larger, complex or higher risk projects  Build organisational capacity in project design  Strengthen and develop organisational tools and guidance to support high quality project design  Work closely... with Country Programme staff during project design processes.  Work with the PMER Systems Advisor to ensure our management information system is aligned with our Project Design processes and outputs.  Work with Quality Programme technical advisors to identify/develop good practice examples of WASH projects that demonstrate the application of WaterAid's Quality Programme standards in project design.  Work with Fundraising and Finance teams to ensure alignment of organisational processes.  Work with non-UK WaterAid Member country staff e.g. Canada, Sweden, USA to support project design.  About you:  Significant proven experience in designing and managing complex projects with multiple stakeholders under rigorous deadlines;  Demonstrated ability to coach and train others in project design and implementation  Proven ability to work with technical programme advisors, fundraisers and finance staff in order to develop well-designed, high quality, suitably resourced projects with clearly defined monitoring and evaluation processes.  Excellent understanding of current challenges in project design in the international development sector and current initiatives to strengthen project design for improved effectiveness.  Strong written and verbal communication skills in English and the ability to influence effectively at all levels.  Strong interpersonal skills and networking skills with the ability to collaborate and build alliances internally and externally.  Graduate degree or equivalent professional qualification/experience in the WASH sector  Proven ability to work effectively with diverse cultures and adapt personal style to get the best out of others"
  },
  {
    "title": "Plant Operator /Water Treatment/",
    "company": "International Institute Of Tropical Agriculture",
    "location": "Ibadan",
    "description": "Job summary Plant Operator (Water Treatment) job in Oyo Carrying out operation and maintenance of water treatment plants Minimum of 2 years' experience in a similar role  Job seniority: associate level  Responsibilities  Carrying out operation and maintenance of water treatment plant, swimming pool plant, sewage treatment plant, and dam pumping stations  Dosing chemicals for processing of water and waste water  Cleaning water treatment plant, swimming pool plant, sewage plant, and pump stations and their surroundings  Taking hourly readings and recording them in daily operation production sheet  Performing any other job-related duties assigned by supervisor  Requirements  OND in Mechanical Engineering or related field  Minimum of 2 years' experience in a similar role in a well-structured environment  Good interpersonal and communication skills  Ability to run shift duty and work outside normal hours as needed  Good team player  Key Skills Needed  Mechanical Engineering ... Operation and maintenance of water treatment plants  Chemical dosing  Cleaning and maintenance  Record keeping  Interpersonal and communication skills  Shift work  Teamwork  Original job Plant Operator /Water Treatment/ posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Quality Control / Production Manager",
    "company": "Oasis Premium and Executive Water Company Limited",
    "location": "Ibadan",
    "description": "Job Description  Production Aspect:  Liaise with other managers to formulate objectives and understand requirements  Estimate costs and prepare budgets  Organize workflow to meet specifications and deadlines  Monitor production to resolve issues  Supervise and evaluate performance of production personnel  Determine amount of necessary resources workforce, raw materials etc.  Approve maintenance work, purchasing of equipment etc.  Ensure output meets quality standards  Enforce health and safety precautions  Report to upper management.  Quality Control Aspect:  Monitoring operations to ensure that they meet production standards  Recommending adjustments to the assembly or production process  Inspecting, testing, or measuring materials or products being produced  Measuring products with rulers, calipers, gauges, or micrometers  Operating electronic inspection equipment and software  Accepting or rejecting finished items  Removing all products and materials that fail to... meet specifications  Reporting inspection and testing data such as weights, temperatures, grades, moisture content, and quantities inspected"
  },
  {
    "title": "Plant Operator /Water Treatment/",
    "company": "International Institute Of Tropical Agriculture (Iita)",
    "location": "Oyo",
    "description": "Job summary Plant Operator (Water Treatment) 3-year renewable contract Location: Ibadan  Job seniority: associate level  Responsibilities  Carry out operation and maintenance of Water treatment plant, swimming pool plant, sewage treatment plant and dam pumping stations.  Dose chemicals for processing of water and waste water.  Clean water treatment plant, swimming pool plant, sewage plant, and pump stations and its surroundings.  Take hourly reading and record it in daily operation production sheet.  Perform any other job-related duties as may be assigned by the supervisor.  Requirements  OND in Mechanical Engineering or related field with a minimum of two (2) years experience performing a similar role in a well-structured environment.  The ideal candidate must have good interpersonal and communication skills and be able to run shift duty.  Be ready to work outside normal hours as the need arises.  Be a good team player.  Benefits  We offer highly competitive salaries with... equally attractive benefits and excellent working conditions in a pleasant campus environment.  Original job Plant Operator /Water Treatment/ posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Plant Operator /Water Treatment/",
    "company": "International Institute Of Tropical Agriculture (Iita)",
    "location": "Oyo",
    "description": "Job summary Plant Operator (Water Treatment) 3-year renewable contract Location: Ibadan  Job seniority: associate level  Responsibilities  Carry out operation and maintenance of Water treatment plant, swimming pool plant, sewage treatment plant and dam pumping stations.  Dose chemicals for processing of water and waste water.  Clean water treatment plant, swimming pool plant, sewage plant, and pump stations and its surroundings.  Take hourly reading and record it in daily operation production sheet.  Perform any other job-related duties as may be assigned by the supervisor.  Requirements  OND in Mechanical Engineering or related field with a minimum of two (2) years experience performing a similar role in a well-structured environment.  The ideal candidate must have good interpersonal and communication skills and be able to run shift duty.  Be ready to work outside normal hours as the need arises.  Be a good team player.  Benefits  We offer highly competitive salaries with... equally attractive benefits and excellent working conditions in a pleasant campus environment.  Original job Plant Operator /Water Treatment/ posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Online Water and Waste water Engineering Design tutor",
    "company": "TeacherOn.com",
    "location": "Lagos",
    "description": "Storm water expert  Level: Intermediate  Gender Preference: None  Meeting options: Available online - via skype etc."
  },
  {
    "title": "Factory Worker at Aquarkice Water Company",
    "company": "Aquarkice Water Company",
    "location": "Lagos",
    "description": "Factory Worker at Aquarkice Water Company, Interested and qualified candidates should see the job details and apply. Click for more Jobs at Aquarkice  Aquarkice Water Company is an ultramodern table water factory, with the best facilities to produce water for consumption. Our filtration method is second to none.  We are recruiting to fill the position below:  Job Title: Factory Worker  Location: Idimu / Ikotun Egbe, Lagos  Employment Type: Full-time  Factory Worker at Aquarkice Water Company  Job Description  We seek Factory Workers who are ready to work with honesty.  Requirements  Candidates should possess minimum of FSLC qualifications with relevant work experience.  Application Closing Date  11th December, 2023.  How to Apply  Interested and qualified candidates should send their Cover Letter and CV to: info@aquarkice.com using the Job Title as the subject of the email."
  },
  {
    "title": "Grant Manager WASH/ Nutrition and Climate Change",
    "company": "Water Supply And Sanitation Initiative",
    "location": "Katsina",
    "description": "Job summary The Grants Manager will contribute to achieving high quality programming through effective grants management The role involves compliance requirements, reporting, proposal development, and communication The Grants Manager also supports development of proposals and opportunity identification  Job seniority: mid-to-senior level  Responsibilities  Line manage Grants Officers  Ensure compliance with donor regulations and internal procedures  Manage donor and external reporting  Coordinate grant revisions  Establish effective channels of internal and external communication  Support proposal development and opportunity identification  Requirements  At least 5 years of relevant experience  Experience in donor relations and grants management  Experience in complex/insecure environments and with displaced populations  Good understanding of donor rules and regulations  Proven skills in report and proposal development  Good personal organizational skills and ability to... meet deadlines  Staff capacity-building experience  Fluency in English and Hausa  Good communication and interpersonal skills  Knowledge of NGO operations and the humanitarian sector  Above-average computer skills  Accountability and decision-making skills  Key Skills Needed  Strong understanding of WASH, nutrition, food security, and climate change issues  Experience working with diverse funding sources  Knowledge of monitoring and evaluation (M&E) principles  Strong interpersonal and communication skills  Familiarity with advocacy strategies  Capacity to stay updated on industry trends and best practices  Original job Grant Manager WASH/ Nutrition and Climate Change posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Recyclable Water Operator",
    "company": "CNG Glass Nigeria FZE",
    "location": "Nigeria",
    "description": "Job Summary  We are a leading Float Glass company seeking a skilled and experienced Recyclable Water Operator to join our team. As a Recyclable Water Operator, you will be responsible for operating and maintaining the recyclable water system to ensure the efficient and sustainable use of water resources in our manufacturing processes.  Job Description  Operate and monitor the recyclable water system in accordance with established procedures and safety guidelines.  Ensure the proper treatment, filtration, and distribution of recyclable water throughout the production process.  Conduct regular inspections of the water system, identify potential issues, and perform troubleshooting and repairs as needed.  Collaborate with the production team to optimize water usage and minimize waste.  Follow standard operating procedures SOPs to ensure the safe and efficient operation of the water system.  Maintain accurate records of water usage, treatment processes, equipment maintenance, and... any incidents or abnormalities.  Participate in training programs to enhance knowledge and skills related to water treatment and conservation.  Responsibilities  Operate and monitor the recyclable water system to ensure proper treatment and distribution.  Conduct routine inspections and perform maintenance tasks on water treatment equipment.  Troubleshoot and repair system malfunctions or abnormalities.  Collaborate with the production team to optimize water usage and minimize waste.  Adhere to safety guidelines and report any safety concerns or incidents.  Maintain accurate records of water usage, treatment processes, and equipment maintenance.  Requirements  High School Diploma or equivalent.  Previous experience as a Recyclable Water Operator or in a similar role within a manufacturing environment, preferably in the glass industry.  Strong understanding of water treatment systems and equipment.  Familiarity with water conservation practices and sustainability principles.  Proficient in troubleshooting and repairing water system malfunctions.  Knowledge of safety procedures and guidelines related to water treatment and operation.  Ability to work effectively in a team environment and collaborate with other departments.  Excellent attention to detail and strong problem-solving skills.  Good record-keeping abilities.  Strong communication skills.  Remuneration  The remuneration for this position ranges from N50,000 to N150,000 per month, depending on qualifications, experience, and performance"
  },
  {
    "title": "Human Resources Manager",
    "company": "Impact Water",
    "location": "Lagos",
    "description": "Job title : Human Resources Manager jobs in Lagos Job Location : Lagos Deadline : December 03, 2023 Quick Recommended Links  About the job  We are seeking a People Operations Manager to be directly involved in recruiting and staffing, training and development, and workplace culture and employee engagement.  The ideal candidate will be an HR professional with prior experience in working with large-scale operations and a passion for creating a positive and engaging workplace culture.  Responsibilities:  Implement HR strategies: Support the company's growth and success at our Kenyan office by carrying out our HR strategies.  Acquire new talent: Implement effective recruitment strategies, source potential candidates and advise on the selection of potential new hires.  Develop HR Policies: Collaborate to develop, improve, and implement Impact Water's HR policies.  Ensure compliance: Research and advise on local labour laws and regulations in Kenya.  Standardize HR: Coordinate with... the Global People Operations Team to ensure standardized implementation of HR services and support.  Improve employee onboarding: Co-manage and build the employee onboarding and orientation program with the Global Director of People Operations, to ensure new hires have a positive and engaging experience.  Build current employee skills: Advise on the development and implementation of employee training programs.  Manage the People Operations Associate: Ensure that they are effective and meet their targets of recruiting, interviewing and onboarding new field agents.  Improve field agent hiring: Work with the people operations department to improve the efficiency of the process for hiring field agents while continuously advancing the quality of our new recruits.  Experience and Skills Required  Bachelor's degree in Human Resources, Business Administration, or a related field  2+ years of experience in HR management  Proven experience in designing and implementing HR strategies that support the growth and success of a business  Strong knowledge of Kenyan HR laws, regulations, and best practices  Excellent leadership, interpersonal, and communication skills  Ability to work effectively with people at all levels of the organization  Strong project management and problem-solving skills  Ability to work in a fast-paced and dynamic environment  Ability to work independently and as part of a team  High level of integrity  English proficiency with 100% fluency; additional language skills are welcomed  Experience with HRIS systems and HR metrics and reporting preferred  Experience in the social enterprise sector in Sub-Saharan Africa is welcomed  Experience with international HR compliance is welcomed  Original job Human Resources Manager posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Planning, Monitoring, Evaluation and Reporting Manager",
    "company": "WaterAid",
    "location": "Abuja",
    "description": "The primary purpose of this role is to support the implementation of WaterAid Nigeria's country strategy by ensuring that all activities are properly included in realistic and achievable annual plans and to lead on the effective monitoring of progress of programme implementation against objectives.  Key Deliverables include;  Working with the Coordinator Planning, Strategy & Reporting, support WaterAid Nigeria's Senior Management Team SMT in the development and implementation of Country Programme plans and budgets in line with overall strategy  Coordinate and lead Monitoring and Evaluation activities with support from other departments and WaterAid UK, in line with WaterAid's frameworks.  Support full implementation and integration of global PMER requirement and standards across all areas of WANG's work  Generate organisational learning from monitoring and evaluation activities, document lessons learnt/case studies and share organisational learning with potential audiences and... users - both internal and external to promote and replicate best practices across the organisation and sector.  Participate in, support or lead relevant capacity building initiatives and workshops on PM&E targeting implementing partners  To be successful, you'll need:  University Degree in Development Studies, Public Health, Statistics or other relevant field  5 years post NYSC experience in planning, monitoring and evaluation preferably in an NGO setting. Experience in international research or development organisation may also be considered.  Knowledge / experience in knowledge management systems  Experience in community-based development  Experience of M&E in the water, sanitation & hygiene WASH sector  Fully committed to WaterAid's vision, mission and values and a way of working that demonstrates this, with the ability to communicate this enthusiasm to others"
  },
  {
    "title": "Call for Consultancy : Water Systems Specialist",
    "company": "SNV - Netherlands Development Organisation",
    "location": "Nigeria",
    "description": "Description: Company Description SNV is a mission-driven global development partner working in more than 20 countries across Africa and Asia. Building on 60 years of experience and grounded in the 2030 Agenda for Sustainable Development, we work on the core themes of gender equality and social inclusion, climate adaptation and mitigation, and strong institutions and effective governance. Together with our team of over 1,600 people, our mission is to strengthen capacities and catalyse partnerships that transform the agri-food, energy, and water systems, which enable sustainable and more equitable lives for all. SNV is expanding its operations into Nigeria, to meet market and corporate needs; recognizing the development challenges and potential development impact that exist in the country. As one of its focal sectors, SNV seeks to understand the water sector in Nigeria, and identify niches and opportunities for SNV, in line with its ambition to have water security for all. SNV is thus... commissioning a study to investigate the water system in Nigeria, and articulate opportunities where SNVs can add value with a particular focus on SNVs focal areas: Equitable Water Resource Management, Inclusive Sustainable Irrigation, Climate Resilient Rural Water & Sanitation and hygiene (WASH), Sustainable Urban Water Cycle. The objective of this study is to collect information that would Aid SNVs understanding of the water sector and identify value adding opportunities and partnerships for SNV. The key tasks to be performed are outlined as follows: - Develop an understanding of SNVs, strategy, strength, and experience as relevant for the water sector in Nigeria - Present an overview of the water sector in the country, highlighting status of the sector, barriers and challenges, trends, and outlook. - Assess the political economy of the water sector in the country including an understanding of Nigerias supply dynamics and access challenges. - Present an overview of water resource management in Nigeria and how it links to different use sectors including priorities, challenges, constraints, ongoing initiative - Develop a stakeholder mapping of the sector (including governmental actors, private sector companies, development partners, national and international NGOs, financiers & investors, and other market development actors), analyse donor funding trends and government priorities - Present an overview of Irrigation and WASH subsectors in Nigeria including, priorities, challenges, constraints, ongoing initiatives, and mapping of key stakeholders, donors, financiers & investors - Review cross cutting issues in the water sector - GESI, Climate adaptation and mitigation, Governance & Institutions - Assess and recommend key opportunities for SNV in the water sector highlighting niche, value add propositions, proposed interventions, including an assessment of strength, weakness, opportunities, and threats (SWOT). - Assess potential competition and beneficial partnerships for SNV in Nigeria. - Organize and conduct Key Informant Interviews (KIIs) if appropriate to further enrich findings from the study. - Develop an annotated list and summary of key policy and regulatory frameworks relevant for the water sector including relevant policies from other SNV focal sectors - Agriculture and Energy. - In addition to the assessment report covering the above points, produce a summary PowerPoint presentation which portrays key findings. - Present findings and identify 2-3 priority interventions, considering specific sub-sectors and/or approaches, potential partners and funders. The methodology for this will be a combination of literature review and key informant interviews. 4.0 Deliverables and Timeline: The consultant will produce the following deliverables: Deliverables Timeline : April - June 2023 1 - Inception report 2 - Country report containing assessment outcome and recommendations : 20 days 3 - Develop an annotated list and summary of key policy and regulatory frameworks relevant for the water sector : 3 days 4 - PowerPoint summary deck (max 20 slides) : 25 days Total: 25 days 5.0 Duration of the assignment: The Assignment is expected to be undertaken from April - June 2023. Final timings will be agreed upon appointment of the consultant and review of the inception report. Qualifications 6.0 Academic & professional qualifications, Knowledge and Experience: Qualifications required include: - 5+ years experience working in water sector in Nigeria. - More than 5+ experience developing and designing water system and WASH programme interventions. - Demonstrable knowledge and understanding of the Nigerian water sector including stakeholder activities, policy and regulatory framework, and private sector initiatives. - Experience performing assignments of a similar or closely related nature - Evidenced excellent writing, analytical, and communication skills to be supported by wo"
  },
  {
    "title": "Grant Manager WASH/ Nutrition and Climate Change",
    "company": "Water Supply And Sanitation Initiative",
    "location": "Dutse",
    "description": "Job summary The Grants Manager ensures effective grants management Manages donor and external reporting Supports proposal development and opportunity identification  Job seniority: mid-to-senior level  Responsibilities  Ensure compliance with grants management and reporting requirements  Manage donor and external reporting  Coordinate grant revisions  Support development of proposals  Establish and maintain effective communication channels  Line manage Grants Officers  Provide guidance on donor compliance regulations  Ensure integration of cross-cutting program elements into funding proposals  Stay updated on industry trends and best practices in grant management  Maintain high quality programming  Requirements  At least 5 years of relevant experience  Experience in donor relations and grants management  Experience working in complex/insecure environments  Good understanding of donor rules and regulations  Skills in report and proposal development  Personal... organizational skills and ability to meet deadlines  Staff capacity-building experience  Fluency in English and Hausa  Good communication and interpersonal skills  Cultural awareness and sensitivity  Capability to work independently and under pressure  Knowledge of NGO operations and the humanitarian sector  Above average computer skills  Accountability in decision-making and resource management  Key Skills Needed  Strong understanding of WASH, nutrition, food security, and climate change issues  Analytical and problem-solving skills  Collaboration with program teams  Interpersonal and communication skills  Advocacy strategies  Monitoring and evaluation principles  Original job Grant Manager WASH/ Nutrition and Climate Change posted on GrabJobs . To flag any issues with this job please use the Report Job button on GrabJobs"
  },
  {
    "title": "Planning, Monitoring, Evaluation and Reporting Manager",
    "company": "WaterAid",
    "location": "Nigeria",
    "description": "Job Description  It's hard to believe that today 771 million people do not have clean water and 1.7 billion do not have a decent toilet - around 1 in 5 of the world's population. Every two minutes a child under five dies from diarrheal diseases caused by poor water and sanitation.  Join WaterAid as our Planning, Monitoring,Evaluation and Reporting Manager to change normal for millions of people so they can unlock their potential, break free from poverty and change their lives for good. On top of that you'll be joining a 2020 Great Place to Work award-winning organisation.  Contract type:Fixed-term (2 years renewable)  Employment type:Full time  Working hours per week:40 hours  Location:Abuja, Nigeria  Salary:Competitive with excellent benefits  The primary purpose of this role is to support the implementation of WaterAid Nigeria's country strategy by ensuring that all activities are properly included in realistic and achievable annual plans and to lead on the effective... monitoring of progress of programme implementation against objectives.  Key Deliverables include;  Working with the Coordinator Planning, Strategy & Reporting, support WaterAid Nigeria's Senior Management Team (SMT) in the development and implementation of Country Programme plans and budgets in line with overall strategy  Coordinate and lead Monitoring and Evaluation activities with support from other departments and WaterAid UK, in line with WaterAid's frameworks.  Support full implementation and integration of global PMER requirement and standards across all areas of WANG's work  Generate organisational learning from monitoring and evaluation activities, document lessons learnt/case studies and share organisational learning with potential audiences and users - both internal and external to promote and replicate best practices across the organisation and sector.  Participate in, support or lead relevant capacity building initiatives and workshops on PM&E targeting implementing partners  To be successful, you'll need:  University Degree in Development Studies, Public Health, Statistics or other relevant field  5 years post NYSC experience in planning, monitoring and evaluation preferably in an NGO setting. Experience in international research or development organisation may also be considered.  Knowledge / experience in knowledge management systems  Experience in community-based development  Experience of M&E in the water, sanitation & hygiene (WASH) sector  Fully committed to WaterAid's vision, mission and values and a way of working that demonstrates this, with the ability to communicate this enthusiasm to others.  How to Apply  If you are interested in this position and have the right skills and attributes, kindly apply by clicking on this LINK or click on 'apply' and follow the link in the full Job description.  Deadline 05 December, 2023  Please note: to apply for this role you must be able to demonstrate your eligibility to work in Nigeria.  Only candidates shortlisted for interviewing will be contacted within two weeks of the closing date for applications.  Click on 'Apply' to download the job description.  We're looking for people who share a commitment to our vision. We're looking for people with an appreciation and respect for different people and ideas, and the energy and expertise to help tackle the most important challenges.  In return, you can expect to get inspiration from the change you help make happen, a sense of belonging and the feeling of being part of a global community. You will also experience stimulation and fulfilment, the chance to grow, and space to be yourself at your best. This is our pledge to you.  WaterAid is committed to ensuring that wherever we work in the world there is no tolerance for abuse (of power, privilege or trust), inappropriate behaviour, discrimination, harassment, bullying or exploitation of any kind. The safeguarding of the communities in which we work, staff, volunteers and anyone working on our behalf, is our top priority and we take our responsibilities extremely seriously.  We celebrate the diversity of our staff, partners and everyone with whom we work to create a culture where everyone feels respected, included and can be their best.  WaterAid is an equal opportunity and is committed to achieving the highest standards of diversity, inclusion and fairness. We welcome applications from all. Should you have a disability or special needs and require additional assistance with your application, please contact us at careers@wateraid.org. If a disabled applicant meets the minimum criteria for the role, they will be guaranteed an interview.  No recruitment agencies please"
  },
  {
    "title": "Principal Water Resources Economist, ECNR at the African...",
    "company": "AfDB-STVE Project",
    "location": "Nigeria",
    "description": "Never Miss a Job Update Again.  Company:  Location: Nigeria  State:  Job type: Full-Time  Job category:  Job Description  African Development Bank Group (AfDB)  Established in 1964, the African Development Bank is the premier pan-African development institution, promoting economic growth and social progress across the continent. There are 80 member states, including 54 in Africa (Regional Member Countries). The Banks development agenda is delivering the financial and technical support for transformative projects that will significantly reduce poverty through inclusive and sustainable economic growth.  We Are Recruiting To Fill The Position Below  Job Title: Principal Water Resources Economist, ECNR  Reference: ADB/20/168  Location: Abidjan, Cote dIvoire  Grade: PL4  Position N: 50001269  The Complex  The Chief Economist and Vice-President for Economic Governance and Knowledge Management (ECVP) is the Banks spokesperson on economic matters and the VP for the Economics... Governance and Knowledge Management Complex.  The ECVP is responsible for (i) providing leadership and visibility for the Bank on economic, finance, financial governance and socio economic development issues; and coordinate the generation of analytical works to inform operational policy; (ii) systematically emphasize the critical role of knowledge, experience, lessons learnt and their tangible impact on sustainable, inclusive transformation of African economies.  The ECVP will inspire, generate and provide direct support to the President and Senior Management of the Bank on a broad range of technical and management issues within the broad remit of economic, finance, public financial governance, management and social economics.  The Hiring Department / Division  The external role of the African Natural Resources Center (ANRC) is to support Regional Member Countries (RMCs) improve development outcomes through effective management of natural resources wealth by delivering practical solutions on policy, legislative and investment decisions in the sector. Internally, it brings cohesion to the Banks strategies in natural resources sectors by providing a single lens through which the institution tackles natural resources governance.  The Position  Water resources cut across four main sectors normally represented as a nexus, namely water/energy/food/environment security  water for human consumption, hydropower, agriculture and environment. These are interdependent and closely linked as use by one sector will impact available resources for other sectors at any given time.  The water nexus functions as a tool to assist decision-makers to best balance water uses at any given time. The objective is to maximize sustainable benefits of available water resources in the wider socio-economic context necessary for sustainable development. The objective of the post therefore is to:  Provide strategic advice to the Director, technical leadership and support to water experts and consultants responsible for producing research papers, policy briefs and country sector studies and other knowledge products to help inform water resources planning, investments and governance in Regional Member Countries of the African Development Bank.  Act as the Centers focal point in managing strategic relationships and partnerships with other development partners, regional governments, private and civil society organizations.  Oversee advocacy initiatives on water resources planning, investments and governance.  Duties And Responsibilities  Under the supervision of the Manager and working in collaboration with other colleagues, the Principal Water Resources Economist provides support to AfDBs water resources governance initiatives. In particular:  Undertake and supervise economic, thematic, and sector work (ESW) in emerging water resource management challenges and identify investment opportunities to promote integrated water resources management and regional cooperation in the water sector.  Undertake water resources modelling on the basis of the water nexus approach to help inform Regional Member Countries decision making in the water sector  allocation, efficiency, equity, use, access and sustainability of water resources and ecosystems.  Develop water resources policies, strategies and plans for member countries through the preparation and administration of advisory TA projects.  Evaluate water resources policies and projects; intra-regional and regional cooperation activities in the water sector; and on the role of water in developing rural economies and poverty reduction.  Lead and participate in the production of key policy briefs, position papers and guidelines on water resources; by liaising with government, academia/research institutions, private agencies and NGOs on water use issues, and help the Center develop appropriate responses. This will include responding to enquiries from the media and public.  Organize, originate and/or participate in the production of knowledge management and dissemination of information related to water resources management, including the drafting of Terms of Reference (ToR), the selection of consultants and the supervision of the technical aspects of their work.  Collaborate with Country departments to elaborate Banks water resources management and development related policy and programs, and when necessary participate in related policy dialogue with RMCs governments; including the promotion of sustainable water resources management and development.  Identify major opportunities for strategic collaboration with multilateral and bilateral donors to improve the governance of water resources in Africa; by engaging with them on policy advice.  Contribute technical inputs to the preparation of country strategy papers and portfolio reviews, with particular reference to the governance of water resources.  Provide technical guidance and mentoring to other natural resource management experts in the ANRC, the Economic Governance and Knowledge Management Complex, other relevant departments and the Banks Regional and Country offices.  Support the Bank and RMCs in identification, preparation and appraisal of water resources management and development projects.  Selection Criteria  Hold at least a Masters degree or its equivalent in Water Resources Economics; Integrated Water Resources Management, Natural Resources Policy, or closely related natural resources management fields of study.  Have a minimum of (6) six years work experience in the sector, international organizations, regulatory environment or a think-tank with a focus in water resource economics, integrated water resource management and the relevant sector and/or function.  A change agent with track record in project design, execution and publishing for internal and external audiences.  Knowledge and hands-on experience of sector policy/regulatory environment, regional initiatives in the sector, regional development programs and relevant protocols.  Knowledge management and oversight of advocacy programs.  Designing and implementing programs of advice and capacity building.  Knowledge of the region and water sector environment.  Knowledge of principles of good governance as pertaining to natural resources policy,  Project Management skills.  Private sector experience is an added advantage.  Innovation & Creativity.  Communication.  Strategic planning.  Client orientation.  Teamwork and relations.  Ability to communicate effectively (written and oral) in English or French, preferably with a working knowledge of the other.  Competence in the use of standard Microsoft Office applications (Word, Excel, Access, PowerPoint).  Experience in the use of SAP is advantageous.  Application Closing Date  26th December, 2020.  Don't Keep! Kindly Share:  *"
  },
  {
    "title": "Wathab Field Engineer (Water and Habitation Engineer)",
    "company": "Lextorah LDS",
    "location": "Abuja",
    "description": "Company Description  The ICRC delegation in Abuja is looking for a qualified and motivated candidate with the capacity to work independently to fill the position below.  Job Description  Contributes to the implementation and running of specific projects/programs independently.  Maintains contact with interlocutors/authorities at local level mainly independently.  Trains and coaches local NRCS branches technical staff according to the programmes defined by the ICRC and implementation planning based on analysis and water and habitation (WATHAB) rehabilitation works.  Implements projects with contractors and sub-contractors.  Takes care of the wathab stock and provides a related updated stock position  Performs written reporting to the Wathab delegate.  Performs as translator between the delegate and local interlocutors.  Establishes a comprehensive technical report on a completed watHab project.  Supports other WatHab projects upon request.  Qualifications  University degree (Civil... Engineering)  Experience in assessing, surveying, calculating and preparing estimates of building metallic structures.  Fluent in written and spoken English.  Team leadership skills.  Good command of Hausa language.  Very good analytical and computer skills.  Good knowledge of the geographical assigned area.  Additional Information"
  },
  {
    "title": "Chief of Party, WASH - Global - Lagos, Nigeria",
    "company": "DT Global",
    "location": "Lagos",
    "description": "Location: Nigeria Job Brief DT Global seeks to build a robust roster of qualified and experienced Chief of Party candidates for anticipated water and WASH focused donor-funded programs. Experience and technical expertise sought in one or more of the following areas: water resource management; water, sanitation, and hygiene (WASH); water sector governance; water sector financing; environmental health; climate change mitigation and adaptation; environmental and natural resource management; nutrition and food security, urban services; gender and social inclusion, and monitoring, evaluation and learning (MEL). Position locations are varied contingent upon contract and task order award(s). Possible locations include, but may not be limited to Afghanistan, DRC, Mozambique, Haiti, Kenya, Nigeria, Ethiopia, Jordan, Indonesia, Liberia, Madagascar, Senegal, Zambia, Tanzania. Position Summary Chiefs of Party will be responsible for overall strategic and operational coordination of program... activities. S/he should have a comprehensive understanding of issues related to managing a sub-award/sub-contract program that serves clients in developing countries supported by U.S. Government funding; strong management experience, problem solving and interpersonal skills, and experience in budgeting and financial management. S/he will also have experience in interacting with U.S. Government agencies, other donors, and partners. Primary Responsibilities Overall leadership, project planning and implementation, and ensuring timely and high-quality expertise and deliverables for USAID. Serve as the primary point of contact to USAID and contribute to successful, positive relationship with the client and other key stakeholders. Responsible for both the quality of the project, as well as for its effective financial and operational management Manage a team of technical staff, subcontractors and short-term consultants. Responsible for achieving the expected results of the project and solving problems that may arise. Minimum Qualifications Master's Degree (or higher) in Water and Environmental Engineering, Public Health, Business, International Affairs, Public Administration, Public Policy, or a related field Proven technical experience in target countries in WASH, water resource management, or a related field. Minimum of fifteen (15) years in the management and supervisory experience of WASH, water resource management, governance, and/or capacity building programs with a US Government foreign affairs agency, international assistance organization, or non-governmental organization. Minimum of five (5) years of field experience working in one or more developing countries. Demonstrated experience in liaising with high level representatives from both the public and private sectors. Demonstrable experience managing teams, with strong interpersonal skills. Knowledge with USAID regulations and compliance requirements preferred. Core Competencies: Teamwork: Works cooperatively and effectively with others to achieve common goals. Participates in building a culture characterized by inclusion, trust and commitment. Communication: Effectively conveys information and expresses thoughts professionally. Demonstrates effective use of listening skills and displays openness to other people's ideas and thoughts. Adaptability: Adjusts planned work by gathering relevant information and applying critical thinking to address multiple demands and competing priorities in a changing environment. Customer/Client Focused: Anticipates, monitors, and meets the needs of customers and responds to them in an appropriate and responsive manner. Diversity and Inclusion: Conveys respect for diverse individuals and perspectives; models inclusive behavior and treats everyone fairly. Professionalism: Displays appropriate and ethical behavior, integrity, and personal presentation in the workplace always; demonstrates respectful communication for others, both verbal and non-verbal. Application Closing Date Not Specified. How to Apply Interested and qualified candidates should: Click here to apply online https://phf.tbe.taleo.net/phf03/ats/careers/v2/viewRequisition?org=URSAUS&cws=39&rid=1160 Note: We thank all applicants for their interest. Only short-listed candidates will be contacted"
  },
  {
    "title": "Assistant Technical Officer, Water Sanitation and Hygiene at...",
    "company": "ListingAPI-2",
    "location": "Ngala",
    "description": "Family Health International (FHI 360) is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in health, education, nutrition, environment, economic development, civil society, gender, youth, research and technology  creating a unique mix of capabilities to address todays interrelated development challenges. FHI 360 serves more than 70 countries and all U.S. states and territories.  We are recruiting to fill the position below:  Job Title: Assistant Technical Officer, Water Sanitation and Hygiene  Requisition No: 2023200670  Location: Gamboru Ngala, Borno  Employment Type: Full-time  Supervisor: Field Coordinator  Technical supervisor: Senior Technical Officer-WASH  Project Description  Northeast Nigeria is currently facing a growing humanitarian crisis with a vast number of Internally Displaced Persons in need of emergency assistance.  These IDPs are living among host... communities, lacking access to livelihoods and resources, ultimately leading to unprecedented levels of malnutrition and food insecurity. FHI 360 has been working in Nigeria for over 30 years and is now expanding activities in Borno state to respond to the IDP crisis.  FHI 360 is expanding its expertise by responding to this humanitarian crisis through integrated WASH, Health, Nutrition and Protection interventions  Basic Function  The Assistant Technical Officer Water Sanitation and Hygiene will provide technical and programmatic support to the field sites as required.  Under the supervision of the Field Coordinator, the ATO WASH will implement water supply, sanitation, environmental health, and hygiene promotion activities in IDP Camps and Host communities.  Other responsibilities will include conducting water quality testing for all water points rehabilitated under the program and working with Community Volunteers and latrine users to develop cleaning and maintenance schedules for latrines as well as disseminating hygiene promotion messaging.  The role will include coordination with WASH partners at the field level.  Duties and Responsibilities  Implement WASH activities according to the proposal, as well as proper maintenance and use of WASH equipment.  Develop and use appropriate materials for hygiene promotion messaging and training of community-based hygiene promotion volunteers.  Timely reporting on program activities (internal and external reports.)  Representing FHI 360 externally in both the Humanitarian Community and with Government/LGAs officials as well as developing strong links with WASH and NGO actors. Actively participate in WASH meetings and other Government/UN forums at LGA level.  Assist in the coordination and supervision of all the WASH activities in the IDP camps and community in the LGAs.  Ensure that WASH activities are delivered as a comprehensive package at the field level.  Conduct water quality surveillance/testing programme according to location specific water safety plans.  Monitor WASH NFIs supply chain and stock levels in collaboration with warehouse/stores and logistics and coordinate the distribution of NFIs based on needs.  Monitor service delivery across all WASH subsectors throughout the IDP camps in the LGA.  Ensure appropriate and safe collection, transport, treatment, and disposal of all liquid and solid wastes in the IDP camps.  Compile weekly, monthly, quarterly plans and reports on general Water, Sanitation and Hygiene Promotion activities.  This is not an exhaustive list of the duties and responsibilities of this post, and the post-holder may, from time to time, be required to undertake any other reasonable duties and responsibilities as requested including supporting other sectors with WASH expertise.  Qualifications and Requirements  BA / B.Sc / B.Eng Degree in Environmental Sciences, Engineering, Civil Engineering, Architecture, Social Science, Public Health or other related fields.  Professional experience in construction or rehabilitation and maintenance of WASH infrastructures in displaced populations  WASH related degree qualification with 1 to 3 years relevant experience in WASH with a sound understanding of hygiene in humanitarian relief settings.  Experience working in humanitarian contexts.  Knowledge, Skills & Attributes:  Knowledge of WASH and humanitarian programming in emergency situations.  Technical expertise especially regarding water supply, sanitation, environmental health and hygiene promotion  Ability to work well with others and to develop and maintain compatibility among project staff, vendors, consultants, and recipients of assistance.  Ability to manage tight deadlines and deliver high volumes of work with minimal supervision.  High degree of proficiency in written and spoken English & Hausa communication.  Application Closing Date  Not Specified.  Method of Application  Interested and qualified candidates should:  Click here to apply online"
  },
  {
    "title": "Program Coordinator,",
    "company": "Lextorah LDS",
    "location": "Abuja",
    "description": "Company Description  Water Aid is a UK registered international charity with a vision of a world where everyone has access to water, sanitation and good hygiene. We support local organizations to manage low cost, sustainable projects and also influence policy makers to secure the right of poor people to affordable water and sanitation services.  To effectively implement our country strategy, water aid Nigeria is inviting applications from suitably qualified candidates to fill the following positions to be based at our office in Abuja, Nigeria.  Job Description  Sustainable total sanitation-Nigeria (STS-NIGERIA) PROJECT (1 YEAR FIXED TERM- RENEWABLE).  Responsibilities:  The role will oversee programme planning and delivery, programme monitoring and reporting, communication and partnership liaison and staff management on a new programme which seeks to consolidate water aids years of work to improve effectiveness. Efficiency, inclusiveness and sustainability of sanitation approaches in... 3 state of Nigeria. This position will be expected to provide day to day coordination towards achievement of the project goals and ensuring the integration of the projects activities with broader water-aid with broader water-aid in Nigeria programme priorities.  Qualifications  The ideal person for this position would possess an undergraduate and masters degree in the natural physical or social sciences.  Minimum 10 years of experience of which at least 5 of which must be in a senior development programme management and delivery of complex community bided development projects with multiple stakeholder in a developing country context, experience with managing multiple project stakeholders including community level stakeholders, government officials, donors etc  Excellent competencies in writing project reports, strong demonstrable experience with managing people in a direct supervisory role and strong experience with implementation of an action learning and research project in a development setting.  Additional Information"
  },
  {
    "title": "Water Engineer-Alaro City Development FZC - Lagos, Nigeria",
    "company": "Alaro City Development FZC",
    "location": "Lagos",
    "description": "Hands-on, ready to roll up the sleeves. Ability to work in shifts and do overtime hours Ability to multi-task, establish priorities, and maintain organization in a rapidly changing environment. Personal Characteristics: High energy Result-oriented Strong work ethic Ability to work effectively under pressure; and Desire to live and work in Epe, Lagos. Application Closing Date Not Specified. Method of Application Interested and qualified candidates should send their CV to: waterengineerrole@alarocity.com using \"Water Engineer\" as the subject of the mail."
  },
  {
    "title": "GM Oil Palm & Water Packaging",
    "company": "Excelminds Corporate Services",
    "location": "Lagos",
    "description": "Job Title: General Manager - Oil Palm & Water Packaging  Location: Lagos. Requirements  Experience: 5 to 10 years.  Qualification: Minimum 1st Degree Holder and/or equivalent. Reasonable Understanding of Nigeria Business Terrain. Matured and able to handle given responsibilities diligently.  Benefits  Salary: upto 3500$.  Status: Bachelor status."
  },
  {
    "title": "B-2-G & B-2-B Corporate Sales Manager!HORECA consumables Sales...",
    "company": "FUMMAN CHEMICALS",
    "location": "Abuja",
    "description": "Ability to initiate and conclude Government Contract Bid, Possess High Networth/VIP Federal Government Connections. International NGO Contract Bidding Skills & Connection"
  }
]