[
  {
    "title": "2 District Water And Sanitation Support Engineers",
    "company": "Water and Sanitation Corporation",
    "location": "Kigali",
    "description": "JOB DETAILS: District Water And Sanitation Support Engineers (2) Water and Sanitation Corporation (WASAC) is charged with vital responsibilities of providing clean water and sewerage services to all Rwandans as enshrined in Government Strategy for Transformation (2024) and Vision 2050. For WASAC to be able execute this responsibility effectively and efficiently, it requires enough and competent Human Resources to attain the set objectives. From the foregoing WASAC Ltd wishes to hire competent and enthusiastic Engineers for the position of \"District water and Sanitation support Engineers\" Reporting line: District Water and Sanitation Support Engineers will directly report to the Head of Operations and Maintenance Unit in Rural Water Sanitation Services Directorate of WASAC Ltd;  Duties and responsibilities: District Water and Sanitation Support Engineers will be based at the District level and responsible for the following:  Assist the District in planning process for water and... sanitation infrastructure development  Assessment for needs of rehabilitation of existing water and sanitation infrastructure  Provide technical assistance in development and implementation of new projects in the District  Advise the District on efficient operation and maintenance of water supply and sanitation  Participate in the monitoring and evaluation activities for water supply and sanitation  Perform data collection and maintain data updated on water supply and sanitation services within the district  Supervision of private operators and ensure proper and efficient management of all water supply systems  Work in collaboration with other partners in the District to improve services of rural water supply  Follow up, assist and report on the implementation of the District Water Board resolutions; P  periodic reporting on the status of District's water projects and water supply services Perform any other relevant task assigned  Job Requirements  Bachelor's degree in Civil Engineering. Hydraulic Engineering Water and Environmental Engineering or equivalent field of study.  To have at least 3 years' of working experience in similar duties  Computer literacy and familiarity with standard office computer applications.   Experience with engineering applications (ArcGIS, AutoCAD) is must  Ready to move and live at the place of work immediately after appointment  Ability to work in team and under minimum supervision;  candidates respectively in project planning, supervision and construction works related  to water treatment plants and water supply system  Excellent interpersonal and communication skills;  Have strong command in either of the languages (English or French)  The Interested candidates must submit the following soft documents to WASAC Itd Documents to be submitted Job application form on WASAC Itd website; A copy of Degree (s); A copy of Service certificate(s) as proof of related working experience is a MUST, Duties and responsibilities: District Water and Sanitation Support Engineers will be based at the District level and responsible for the following:  Assist the District in planning process for water and sanitation infrastructure development  Assessment for needs of rehabilitation of existing water and sanitation infrastructure  Provide technical assistance in development and implementation of new projects in the District  Advise the District on efficient operation and maintenance of water supply and sanitation  Participate in the monitoring and evaluation activities for water supply and sanitation  Perform data collection and maintain data updated on water supply and sanitation services within the district  Supervision of private operators and ensure proper and efficient management of all water supply systems  Work in collaboration with other partners in the District to improve services of rural water supply  Follow up, assist and report on the implementation of the District Water Board resolutions; P  periodic reporting on the status of District's water projects and water supply services Perform any other relevant task assigned\"\"> Job Requirements  Bachelor's degree in Civil Engineering. Hydraulic Engineering Water and Environmental Engineering or equivalent field of study.  To have at least 3 years' of working experience in similar duties  Computer literacy and familiarity with standard office computer applications.   Experience with engineering applications (ArcGIS, AutoCAD) is must  Ready to move and live at the place of work immediately after appointment  Ability to work in team and under minimum supervision;  candidates respectively in project planning, supervision and construction works related  to water treatment plants and water supply system  Excellent interpersonal and communication skills;  Have strong command in either of the languages (English or French)\"\">  Job Experience: No Requirements  Work Hours: 8  Level of Education: Bachelor Degree"
  },
  {
    "title": "WASH Project Manager/COHERS",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose: A WASH (Water, Sanitation, and Hygiene) One-Health Project Manager will be responsible for overseeing and managing projects that integrate water, sanitation, and hygiene interventions with the principles of One Health. One Health is a collaborative approach that recognizes the interconnectedness of human, animal, and environmental health. The role of a WASH One-Health Project Manager is to ensure the successful implementation of projects that address the complex challenges at the intersection of these three domains.  Key Accountabilities The key responsibilities of a WASH Project Manager for COHERS project include:  Project Planning and Management: The WASH One-Health Project Manager will be responsible of developing project plans, setting objectives, and defining deliverables. She/He will coordinate project activities, allocate resources, and monitor progress to ensure timely completion. This includes developing budgets, managing expenditures, and ensuring... compliance with donor requirements. Stakeholder Engagement: The Project Manager will engage with various stakeholders including government agencies, non-governmental organizations (NGOs), community leaders, healthcare professionals, veterinarians, and environmental experts. She/He will establish partnerships and collaborations to promote a holistic approach to addressing health challenges related to water, sanitation, and hygiene.  Needs Assessment and Program Design:The WASH One-Health Project Manager will be responsible to conduct needs assessments to identify gaps in water, sanitation, and hygiene services in communities. Based on the assessment findings, She/He will design evidence-based programs that integrate interventions targeting human health, animal health, and environmental sustainability.  Monitoring and Evaluation: The Project Manager establishes monitoring and evaluation frameworks to track project progress and measure impact. She/He will be responsible to collect data on key indicators related to water quality, sanitation coverage, hygiene practices, zoonotic diseases, environmental pollution, and other relevant parameters. This data will be used to inform decision-making and improve project outcomes.  Capacity Building: The WASH One-Health Project Manager will provide training and capacity-building support to project staff, community members, and other stakeholders. This includes training on water treatment and purification, sanitation practices, hygiene promotion, disease prevention, and environmental conservation. Advocacy and Policy Influence: The Project Manager will also advocate for policies and practices that promote the integration of WASH interventions with One Health principles. She/He will engage with policymakers, participate in relevant forums and conferences, and contribute to the development of guidelines and standards in the field.  Reporting and Documentation: The WASH One-Health Project Manager will be responsible of preparing quality progress reports to share with donors and other stakeholders, technical documents, and project proposals. She/He will need to ensure accurate documentation of project activities, lessons learned, best practices, and success stories.  Other responsibilities:  Organise and lead donor visits,  Ensure project documentation is properly done and learning shared,  Supporting advocacy and influencing engagements with district partners, for improvement of access to water, sanitation, and hygiene services through JDAF platform.  Ensure WASH infrastructures meet the required standards for climate change resilience  Ensure that project includes gender responsive WASH aspects  Perform any other activities in interest of WaterAid as assigned by the Leadership.  Person Specifications: Education  Bachelor's or Masters Degree in Public Health, Environmental health Science, Veterinary Medicine, general medicine or related field.  Experience  Minimum 7 years working experience for candidates with Bachelors degree in Public Health, Environmental health Science, Veterinary Medicine, general medicine or related field  Minimum 4 years working experience for candidates with Masters degree in Public Health, Environmental health Science, Veterinary Medicine, general medicine or related field for Masters degree candidates.  Experience of working with INGO in areas of WASH is required  Knowledge  Proven experience in managing WASH projects or programs.  Knowledge of One Health principles and their application in public health.  Familiarity with water supply systems, sanitation infrastructure, hygiene promotion strategies, and zoonotic diseases.  Strong project management skills including planning, budgeting, monitoring, and evaluation.  Excellent communication and interpersonal skills to engage with diverse stakeholders.  Ability to work effectively in multicultural settings and with multidisciplinary teams.  Proficiency in data analysis software and reporting tools.  Understanding of policy advocacy and influencing processes.  Competencies  Excellent skills in writing, producing excellent monitoring and programme / project reports for wider audience  Commitment to WaterAids values and a working style that reflects these.  Excellent interpersonal and written communication skills.  Team player and able to work independently and with minimal management oversight.  Ability to adhere to Safeguarding principles.  Language  Fluent in English and Kinyarwanda (both written and spoken), and working knowledge of French  Work Hours: 8  Experience in Months: 84  Level of Education: Bachelor Degree"
  },
  {
    "title": "Lecturer in Water Resources Management",
    "company": "Protestant Institute of Arts and Social Sciences (PIASS)",
    "location": "Kigali",
    "description": "JOB DETAILS: The Recruitment Of A Lecturer In Water Resources Management The Protestant Institute of Arts and Social Sciences (PIASS) would like to recruit a lecturer for the program of Water Resources Management of the Faculty of Architecture and Green Technology 1. Key duties and responsibilities  Implementation of programs and teaching plans and report on progress to the faculty council and the academic senate.  Ensure smooth running of continuous assessment and examinations for the modules taught.  Ensure that assessment is done in accordance with the institutions standards and students get feedback on time  Preparation and teaching the modules related to the specific subject areas allocated.  Invigilate exams  Participate in supervision and examination of students dissertations  Participate in development and review of academic programs  Participate actively in PIASS research activities, and community outreach programs  Secure research grants, consultancies and funding... to support research projects.  Collaborate with other faculties, and departments at PIASS wherever needed to enhance compliance with high quality teaching, learning and assessment standards  Assist students in their academic and professional development, offering guidance and support.  Supervise graduate students' theses or research projects.  Organize field trips, workshops, or seminars related to water resources  Participate in creation of partnerships that are important to increase PIASS visibility, enrollment and impact.  Prepare, set up, and perform various laboratory tests and experiments related to water quality, hydrology, and environmental analysis.  Follow established protocols and safety procedures while conducting experiments.  Collect, record, and manage data obtained from laboratory experiments and fieldwork.  Assist in the analysis of water samples using various instruments and analytical techniques.  Maintain and calibrate laboratory equipment, ensuring its proper functioning.  Assist in the collection of water and soil samples from field sites as required.  Ensure proper labeling, storage, and transportation of collected samples.  Maintain detailed records of laboratory procedures, test results, and observations.  Adhere to laboratory safety protocols, including the handling and disposal of hazardous materials  Take part in spiritual and social activities related to community life at PIASS  2. Profile of the candidate  At least have a masters degree in water resources management, Environmental Engineering, Hydrology, or a closely related field.  Demonstrated expertise in water resources management through research, publications, or industry experience  High English proficiency required  Computer literacy with experience of using different e-learning platforms  Ability to work independently with minimum supervision  Team spirit and experience  Proven organizational, coordination, and inter-cultural communication skills  Proven experience of teaching in a higher-learning institution  Ability to secure research funding and grants.  Results-oriented with adherence to deliverables and deadlines  Familiarity with MIS would be an added value  Job Experience: No Requirements  Work Hours: 8  Experience in Months:  Level of Education: Associate Degree"
  },
  {
    "title": "COUNTRY DIRECTOR  RWANDA",
    "company": "Water For People",
    "location": "Rwanda",
    "description": "Water For People is a global nonprofit working across nine countries, bringing together communities, local entrepreneurs, and governments to build and maintain water and sanitation services that will last. We have a sustainable solution to end the global water and sanitation crisis, and our employees across the world help drive this solution.  POSITION OBJECTIVE:  The Country Director is the most senior Water For People staff member in Rwanda. As such, the Country Director is ultimately responsible for managing all aspects of Water For Peoples work in the country. The CD is responsible for the review and implementation of the countrys strategic plan and ensures the development of new strategies are in line with Water For Peoples overall strategy and policy objectives. The CD plays a key role in implementing the D30 Alliances strategic objectives and plans in Rwanda.  The CD manages all employees as well as provides effective management of all Water For People funds and equipment... in Rwanda. The Country provides leadership for the countrys advocacy, influence and learning programs and manages a wide range of external relationships at the national and local levels, in particular those with the government agencies. This position serves as a liaison between Water For People Denver, Water For People Rwanda, local water and sanitation NGOs in Rwanda, local Rwanda government officials, and local Rwandan communities in need of water and sanitation projects.  ESSENTIAL JOB FUNCTIONS & DUTIES:  Strategy  Work with the existing country coordinator on the implementation and monitoring of the strategic plan  Develop annual operating plans, budget plans, policies, and procedures in line with Water For Peoples overall strategy and global direction of Water For People  Undertake any sector review and/or thematic research in preparation for the next programming cycle.  Produce and implement three-year rolling plans and budgets and a master plan of operations to carry forward the countrys strategy.  External Relationship Management  Strengthen relationships with partner organizations, the local private sector, NGOs, government agencies, donors, and bilateral and multilateral agencies in Rwanda.  Represent Water For People in Rwanda and host official visitors to the Water For People program.  Entertain relationships with sector players at the national and local level, in particular with local Rwandan communities in need of water and sanitation projects, local government authorities, and local water and sanitation organizations in Rwanda.  Identify and develop in-country funding opportunities for further program work.  Internal Management  Oversee the management of Water For Peoples program offices and projects in Rwanda including recruiting, managing, and developing staff and ensuring the correct approval and implementation of projects.  Implement the countrys standard working procedures in line with Water For Peoples overall policies where appropriate.  Implement Water For Peoples financial controls and verify that all in-country staff follows the requirements of those controls.  Contribute to Water For Peoples overall program and policy discussions at a global level.  Learning and Reporting  Promote a learning environment among Water For Peoples partners and staff in Rwanda.  Develop the capacity of Water For People staff and partners to document their experience for learning and advocacy purposes.  In cooperation with partners, develop program work that contributes to Water For Peoples learning and advocacy agendas.  Coordinate the production of specific reports for fundraising purposes as and when requested by Water For People Denver.  Accountabilities and Compliance  Ensure compliance with applicable in-country rules and regulations related to in-country staff and property, e.g. taxes, insurance, etc.  Ensure program work is kept within budget and that program expenditure remains within the annual budget allocation.  Ensure that partners and projects are visited regularly by Water For People staff and that partners are provided with the technical and managerial advice and training that enables them to implement projects, and that physical progress and partner monitoring records are regularly checked.  Oversee the procurement of materials, equipment, and other assets for the Water For People office and programs.  Commission annual external audits by the standard terms of reference for external audits and participate in financial reviews.  Immediately report any financial irregularities to your Regional Director, Africa.  Produce monthly reports to the Rwandan Government as may be required.  Coordinate and manage the preparation of bi-monthly reports and accounts for Water For People Denver.  Ensure partners are provided with adequate support to develop and implement their financial control procedures.  Contribute to Water For Peoples financial controls and verify that all in-country staff follows the requirements of those controls  EXPERIENCE, KNOWLEDGE & SKILLS REQUIRED*:*  Bachelors Degree or professional qualification in a relevant subject (for example, Engineering, International Development, Community Health, Business, Economics, Environmental Sciences) is required  Masters degree in Water Resources Management, Water Engineering, International Development, Civil Engineering, Business Management, Environmental Sciences or related field of study is highly desirable  Outstanding knowledge of Microsoft 365 suite is required  Minimum of ten years senior program management experience, including financial management and budgetary control, and direct line management of staff preferably in water and sanitation  5 years experience heading a country program is highly preferred  5 years experience working in Rwanda highly preferred  Significant experience in business related WASH programming preferred  Experience in resource mobilization and managing multilateral projects  Proven leadership and strategic management skills  Experience working with national and District local governments in Rwanda  Significant experience in managing teams and community  based water and supply projects  Ability to develop long term strategic plans as well as medium- and short-term plans at an organizational level  Excellent interpersonal and communication skills to develop and communicate a common vision among diverse partners and the ability to lead multidisciplinary teams  Maintain sound ethical principles, integrity, and transparency of the due process  Strong organizational skills, including the ability to prioritize and meet deadlines  Ability to work collaboratively in teams, build consensus, and effectively coordinate with internal and external actors from a broad range of backgrounds and experiences  PHYSICAL REQUIREMENTS/WORKING CONDITIONS:  Position is based at Water For Peoples Rwanda office located at Kacyiru Sector, Gasabo District in the City of Kigali  Candidates must be a citizen or legally authorized to work in Rwanda  This position requires regular travel to program sites in Rwanda and ability to travel at least 25% of the time domestically and internationally, including places where travel might be rugged  Ability to work outside typical office hours at times to collaborate across multiple time zones  Note: This job description is not intended to be an exhaustive list of all duties, responsibilities, or qualifications associated with the job.  Salary Range:  Rwanda expected salary range: FRW 48,200,000  $60,000,000 per year  Actual salary will be determined based on experience and other job-related factors.  Benefits:  Benefits are one of the ways we encourage healthy living for you and your family. Our generous package includes medical and life insurance, annual leave equal to one month of salary and other benefits in accordance with the Rwanda labor law.  Water For People cannot provide immigration sponsorship for this position.  How to apply  How to Apply:  If you are both qualified and Water For People interests you, please visit our Career Center and apply with your resume and cover letter to this position. Please also attach to your application your educational certificates (bachelors degree or masters degree"
  },
  {
    "title": "Finance Manager  Isoko yUbuzima Project",
    "company": "Water For People (WFP)",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Summary: Water For People is an international non-governmental organization (NGO) that works with people and partners to develop innovative and long-lasting solutions to the water, sanitation, and hygiene problems in developing countries. The organization strives to continually improve, experiment with promising new ideas, and leverage resources to multiply its impact. Water For People is currently operating in 9 countries including Rwanda where the organization is supporting WASH in the Districts of Rulindo, Kicukiro, Gicumbi, and Karongi, and through a project called Isoko yUbuzima, funded by USAID, reaches an additional 10 Districts of Rwanda. It is against this background that Water For People seeks to hire Finance Manager- Isoko y Ubuzima with the following qualification and competencies.  Position Objective: The Finance Manager is responsible for overall financial management, including budgeting and monitoring of project expenditures, financial reporting... compliance, forecasting expenditures, and maintaining and supervising project accounts, books of accounts, banking, and financial operations as well as supervising the day-to-day operations of the procurement and administrative department. The Finance Manager is also responsible for ensuring that all consortium members adhere strictly to USAID and the Government of Rwandas financial and procurement regulations.  Essential Job Functions And Duties: Accounting and Finance  Implement procedures for monitoring and analyzing project budgets, which allow accurate projection of expenditures and comparisons of actual and budgeted spending.  Ensure that all financial transactions and practices are consistent with USAIDs policies and regulations and in accordance with all relevant Water For Peoples rules and regulations.  Work with the Chief of Party and Water For Peoples global and local staff to prepare annual budgets.  Work with the Deputy Chief of Party and technical team members to prepare monthly projections and cash advance requests.  Prepare 90-day forecasts and monthly fund requests, based on budget and cash flow projections, to ensure the project has all necessary funds for operations.  Complete advance requests, liquidations, and financial reports in accordance with USAID requirements, including entering financial data in Water For Peoples accounting software system and submitting reports to Water For Peoples headquarters.  Prepare requests for USAIDs approval for procurements, per the regulations and their requirements.  Supervise project staff and consultants working on finance and administrative aspects for the project.  Manage the acquisition of capital assets and ensure that assets are properly recorded.  Develop, implement, and maintain financial policies and a system of internal control in conformance with best practices, federal regulations, and Water For Peoples related procedures.  Train project finance and operation personnel in program-specific financial procedures.  Develop a cash flow plan for overall programmatic and contract activities.  Oversee financial management of expenses associated with country plan allocations, contract of services, and procurement of goods.  Develop metrics for program financial success, including identifying internal control weaknesses and implementing enhanced business practices to strengthen the system of internal control.  Prepare financial monthly and quarterly reports and reconcile currency exchange as needed for monthly finance management.  Advise the COP on financial health through the provision of regular and timely financial expenditure reports. Managerial  Supervise the Administration and procurement officer, and Accountant  Isoko yUbuzima.  Complete mid-year and annual reviews for subordinate staff.  Provide mentorship and guidance to subordinate staff.  Work with COP to develop a positive working environment for all staff members and report any performance issues to the COP as soon as they occur. Risk and Compliance  Implement the financial procedures and ensure compliance with accounting policies and procedures by all project staff.  Initiate the review of foreign exchange management, review, and forecasting.  Support the COP and Country Director with outside legal cases as needed.  Other Duties Coincidental to the Position Duties for this position should not be considered definitive. Duties may be added, deleted or modified in consultation with the incumbent as necessary. Job descriptions and staff performances will be reviewed regularly. Guidelines The following written and unwritten guidelines will be applied to performing the duties of the post: Written  All Water For People handbooks on administration and others.  Any established and agreed Country Program procedures. Unwritten  Common sense in applying proper business practice and sound purchasing principles.  Know when to negotiate and how to achieve goals successfully.  Maintain sound ethical principles, integrity, and transparency of due process.  Competencies:  Connects to the Mission  Embraces the mission of Water For People and is passionate about advancing the dynamic role it plays leading social impact in international development.  Demonstrates Ethics and Integrity  Understands ethical behavior and business practices and ensures that own behavior is consistent with these standards and aligns with the values of the organization.  Manages through Ambiguity  Demonstrates flexibility and adaptability in responding to change and ambiguity.  Demonstrates Cultural Awareness  Able to engage a wide range of stakeholders from a variety of backgrounds and cultures.  Action-oriented  Maintains an attitude of open, curious, and proactive learning, continually expanding own area of understanding and expertise.  Connects with Others  Listens and fosters open communication through questioning, dialogue, and information sharing.  Self-confident  Demonstrates humility, mature confidence and courage to innovate, risk, and lead in their own role.  Qualifications, Knowledge & Skills Required:  Masters or bachelors degree in finance, Accounting, Business Administration, or equivalent.  Accounting professional qualification CPA/ACCA is mandatory.  At least 7 years of experience and accounting experience, with a minimum of 3 years in an international development organization. A combination of non-profit experience and for-profit experience would be an added advantage.  Managing a USAID grant would be an added advantage.  Three (3) years of audit experience would be an added advantage.  Previous working experience on a finance manager position would be an added advantage.  Demonstrated experience managing a finance/accounting team as well as other business functions such as HR, Legal, etc. is required.  Experience in strategic business planning and execution, contracting, and negotiation.  Ability to analyze financial data and prepare financial reports, statements, and projections.  Advanced computer proficiencies with Microsoft Office programs including Word, Excel, PowerPoint, and Outlook.  Knowledgeable in at least one accounting and forecasting software.  Knowledge of national financial regulations.  Professional written and verbal communication and interpersonal skills.  English and Kinyarwanda proficiency.  Strong problem-solving skills.  Common sense to make judgments about a situation requiring deviations from routine tasks.  Self-starter and ability to undertake tasks without intensive supervision.  Sound ethical principles, integrity, and transparency.  Ability to analyze and organize data and communicate results effectively.  Ability to manage multiple tasks and projects with multiple priorities.  Ability to work both independently and as part of a collaborative team effort.  Must have well-developed written, oral, and interpersonal communication skills.  Employment Conditions:  Position is based at the Water For People in Rwanda office.  Regular travel to program sites. Note: This job description is not intended to be an exhaustive list of all duties, responsibilities, or qualifications associated with the job. Salary Range: Rwanda's expected annual gross salary range is Rwf 18,954,408 to Rwf 31,131,416. The actual salary will be determined based on experience and other job-related factors. Benefits: Benefits are one of the ways we encourage healthy living for you and your family. Our generous package includes medical and life insurance, annual leave allocation equal to one month of salary, and other benefits in accordance with the Rwanda labor law.  Work Hours: 8  Experience in Months: 84  Level of Education: Associate Degree"
  },
  {
    "title": "WASH Project Manager/ANGUS",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose: A WASH (Water, Sanitation, and Hygiene) Project Manager/ANGUS will be responsible for overseeing and managing all aspects of WASH projects, ensuring their successful implementation and completion. She/He play a crucial role in planning, coordinating, and monitoring activities related to water supply, sanitation facilities, and hygiene promotion in various settings such as communities, schools, healthcare facilities, and other public institutions.  Key Accountabilities The key responsibilities of a WASH Project Manager include:  Project Planning: The WASH Project Manager will be responsible for developing comprehensive project plans that outline the objectives, activities, timelines, and resources required for successful project implementation. She/He will need to collaborate with stakeholders to identify project needs and ensure alignment with organizational goals. Budgeting and Resource Management: The WASH Project Manager will be responsible to prepare... project budgets, monitors expenditures, and ensures efficient utilization of resources. She/He will coordinate procurement processes for equipment, materials, and services required for project implementation while adhering to internal guidelines.  Team Management: The WASH Project Manager will line manage a project community mobilize, and partners involved in the direct implementation of the project. She/He will ensure capacity building of staff under her/his direct supervision, ensure their performance aligns with project objectives.  Monitoring and Evaluation: Regular monitoring of project activities is crucial to assess progress towards objectives. The WASH Project Manager will monitor and track key performance indicators (KPIs) and evaluates the impact of interventions. Ability to analyze data to identify challenges or gaps in implementation and make necessary adjustments, will be required.  Partnership Development: Collaboration with relevant stakeholders such as government agencies, NGOs, community leaders, and donors will be very key in this role. The WASH Project Manager will establish and maintain partnerships to leverage resources, share knowledge, and ensure sustainability of interventions beyond the project duration. Reporting: The WASH Project Manager will be required to prepare quality reports on project progress, achievements, challenges faced, and lessons learned. These reports will be shared with donors, internal and external stakeholders to provide transparency and accountability. Quality Assurance: Ensuring the quality of WASH interventions is a key responsibility of the WASH Project Manager. They develop and implement quality control measures, adhere to quality program standards and guidelines, and promote best practices in water supply, sanitation, and hygiene promotion. Risk Management: Identifying potential risks and developing mitigation strategies is essential to minimize project disruptions. The WASH Project Manager will need to assess risks related to project implementation, health and safety, community engagement, and environmental impact, taking appropriate measures to address them. Capacity Building: The WASH Project Manager facilitates training programs for project staff, community members, and other stakeholders to enhance their knowledge and skills in WASH-related areas. She/He will promote behavior change communication strategies to ensure sustainable adoption of improved water, sanitation, and hygiene practices.  Other responsibilities:  Organise and lead donor visits,  Ensure project documentation is properly done and learning shared,  Supporting advocacy and influencing engagements with district partners, for improvement of access to water, sanitation, and hygiene services through JDAF platform.  Ensure WASH infrastructures meet the required standards for climate change resilience  Ensure that project includes gender responsive WASH aspects  Perform any other activities in interest of WaterAid as assigned by the Leadership.  Person Specifications: Education  Bachelor's or masters degree in sanitary engineering or environmental engineering.  Experience  Minimum 7 years working experience for candidates with Bachelors degree in sanitary engineering or environmental engineering.  Minimum 4 years working experience for candidates with Masters degree in sanitary engineering or environmental engineering.  Experience of working with INGO in areas of WASH is required  Knowledge  Proven experience in managing WASH projects in diverse settings.  Strong knowledge of sanitation technologies, water supply systems, hygiene promotion approaches, and relevant policies/guidelines.  Excellent project management skills including planning, budgeting, monitoring, and reporting.  Ability to lead and motivate a team towards achieving project objectives.  Effective communication and interpersonal skills for building partnerships and engaging with stakeholders.  Proficiency in data analysis and use of relevant software/tools for monitoring and evaluation.  Familiarity with donor requirements and experience in proposal development.  Understanding of gender equality and social inclusion principles in WASH programming.  Competencies  Excellent skills in writing, producing excellent monitoring and programme / project reports for wider audience  Commitment to WaterAids values and a working style that reflects these.  Excellent interpersonal and written communication skills.  Team player and able to work independently and with minimal management oversight.  Ability to adhere to Safeguarding principles.  Language  Fluent in English and Kinyarwanda (both written and spoken), and working knowledge of French  Work Hours: 8  Experience in Months: 84  Level of Education: Bachelor Degree"
  },
  {
    "title": "Senior WASH Advocacy and Financing Manager",
    "company": "Water For People (WFP)",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Summary Water For People in Rwanda is looking to employ a Senior WASH Advocacy and Financing Manager, who is driven to succeed and detail-oriented. The Senior WASH Advocacy and Financing Manager will provide leadership for national advocacy, influence and learning programs, in building local, national, and regional capacity to establish and sustain universal WASH services. S/he will have a thorough understanding of the strength of national sector system from the perspective of a building blocks analysis/assessment. Using this analysis, s/he will develop a strategy proposing how Water For People can most effectively support, and address identified weaknesses in that assessment, in consultation with national government and other sector players. Water For People is committed to strengthening the finance building block, through the implementation Sector Financing Strategy, which has already identified significant gaps in resources needed. This will form a central part of... her/his role. The Senior WASH Advocacy and Financing Manager will work with government and other sector partners to understand the financing needs of the sector to achieve, SDG and Vision 2050 targets, for WASH and then to identify potential opportunities and develop strategies to increase funding for the water, sanitation, and hygiene (WASH) sector. The Senior WASH Advocacy and Financing Manager will support the development of strategic financing approach which will both increase resource mobilization as well as defining a strategy for leveraging and blending the three sources for WASH sector financing: Taxes (government expenditure), Tariffs (public investment) and Transfers. The Senior WASH Advocacy and Financing Manager will also support the sector to come up with innovative financing mechanisms. The successful candidate will support the mobilization of required investments to implement the recommendations of sustainable WASH Financing Strategy, sector performance analysis recommendations, elaborated WASH investment plans and national integrated water and sanitation master plans that set out how the WASH sector will finance its overall programmatic and operations to meet the sectors objectives in the short, medium-term, and long-term. The Senior WASH Advocacy and Financing Manager will work closely with Ministry of Infrastructure, Ministry of Finance, WASAC and development partners to gather required data to show case WASH sector financing status and needs to achieve SDGs and strategy to mobilize required investment. The Senior WASH Advocacy and Financing Manager will be the primary point of contact in the Rwanda program for both the global headquarters office located in Denver and regional office, in relation to the issues of Influence, advocacy and strategic alliances and will work closely with the Senior Global Advisor for National Impact and the regional WASH Financing Advisor.  Key Professional Qualities:  Highly accountable with the ability to deliver results in a fast-paced, collaborative team culture.  Must have well-developed written, oral, interpersonal, and negotiation communication skills with a high degree of sensitivity for confidentiality.  Must be task-oriented with an excellent sense of priority, logic, and objectivity, highly organized and capable of handling several sensitive and important issues simultaneously while responding to unanticipated developments.  Essential Job Functions & Duties: Strategy  Support Country Program and WASH partners to develop a clear strategy to mobilize required investments to achieve SDG 6 by 2030.  To develop WASH financing mobilization strategies and approaches and required strategic alliances for sector financing support, both at national but also at regional level.  Actively participate in national and regional sector activities (reviews, working groups and planning sessions), and providing leadership support as necessary to ensure momentum of these activities.  Programmatic Activities Sector Influence  Actively participate in national sector activities (reviews, working groups and planning sessions), and any Agenda For Change collaboration, providing leadership support as necessary to ensure momentum in these activities.  Develop and lead management and coordination responsibilities on issues of advocacy for the Scale and Destination 2030 as well as for the Strategic Alliances and Fundraising  Support the national annual WASH sector performance analysis and national dialogue on WASH policies and financing.  Build a clear evidence-based by supporting the annual sector performance review based on WASH sector building blocks.  Coordinate national influence agenda with national, regional and global programmatic experts in areas of development of market systems, finance and planning, national impact, water resource management, climate change, monitoring, evaluation, and learning.  Participate in roundtables or national platforms organized at national level in collaboration with other development partners.  Ensure that technical support is provided to program teams on activities with national impact and program design while seeking and implementing funding opportunities in the country, as requested.  Sector Finance  Support to develop the WASH sector strategic financing plan to serve as a roadmap to leverage more resources for the sector priorities, including Taxes, Transfers and Tariffs.  Support WASH sector to identify other innovative financing options, including public private partnerships (PPP), blended financing, guarantees and climate financing to increase the fiscal space and other financing mechanisms for WASH services and capital investments.  Review and analysis of WASH funding opportunities for financing water and sanitation.  Undertake consultations with WASH partners and other multi-lateral organizations to evaluate financing mechanisms to elevate the WASH investments.  Conduct a thorough analysis of challenges faced by WASH sector to attract attention of private investor and development partners with reference to the current strategic documents and report related to water and sanitation sector in Rwanda.  Develop actions and advice that promote Climate finance (carbon credits) articulated with WASH, SDG6 and WRM  Partnership Management  Create and strengthen relationships with WASH partner organizations, NGOs, government agencies, donors, bilateral and multilateral agencies, as part of the sector strengthening strategy.  Map and build relationships with international NGOs; United Nations agencies (UNICEF, UNDP, UNHCR, etc.), regional WASH organizations; multilateral development banks (AfDB, World Bank); bilateral development agencies (USAID, SWISS Cooperation Agency, Embassies, etc.); centers of research and academic institutions, and  Identify synergy opportunities with other Country teams in Africa.  Actively collaborate with Water For people strategic partners and other key WASH sector players to promote a culture of joint proposal development and co-financing for Sustainable Water and sanitation services.  Learning and Reporting  Promote internal and external learning environment among WASH sector partners;  Coordinate and develop the capacity of Water For People staff and partners to document their experience for learning and advocacy purposes;  Participate and represent Water For People in conferences, workshops and meetings and present Water For People approaches and models through written articles and storytelling (videos).  Document successes, failures, and lessons learned, and share knowledge both internally and externally.  Develop a capacity-building plan for partners on the analysis made to their performance and support its implementation for a continuous improvement of their strategies.  Undertake any other duties and responsibilities that may be assigned by the supervisor.  Behaviours and Competencies:  Connects to Mission  Understands and embraces the mission of Water For People; works to connect day-to-day tasks to mission; can explain Water For Peoples purpose  Manages through Ambiguity  Can recognize problems or opportunities when they arise and act to resolve them; readily formulates multiple solutions through a problem or issue analysis; is comfortable making and defending recommendations.  Demonstrates Cultural Awareness  Demonstrates a global mindset; values cultural differences and takes into consideration in any given situation; moves easily between people from different backgrounds and cultures; can work outside the comfort zone and is ready to deliver at high expectations with minimum supervision.  Action-oriented  Recognizes additional actions that will improve quality or facilitate achievement of outcomes; does not hesitate to do more than expected but may overextend; sees opportunities beyond the job description and recognizes those that can be seized immediately and those that require higher level input; thinks outside the box, anticipates how actions affect the team.  Sense of Team  Builds effective working relationships at all levels of the organization; aligns own behavior with the needs or priorities of the team; promotes teamwork among groups; discourages us versus them thinking; knows and considers the capabilities of coworkers.  Qualifications, Knowledge, & Skills Required:  Advanced degree/Post graduation (masters level minimum) qualification in one of the following areas: economics, environmental economics, environmental finance, environmental finance and policies, Environmental economics and management, Environmental economics and Climate Change, Environmental Sustainability, and economic and international development  Additional qualifications related to water, sanitation, hygiene and environmental economic and carbon credits will be an added advantage.  Minimum 10 years of progressively responsible experience in environment and WASH Finance activities for an international organization in a low- or middle-income country in Africa.  Expertise in climate finance is a MUST, Candidate must have international experience with a good understanding of how country governments can access climate finance.  Experience in the same field and experience working with national governments, Private sector, blended finance, Equity Funds, Private Financing, Loan Financing, Climate Financing etc.  Demonstrated Technical skills in research, analysis, processing, collection, and software programs are required.  Well-rounded understanding of WASH program design and understanding of best practices for WASH Finance.  Experience in staff development and training on WASH costing, business planning  Exceptional communications and presentation skills, both written and oral.  Working Knowledge of English is required, and knowledge of Kinyarwanda and any other regional language is added advantage.  Cultural sensitivity and ability to get on with a wide range of people.  Proactive and self-motivated individual capable of engaging persuasively with a wide range of stakeholders.  Ability to organize and facilitate meetings and workshops. Experience of giving presentations and delivering lectures to large audiences.  Ability to work in a focused manner, on many different subjects at the same time.  Long term budget projections, budget management and analysis.  Excellent writing and verbal skills.  Excellent analytical, problem-solving, and management skills.  Strong organization skills with the ability to implement systems and follow-up processes.  Excellent report writing, documentation, and presentation skills.  Excellent communication, interpersonal, networking, and negotiation skills.  Good analytical skills and the ability to extrapolate lessons to other situations.  Experience with running or investing in a business, would be an added advantage.  Physical Requirements/Working Conditions:  This position is based at Water For People in Rwanda office.  Trips within and outside Rwanda will be required from time to time.  Flexibility to work outside regular business hours to meet with team members/partners located in other time zones. Note: This job description is not intended to be an exhaustive list of all duties, responsibilities, or qualifications associated with the job. Salary Range: Rwanda's expected annual gross salary range is Rwf 19,295,994 to Rwf 30,707,028 The actual salary will be determined based on experience and other job-related factors. Benefits: Benefits are one of the ways we encourage healthy living for you and your family. Our generous package includes medical and life insurance, annual leave allocation equal to one month of salary, and other benefits in accordance with the Rwanda labor law.  Work Hours: 8  Experience in Months: 120  Level of Education: Bachelor Degree"
  },
  {
    "title": "WASH Engineer (UNCHR Project)",
    "company": "World Vision International Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose The WASH engineer will supervise, conduct design & studies and review water resource, sanitation and hygiene development projects. Closely follow up and ensure the implementation of water resource development projects are in line with the plan, design, available standards, and community needs. The job holder is responsible for the overall WASH projects operations and avail the engineering drawings for related WASH facilities to be implemented.  Major Responsibilites % of time Activity 20% Conduct close field supervision to ensure that the implementation of WASH facilities are in line with the plan, design, available standards, community needs and donors requirement; and ensure good functionality of WASH facilities and services in the camp 10% Prepare bill of quantities, specification and cost estimate for water resources, sanitation , education and hygiene facilities in the camp 20% Review and verify engineering estimations and payment certificates for... construction projects being implemented in the camp; and review tender documents for both design & construction for WASH facilities 10% Review and conduct detail investigation on water resource development projects sites around the camp; and perform water resources development studies and conduct design review as required 10% Work in collaboration with other implementing partners and donors to design and ensure maintenance/repair of WASH facilities 10% Ensure that resources assigned to him / her are properly and efficiently utilized; 10% Review MoU and construction agreements in accordance with the policy of the organization 10% Reporting monthly, quarterly and annually of the project implementation progress  Knowledge/Qualifications For The Role Required Professional Experience  A good understanding of the humanitarian and emergency sector;  Experience with 3 years in development, design and implementation of construction projects;  Strong communication and interpersonal skills;  Must be willing to spend long hours in the field;  Other NGO experience will be also an asset;  Required Education,training, license, registration, and certification Civil Engineering, Water and environmental Engineering, Sanitary Engineering or related fields Preferred Knowledge and Qualifications Bachelors degree Skilled in engineering drawing and design software (Archicad, Autocad, ArcGIS, Epanet, etc) Salary: The salary is commensurate with qualifications and experience. N.B: Women are highly encouraged to apply.  Work Hours: 8  Experience in Months: 36  Level of Education: Bachelor Degree"
  },
  {
    "title": "Maintenance for Waste Water Treatment Plant at Kigali...",
    "company": "Rwanda Airport Company (RAC)| Deadline 19th December 2023",
    "location": "Kigali",
    "description": "TENDER NOTICE  Tender Number 005/NCB/2023-2024/RAC  Tender title: Maintenance for Waste Water Treatment Plant at Kigali International Airport  Source of fund: ordinary budget  Rwanda Airports Company (hereinafter called Client) intends to apply a portion of the funds to eligible payments under the contract for which this Bidding Document is issued. Rwanda Airports Company invites eligible bidders to submit bids for Maintenance of Waste Water Treatment Plant at Kigali International Airport as indicated in detail in the statement of Requirements.  Tender Documents in English may be obtained from RAC procurement office upon presentation of proof payment of a non-refundable fee of Nine Thousand Eight Hundred Rwandan francs (9,600Frw) to be deposited at Bank of Kigali on the Account N 00040-06948300-35 (RWF) opened in the name of Rwanda Airports Company. Alternatively, the tender document may be downloaded from RAC website (www.rac.co.rw) and attach proof of its payment in the bid. ... A compulsory site visit is scheduled on 05th December 2023 and will be conducted by RAC representatives at Kigali International Airport at 10:00 Am.  All bids shall be accompanied by an original Bid Security of 600,000Frw from either a bank or an insurance company operating in Rwanda which shall be valid until 30 days after the bids validity period.  Well printed bids, properly bound and presented in four copies one of which is the original must be delivered to RAC information desk at Kigali International Airport/terminal building ground Floor (Information Desk) at or before 19th December 2023 at 10:00 Am local time. Late bids will be rejected and returned unopened. All bids will be addressed to RAC procurement office failure to which RAC shall bear no responsibility of loss or misplacement of any bid. Bids will be opened in the presence of bidders or their representatives who choose to attend on the same day at 10:30 Am local time or 8:30 GMT  Enquiries regarding this tender may be addressed to Managing Director of Rwanda Airports Company, Po Box 1171 Kigali-Rwanda , Tel: (+250) 252585555; or by writing to Email: info@rac.co.rw and copy to rgatsinzi@rac.co.rw & amutesa@rac.co.rw. The Outer envelope should clearly indicate the tender name and title  Bidding will be conducted in accordance with Rwanda Airports Company procurement manual revised January 2021.  Charles HABONIMANA  Managing Director"
  },
  {
    "title": "WASH Community Mobiliser officer",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose: The WASH Community Mobilizer officer (Water, Sanitation and Hygiene) is responsible for engaging and empowering communities to take ownership of their water, sanitation, and hygiene needs. The mobilizer works with community members to identify their needs, develop solutions, and implement sustainable WASH interventions.  Key Accountabilities The key responsibilities of a community mobilizer for WASH Project include: 1. Community engagement: The mobilizer will engage with community members to understand their water, sanitation, and hygiene needs. She/He will work with the community to develop a shared vision for WASH interventions that are appropriate and sustainable. The incumbent will also work with SACCO and other saving groups and/or mobilize community to participate into savings groups so that they benefit from the revolving funds. 2. Capacity building: The mobilizer builds the capacity of community members to take ownership of their WASH needs. This... includes training on hygiene practices, water management, and sanitation infrastructure maintenance. 3. Project implementation: The mobilizer works with the community to implement WASH interventions. This includes overseeing the construction of water points, latrines, and hand washing stations. 4. Monitoring and evaluation: The mobilizer monitor the progress of WASH interventions and evaluates their impact on the community. They use this information to adjust the project as needed. 5. Reporting: The mobilizer prepares regular reports on project progress and submits them to project managers. Since the project will pilot some innovative WASH initiatives, the incumbent should be able to document the whole process before and after the implementation for learning purposes.  Overall:  Work with the programme team for the planning, implementation, and evaluation of the project,  Work with SACCO staff across the intervention areas and district staff on WASH promotion and sanitation finance and marketing  Implementation of the CBEHPP through community health clubs in the village, coordinated by the head of the village and supported by the community health workers (CHW) and the Community Environmental Health Officers (CEHO)  Working with WASAC staff and district officials to engage communities in identification of the sites for water points and location of water tanks  Establishing water users committees and ensure that members know their roles and responsibilities  Working with district water board to train CHCs, WUCs, operators and local government authorities on the management of water supply systems  Ensure quality programme standards in all the implemented projects  Ensure WASH infrastructures meet the required standards for climate change resilience  Ensure that project includes gender responsive WASH aspects  Ensure health and safety at construction sites  Ensure all the project outcomes are met within time and budget  Ensure quality donor and project reports are done and submitted on time,  Ensure donor compliance and requirements,  Organise and lead donor visits,  Ensure project documentation is properly done and learning shared,  Ensure good collaboration between project leads at both regional and global levels.  Support proper documentation of the project to inform future planning and learning  Support the district capacity building in WASH especially for the district WASH Officers and JADF.  Supporting advocacy and influencing engagements with district partners, for improvement of access to water, sanitation, and hygiene services through JDAF platform.  Perform any other activities in interest of WaterAid as assigned by the Leadership.  Person Specifications: Education  Masters or bachelors degree in Social Sciences, Development studies, Environmental Health, and Public Health  Experience  Minimum 7 years working experience for candidates with Bachelors degree in Social Sciences, Development Studies, Environmental Health, and Public Health  Minimum 4 years working experience Masters degree in Social Sciences, Development studies, Environmental Health, and Public Health  Experience of working with INGOs in areas of WASH is required.  Knowledge  Strong understanding of Rwanda WASH context  Thorough understanding of and linkages with stakeholders/institutions involved in WASH.  Understanding of issues of gender and inclusion in the Rwanda context, particularly as it relates to gender-specific WASH  Understanding of issues related to climate change resilience  Strong documentation and knowledge sharing skills  Competencies  Excellent skills in writing, producing excellent monitoring and programme / project reports for wider audience  Commitment to WaterAids values and a working style that reflects these.  Excellent interpersonal and written communication skills.  Team player and able to work independently and with minimal management oversight.  Ability to adhere to Safeguarding principles.  Language  Fluent in English and Kinyarwanda (both written and spoken), and working knowledge of French  Work Hours: 8  Experience in Months: 84  Level of Education: Associate Degree"
  },
  {
    "title": "Storm Water Engineer",
    "company": "Kigali City",
    "location": "Kigali",
    "description": "JOB DETAILS: - Work together with roads construction engineers for the coordination of drainage design activities prepared by experts on roads and bridge construction projects; - Implement the City storm water management strategy - Record and evaluate data prior on drainage infrastructure in the district; - Monitor and report on storm water incidents and damages for action; - Mobilize communities on storm water management requirements; - Resolve conflicts related to storm water damages complaints; - Perform any other duties assigned by the supervisor..  Job Experience: No Requirements  Work Hours: 8  Experience in Months:  Level of Education: Bachelor Degree"
  },
  {
    "title": "Programme Manager, Universal WASH",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Work Relationships Internal: SMT Members, PMEAL Manager, Programme Manager Public Health, Research & KM Specialist, Communication and Campaign Specialist, Grant Specialist, WaterAid East Africa Regional team, UK and other WaterAid offices. External: MoI, MoH, Mineduc, Local government officials in districts, and municipalities, Development Partners, WASH INGOs, Government Agencies, Implementing/partners, donors, CSO networks and platforms, private sector, Budget Responsibility Manage Program budget  B. Job Purpose Job Purpose The Programme Manager, Universal WASH will manage the implementation of universal access to sustainable WASH services providing focused WASH technical thought leadership to the country programme through programme design, programme management, project oversight, and program quality management in order to shape and reinforce Wateraids leading role and strategic ambition in achieving transformational change at scale. S/He will provide strategic advice... and support on programming of sustainable universal WASH services as well as system strengthening by developing program concepts to inform the design of projects. S/he is entrusted with ensuring efficient and cost-effective operations of all functions of the programme (sector support- influencing, service delivery, capacity building, learning and documentation) towards the fulfilment of the strategic objectives of the organization.  C. Main Responsibilities and Duties Technical Programme Leadership  Provide leadership in the design, development and implementation of Universal WASH programme and projects.  Technical leadership on sustainable and inclusive rural and / or urban WASH services through a system strengthening approach, ensuring that WARws interventions are relevant, effective, and add value. The technical leadership covers areas such as political economy and institutional capacity assessments, strategic planning, technical designs and specifications, life-cycle costing and financing.  Responsible for setting the technical standards to be adhered to by all implementing staff and partners.  Leadership in ensuring that the technical quality of our programmes is high and consistent with national and sector best practice and WARws program frameworks and quality This will include driving programmatic activities that deliver model WARw services in communities, districts, towns, schools and health facilities and engagement of key WASH stakeholders for scale-up and replicability.  Targeted support to WARws project teams, key partners to ensure quality implementation, learning and adaptation as In addition, the role supports wider influencing of practice and policy beyond WARw, working with sector actors, providing specialist knowledge to donors and engaging other agencies on WASH.  Development and promotion of best practice guidance on WASH in the country, and when called on, develop and manage programmes of research and capacity development as well as facilitate learning from within WARw and externally to build on and improve practice and policy interventions.  Prepare and produce technical programme reports for dissemination to various stakeholders.  Develop practical tools for evaluation and monitoring the technical programme.  Develop operating business plan for the technical area in collaboration with the other technical leads and departments.  Provide WASH technical and strategic input into the development of the Country Strategy. Programme Development and Grants acquisition  Develop and execute in collaboration with grants team, a strategy to increase funding portfolio for technical programme.  Actively support the roll out of WaterAid Rwanda Resource Mobilization and Grants Acquisition plan.  Provide advice on donor management (government/private donors and institutions) ensuring proper resolutions.  Productively manage donor concerns (government, private sector, donors and institutions) ensuring proper resolutions for both parties have been reached  Participate in proposal development processes Pre-proposal, Proposal development, Post-submission.  Research new proposals in close coordination with other teams in order to ensure high quality proposals that meet the requirements of the donors.  Actively participate in the Go / No-go decision making process and ensure that all risks are addressed consistently.  Research and draft resources in preparation for grant bidding activities, such as capability statements, project summaries, partner profiles, etc. Accountability, learning and innovation  To ensure quality programming, innovative designs, evaluation, reflection, learning and dissemination and reporting of all projects in the WASH programme.  Ensure that findings and recommendations from various accountability mechanisms such as Reviews, Operational and Finance Audits, Programme evaluations, external and internal evaluations, are acted upon in a timely and effective manner.  In close collaboration with HR participate in recruitment and selection processes to ensure skilled programme staff are recruited, retained, and provided with, mentoring and coaching for development.  Participate in the mobilization and management of implementing partners. Policy and Advocacy  Policy influencing by analysing the existing WASH sector policies and policy environment, governance and institutional bottlenecks, systems of management, risk allocation and coordination systems around WASH sector Recommend corrective actions to be taken to improve efficiency and effectiveness of WASH sector programs to ensure adequate focus on SDG 6 agenda.  Provide technical advice on WaterAid Rwanda's policy influencing and advocacy strategies that aim to strengthen the capacity and effectiveness of the sector to deliver sustainable water and sanitation services for all.  Generate evidence and advocate for the conditions necessary for strengthened institutions, policies and sector performance at national and sub-national  Provide sector leadership and acting as a recognised authority in sector debates on WASH sector governance.  Provide leadership and guidance in shaping national the realization of universal access to WASH services planning processes, and bottlenecks preventing the development of an effective and functioning WASH sector in collaboration with the International Programs Department. Networking and Coordination  Maintain effective communications and pro-active relationships with donors and government partners, including visits by donors.  In coordination with Director of Programmes and others, develop and maintain pro-active relationships with bilateral and multilateral representatives in country.  In coordination with the Director of Programmes, develop and maintain good relationships with national government ministries, other NGOs and the development sector in general.  In coordination other members of the Technical Services team work closely with field staff on capacity building of national office staff and knowledge sharing within the region.  Others  Perform any other duty as may be assigned by supervisor or designee from time to time.  Participate and contribute in committees and taskforces e.g. Procurement Safeguarding & Safety & Security  Ensures that Safeguarding, Child Protection, and Gender Equality policies are fully embedded in project design, during implementation and as principles applied in day-to-day work of Program team.  Ensures that comprehensive health, safety and security measures (e.g. risk management plans, local security protocols) have been put in place when designing programs / project and are consistently upheld during their implementation.  Ensures that any partner agencies that WARw works with are adopting the same health, safety and security standards (as defined in any applicable WARw health, safety and security policies), and arrange for capacity building support where gaps or weaknesses are identified.  Understands and puts into practice the responsibilities under Safeguarding, Child Protection and Gender policies and Code of Conduct (CoC).  Adheres to any local security protocols that have been put in place when working in the office, travelling to the field or undertaking project / program  Immediately reports any health, safety and security incidents or near-misses that occur to their line manager, Security Focal Point or  Behaves and acts in a manner that does not put colleagues or anyone that interacts with WA in immediate danger or harms way.  Other Undertake any other activities as requested by Head of Programs.  D. Key Competences, Skills, experience, and Knowledge Qualifications, Knowledge, Skills and Experience  Masters degree and above in a relevant technical WASH discipline, such as civil engineering, water / Sanitation engineering, public health, environmental engineering, Environmental Health or a related field associated with water supply, sanitation and hygiene behaviour change.  Minimum of 8 years of WASH experience with at least 3 years at senior level  Extensive experience across all sub-disciplines in WASH.  Extensive experience in development program management; and overseeing multi-year programs using systems strengthening approaches.  Demonstrated ability to undertake and direct high quality rural / urban water and sanitation programmes.  Solid track record of working with government institutions to influence and direct policy / practice reform agendas.  In depth understanding of WASH technical and management issues including water security and broader development and poverty reduction themes.  Competence in application of WaterAid common approaches to work including partnerships, convening, inclusion, systems strengthening, creating behavioral change, and mainstreaming gender and inclusion of youth.  Experience of conducting formative research and feasibility studies, using the findings to make program decisions and deliver appropriate design options in WASH programs.  Proven experience of building capacity of staff and partner organizations especially CSOs and government.  Track record of developing strategic and operational plans.  Planning and organising skills and the ability to prioritise.  Behavioural competencies The Universal WASH Program Manager should demonstrate competence in some or all of the following:  Behave ethically and build relationships  Communicate effectively  Creativity / Innovation  Focus on stakeholder needs  Foster teamwork  Leading ability and decision-making ability Organize, Planning and Problem solving.  Work Hours: 8  Experience in Months: 96  Level of Education: Associate Degree"
  },
  {
    "title": "Groundwater Monitoring Officer",
    "company": "Rwanda Water Resources Board (Rwb)",
    "location": "Kigali",
    "description": "JOB DETAILS: Groundwater Monitoring Officer Level:5.II Job description  Development and establishment of the ground water monitoring system;  Development and implementation of groundwater monitoring plans and roadmap;  Collection and processing of ground water data;  Supervision and follow up of groundwater exploration and exploitation (Vertical Electrical Soundings (VES), Electro-magnetic, ERT, etc);  Inventory and monitoring of boreholes and other groundwater abstraction infrastructures;  Documentation of preferred groundwater monitoring systems and equipment;  Design of groundwater monitoring network;  Ensuring proper maintenance of ground water monitoring equipment and infrastructure;  Contribution to the installation and maintenance of hydrological (groundwater) stations;  Production of regular reports on ground water status (regular bulletin, etc);  Provision of technical support to different initiatives of ground water resources use.  Contribution to the relevant... researches and studies on ground water;  Contribution to the investigation of the groundwater related hazards & accidents and advise on mitigation measures;  Contribution to the investigation of the groundwater abstraction and exploitation operations;  Update and maintenance of groundwater reports and data;  Perform any other duties assigned by supervisors.  Minimum Qualifications  Bachelors Degree in Water Resources Engineering 0 Year of relevant experience  Bachelors Degree in water resources management 0 Year of relevant experience  Bachelors Degree in Hydrogeology 0 Year of relevant experience  Competency and Key Technical Skills  Integrity  Strong critical thinking skills and excellent problem solving skills.  Inclusiveness  Accountability  Communication  Teamwork  Client/citizen focus  Professionalism  Commitment to continuous learning  Resource management skills  Analytical skills  Problem solving skills  Decision making skills  Time management skills  Risk management skills  Results oriented  Digital literacy skills  Fluency in Kinyarwanda, English and/or French. Knowledge of all is an added advantage.  Knowledge of hydrometric data transmission systems (HDTS) design, installation and monitoring  Knowledge of ground water monitoring techniques  Knowledge of geological formations  Knowledge of the interactions between soil types, geology and ground water  Job Experience:No Requirements  Work Hours: 8  Level of Education: Bachelor Degree"
  },
  {
    "title": "2 Catchment Management Officer",
    "company": "Rwanda Water Resources Board (Rwb)",
    "location": "Kigali",
    "description": "JOB DETAILS: Level:5.II Job description  Facilitating the development, dissemination and implementation of catchments managements plans;  Promotion of best practices for sustainable catchment management;  Participation in District Development Strategy (DSS) and ensure their alignment with catchment plans;  Identification of all projects related to catchment development, rehabilitation and protection in the catchment and report on their achievements;  Collection and documentation of spatial data for existing and planned projects related to catchment management;  Follow up on the establishment and operationalization of catchment management committees;  Facilitation and organization of catchment committee meetings and documentation of their resolutions;  Monitoring of the implementation of catchment rehabilitation measures;  Contribution to the monitoring and reporting on the propagation of aquatic weeds in water bodies (dams, rivers and lakes);  Guidance, monitoring and advice... on rehabilitation measures to be executed in rehabilitation of degraded catchment by District and other stakeholders;  Preparation and implementation of education and public awareness programs related to catchment management aspects;  Development and implementation of catchment for rehabilitation activity plans and road map;  Production of catchment rehabilitation and soil erosion status report;  Perform any other duties assigned by supervisors.  Minimum Qualifications  Bachelors Degree in Environmental Sciences 0 Year of relevant experience  Bachelors Degree in Geography 0 Year of relevant experience  Bachelors Degree in water resources management 0 Year of relevant experience  Bachelors Degree in Watersheds Management 0 Year of relevant experience  Bachelors Degree in Rural Engineering 0 Year of relevant experience  Bachelors Degree in Natural Sciences 0 Year of relevant experience  Bachelors Degree in Soil and Water Management 0 Year of relevant experience  Bachelors Degree in Agricultural Engineering 0 Year of relevant experience  Bachelors Degree in Ecological Restoration 0 Year of relevant experience  Bachelor's Degree in Agriculture Sciences 0 Year of relevant experience  Bachelor's degree in natural resources management 0 Year of relevant experience  Competency and Key Technical Skills  Integrity  Strong critical thinking skills and excellent problem solving skills.  Inclusiveness  Accountability  Communication  Teamwork  Client/citizen focus  Professionalism  Commitment to continuous learning  Resource management skills  Analytical skills  Problem solving skills  Decision making skills  Time management skills  Risk management skills  Results oriented  Digital literacy skills  Fluency in Kinyaranda English and or French knowledge of Swahili is an added advantage  Knowledge on catchments planning  Knowledge on catchments management practices  Knowledge in GIS skills  Extensive knowledge on catchments monitoring tools and approaches  Work Hours: 8  Experience in Months: 24  Level of Education: Bachelor Degree"
  },
  {
    "title": "Public Relations Officer",
    "company": "Rwanda Water Resources Board (Rwb)",
    "location": "Kigali",
    "description": "JOB DETAILS: Level:4.II Job description  Undertaking RWB advocacy campaigns and activities around water resources management  Assist and guide the organization of special events, press conference, conferences, field visits and other public awareness events organized by the Board.  Ensure excellent relations and regular contact with journalists and media.  Prepare press releases, speeches, talking points, web content, articles related to RWB activities  Perform any other duties assigned by supervisors  Minimum Qualifications  Bachelor's Degree in Communication 0 Year of relevant experience  Bachelor's Degree in Journalism 0 Year of relevant experience  Bachelor's Degree in Public Relations 0 Year of relevant experience  Bachelor's Degree in Media 0 Year of relevant experience  Bachelor's degree in any field with 3 years of professional experience in communication 3 Years of relevant experience  Bachelor's degree in any field with 3 years of professional experience in public... relations 3 Years of relevant experience  Bachelor's degree in any field with 3 years of professional experience in Media 3 Years of relevant experience  Competency and Key Technical Skills  Integrity  Strong critical thinking skills and excellent problem solving skills.  Inclusiveness  Accountability  Communication  Teamwork  Client/citizen focus  Professionalism  Commitment to continuous learning  Resource management skills  Analytical skills  Problem solving skills  Decision making skills  Time management skills  Risk management skills  Results oriented  Digital literacy skills  Ability to develop and implement communications initiatives using appropriate tools and channels  Research and critical thinking skills  Ability to convey ideas clearly and concisely  Verbal, non-verbal and written communication skills  Creative thinking skills and solution-oriented attitude  Knowledge of online communication tools with special emphasis in audio-visual production and dissemination  - Ability to understand and apply fundamental concepts and principles related to investigating facts, gathering and packaging of information for effective delivery to audiences  Report writing & Presentation Skills  Fluency in speaking and writing Kinyarwanda, English and/or French. Fluency in all 4 national languages (including Swahili) is an added advantage.  Job Experience:No Requirements  Work Hours: 8  Level of Education: Bachelor Degree"
  },
  {
    "title": "Documentation & Archives Officer",
    "company": "Rwanda Water Resources Board (Rwb)",
    "location": "Kigali",
    "description": "JOB DETAILS:  Level:6.II Job description  Being in charge of RWB records archives  Being in charge of the Offices documentation  Initiation and coordination of electronic filing using filing software  Minimum Qualifications  Advance Diploma in Library and Information Studies 0 Year of relevant experience  Advance Diploma in Documentation 0 Year of relevant experience  Advance Diploma in Archives 0 Year of relevant experience  Advance Diploma in Information Management 0 Year of relevant experience  Advance Diploma in Office Management 0 Year of relevant experience  Advance Diploma in Arts and Publishing 0 Year of relevant experience  Bachelor's Degree in Library and Information Science 0 Year of relevant experience  Bachelor's Degree in Documentation 0 Year of relevant experience  Bachelor's Degree in Archival Studies 0 Year of relevant experience  Bachelor's Degree in Archives 0 Year of relevant experience  Bachelor's Degree in Information Management 0 Year of relevant... experience  Bachelor's Degree in Office Management 0 Year of relevant experience  Bachelor's Degree in Arts and Publishing 0 Year of relevant experience  Advanced Diploma in Library Sciences 0 Year of relevant experience  Bachelors in Information Sciences 0 Year of relevant experience  Advanced Diploma in Information Sciences 0 Year of relevant experience  Advanced diploma in archival studies 0 Year of relevant experience  Competency and Key Technical Skills  Integrity  Strong critical thinking skills and excellent problem solving skills.  Inclusiveness  Accountability  Communication  Teamwork  Client/citizen focus  Professionalism  Commitment to continuous learning  Resource management skills  Analytical skills  Problem solving skills  Decision making skills  Time management skills  Risk management skills  Results oriented  Digital literacy skills  Fluency in Kinyaranda English and or French knowledge of Swahili is an added advantage  Knowledge of archive management software  Knowledge of the documentation management system (DMS) would be an advantage  Job Experience:No Requirements  Work Hours: 8  Level of Education: Bachelor Degree"
  },
  {
    "title": "Head of Finance & ICT",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose The Head of Finance & ICT role provides Strategic and proffesional leadership and is resposible for all finance functions as well as ICT for Development (ICT4D) within the country programme. The role is responsible for developing and maintaining all necessary financial controls, systems and processes to ensure the efficient and effective management of the organizations finances and compliance with WaterAids Financial Management Framework, statutory requirements, regulations, procedures and donors requirements. The role is accountable for planning, development, and review of WARw financial policies procedures and systems, strategies and budgeting, prudent management, and control of financial resources. It supports the capacity building of WaterAid partner organisations to undertake finance activities that resonate to WaterAid and donor requirements. The role manages ICT4D function and works collaboratively with other members of SMT in resource mobilization... partner engagement, contract management, grant management and donor compliance by ensuring high quality and timely grant reports to demonstrate WaterAids added value to donors and partners.  C. Main Responsibilities and Duties Strategic Management  Contribute to strategic leadership of the Country Programme as part of Senior Management Team (SMT) and implementation of the country programme strategy.  Provide strategic and efficient financial management for the CP.  Develop and maintain appropriate and effective financial strategies, plans and policies to support the strategic plan.  Lead the financial forecasting process to produce relevant, accurate and timely financial forecasts across WaterAid.  Develop and maintain effective working relationships with other SMT members to understand their financial support requirements, co-ordinate appropriate responses and ensure implementation of finance policies and support to the SMT members in preparation of plans and budgets.  Maintain oversight of the country programme funding position and grant management. Financial Management, and Reporting  Ensure all financial accounting processes are completed; the Income and Expenditure accounts & balance sheet are reviewed and reconciled as appropriate and monthly returns are submitted within corporate deadline.  Lead on the provision of monthly management accounts, reporting financial performance and explaining reasons for deviations/ variances from plans and proposing major actions required to address any major deviations.  Ensure the timely submission of high-quality financial reports, for internal and external audiences. Proactively draw attention on any problem areas initiate solutions in consultation with the Country Director and other staff as appropriateActively support and review the development of financial plans/ development for funding proposals and budget planning for concept notes, the donor report preparation and funding matrix updates.  Support, review, and monitor expenditure against grant agreements, working with the SMT to resolve issues as necessary. Grants Management:  Support the completion of new and potential partner capacity assessments, making recommendations on whether to engage in a partnership arrangement with such partners as well as identifying risk management plans, partner financial management capacity needs and plans where required.  Ensure regular review of partner reports are completed and funds transferred for project activities are properly accounted for and utilised for designated activities.  Ensure high quality partner monitoring visits with programme staff are conducted on a regular basis and that financial assessment reports are produced on a timely basis  Ensure all existing and potential donor income is accurately incorporated into WARw internal planning process, and plans are in line with donor requirements and WaterAid policy and practice.  Work with Programmes and Finance to review progress during WaterAid s internal review processes including variance analysis of grant outputs and expenditure.  Financial administration and reporting including preparation and submission of grant reports, development and adjustment of associated budgets, coordination of budgeted funds, screening requests for expenditures.  Ensure appropriate donor management systems, records and processes are in place, up-to-date and in compliance with WaterAid policy and practice.  Monitor and coordinate compliance with donor requirements, including grant reporting.  Work collaboratively with internal teams and implementing partners to ensure all contractual funding requirements are met and utilization of funds does not exceed the budget.  Liaise with Programme staff and the donor to ensure high quality visits.  Highlighting key risks related to grant-funded projects, such as under/over- spends, delayed delivery of commitments, capacity gaps, and donor relationships.  Work with internal teams and partners to identify capacity needs and build capacity in areas such as report writing and documentation. Financial Risk Management  Develop, implement, and maintain financial management procedures, risk assessments and control measures to manage, monitor and audit transactions across the Country Programme and to ensure compliance with WaterAids overall policies, good practice standards, external donor requirements and national laws and regulations, identifying corrective measures as required.  Support capacity building of WAU staff and partner organisations in areas of financial management and reporting.  Develop and implement procedures for assessing the value for money that WaterAid obtains in all its activities to identify cost savings and ensure financial efficiency and value for money principles are an integral part of the Country Programme activities. Audit, Compliance and Legislation  Support on the internal and external audits and coordinate the development and implementation of action plans with SMT to address external and internal audit recommendations by providing timely management response to all mandatory stakeholders.  Maintain up to date knowledge of financial legislation, donor reporting requirements and good practice to ensure that the Country Programme complies with all legal requirements and proactively stays at the at the forefront of financial management practice.  Ensure that the organisationss statutory and management reporting mechanisms are efficient and timely. Produce consolidated CP accounts; statutory year end accounts are produced and submitted to the various institutions.  Facilitate and co-ordinate both internal and external audits and lead the development and implementation of action plans based on audit recommendations, monitoring progress on achievements.  Ensure relevant reconciliation, accurate financial reports and timely audits in accordance with WaterAid and donor requirements. Team management  Lead the Finance Team and ICT4D Officer, ensuring an effective utilization of their capacity toward the achievement of the unit objectives.  Ensure effective performance management of the Finance Team and ICT4D Officer Safeguarding, Safety & Security  Create and maintain an environment which upholds WaterAids Global Code of Conduct and associated safeguarding and child protection policies.  Ensure that Safeguarding, Child Protection, and Gender Equality policies are fully embedded in project design and implementation as well as relationships with all actors  Ensure that comprehensive health, safety and security measures (e.g. risk management plans, local security protocols) have been put in place when designing Programmes / project and are consistently upheld during their implementation.  Ensure that partners WaterAid works with are adopt the same health, safety and security standards (as defined in any applicable WaterAid health, safety and security policies), and arrange for capacity building support where gaps or weaknesses are identified.  Understand and put into practice the responsibilities under Safeguarding, Child Protection and Gender policies and Code of Conduct (CoC).  Adhere to any local security protocols that have been put in place when working in the office, travelling to the field, or undertaking project / Programme activities.  Immediately reports any health, safety and security incidents or near-misses that occur on WaterAid duty to their line manager, Security Focal Point or CD.  Behave and act in a manner that does not put colleagues or anyone that interacts with WaterAid in immediate danger or harms way.  Other roles Perform any other related responsibilities, tasks or activities as reasonably required by line manager as the range of duties are not intended to be a complete description of all.  D. Key Competences, Skills, experience, and Knowledge Qualifications, Knowledge, Skills, and Experience Essential  A masters degree in finance, Accounting, or Business Studies. Relevant Bachelors degree and commensurate practical experience, and /or pursuing masters studies may be considered.  Fully completed Accounting qualification/certification e.g. CA, ACCA, CIMA, CPA  ACMA, CFA. Part professional qualifications or working towards certifications and having other experience may be considered.  Minimum of ten (10) years experience in financial, accounting and grants management experience of which five (5) must be at senior management level; and preferably in International NGO. Relevant Bachelors degree and commensurate practical experience, and /or pursuing Masters studies may be considered.  Fully completed Accounting qualification/certification e.g. CA, ACCA, CIMA, CPA  ACMA, CFA.  Member of the Rwanda Institute of Certified Public Accountants of Rwanda (ICPAR) or  or an equivalent body of professionals with added advantage.  Able to plan, prioritize and organize self and others. Ability to work under pressure and meet deadlines.  Excellent analytical skills with the ability to link financial results to programme and operational performance drivers to the organisation.  Competency in WaterAid common approaches to work including partnerships, convening, inclusion, systems strengthening, creating behavioral change, and mainstreaming gender and inclusion of youth.  Experience in preparing and monitoring budgets & developing monitoring and reporting systems.  Ability to provide financial analysis and interpretation to Country Management Team for decision-making.  Knowledge of government policies and regulations on financial management and taxation.  Knowledge of international donor reporting requirements; demonstrable experience in strong donor and partner relations and the ability to build and maintain strong working relationships with donors  Risk analysis and risk management experience. Desirable  Strong knowledge of fund accounting regulations for non-profit organizations.  Experience in working with an international NGO.  Experience in using SUN systems and vision excel.  Knowledge of water, sanitation, or hygiene projects.  Basic understanding of Project Management.  Behavioral competencies  Decisive with excellent judgement  Demonstrated ability to lead a team, leadership qualities, team player and problem-solving skills.  Possess the ability to think strategically with excellent planning and prioritization skills.  Strong analytical/problem solving skills.  Commitment and modeling WaterAids values, high personal integrity, and ethical behavior; flexible attitude, sense of transparency, proactive and has respect for gender, diversity and organizational culture.  Result -oriented, agile, and adaptable to a changing environment  Should be able to draw confidence and support from others.  Excellent interpersonal skills  builds good relationships with internal and external stakeholders; team player with ability to work effectively in a diverse team environment, respect for gender, diversity, and organizational culture  Ability to manage a complex and demanding workload; highly self-motivation, able to work without close supervision.  Job Experience: No Requirements  Work Hours: 8  Experience in Months:  Level of Education: Associate Degree"
  },
  {
    "title": "Gender & WASH Project Manager",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose: The Gender & WASH Project Manager is responsible for managing WaterAid Rwanda Project called Strengthening capacity for sustainable, climate resilient and gender sensitive WASH in Bugesera District. The project aims at increasing the capacity of the district authorities and local communities to sustainably manage WASH services. It will also increase the participation of women in decision making and WASH Governance starting from planning, implementation and monitoring and evaluation. The role of Gender& WASH Project Manager involves working closely with communities, government agencies, and other stakeholders to ensure that WASH project is implemented in a way that promotes gender equality and social inclusion.  Key Accountabilities The key responsibilities of the Gender & WASH Project Manager include:  1. Project Planning: Developing project plans, timelines, budgets, and resource requirements for WASH projects with a focus on gender equality and social... inclusion.  2. Project Implementation: Managing the implementation of the project Strengthening capacity for sustainable, climate resilient and gender sensitive WASH in Bugesera District, ensuring that it is delivered on time, within budget, and to the required quality standards.  3. Stakeholder Engagement: Building strong relationships with local communities, government agencies, NGOs, and other stakeholders to ensure that the project is implemented in a way that meets their needs.  4. Monitoring and Evaluation: Developing monitoring and evaluation frameworks to track project progress and impact and using this information to make improvements to project implementation.  5. Reporting: Preparing regular reports on the project progress for internal and external stakeholders.  6. Capacity Building: Conducting a capacity needs assessment on sustainable, gender and climate resilient WASH service provision to identify the capacity gaps and to inform capacity development plan, approaches, and tools. Providing training and capacity building support to project staff, community members, and other stakeholders to ensure that they have the skills and knowledge needed to effectively implement WASH projects. 7. Documentation and learning sharing: Documenting the role of capacity building, approaches, and impact in Bugesera. Documenting community engagement and empowerment approaches and results. Documenting learning platforms, their modes of working, their reach, and their sustainability  Overall:  Manage and coordinate project implementing partners and stakeholders for successful implementation of FCP  Work with the programmes team for the planning, implementation and evaluation of the project,  Ensure quality programme standards in all the implemented projects  Ensure health and safety at construction sites  Ensure all the project outcomes are met within time and budget  Ensure quality donor and project reports are done and submitted on time,  Ensure donor compliance to donor requirements,  Organise and lead donor visits,  Ensure project documentation is properly done and learning shared,  Represent WaterAid in Project location,  Ensure good collaboration between project leads at both regional and global levels.  Ensure WASH infrastructures meet the required standards for climate change resilience  Support proper documentation of the project to inform future planning and learning  Support the district capacity building in WASH especially for the district WASH Officers and JADF.  Supporting advocacy and influencing engagements with district partners, for improvement of access to water, sanitation, and hygiene services through JDAF platform.  Perform any other activities in interest of WaterAid as assigned by the Leadership.  Person Specifications: Education Bachelor's or Masters degree in Social Sciences, Development Studies, Gender, Environmental Health, and Public Health Experience  Minimum 7 years working experience in the field of WASH and gender programming for candidates with Bachelors degree  Minimum 4 years working experience in the field of WASH and gender programming for Masters degree candidates.  Experience of working with INGOs in areas of WASH is required  Knowledge  Proven experience in managing Gender WASH integrated projects.  Excellent project management skills including planning, budgeting, monitoring, and reporting.  Ability to lead and motivate a team towards achieving project objectives.  Effective communication and interpersonal skills for building partnerships and engaging with stakeholders.  Proficiency in data analysis and use of relevant software/tools for monitoring and evaluation.  Familiarity with donor requirements and experience in proposal development.  Understanding of gender equality and social inclusion principles in WASH programming.  Competencies  Excellent skills in writing, producing excellent monitoring and programme / project reports for wider audience  Commitment to WaterAids values and a working style that reflects these.  Excellent interpersonal and written communication skills.  Team player and able to work independently and with minimal management oversight.  Ability to adhere to Safeguarding principles.  Language  Fluent in English and Kinyarwanda (both written and spoken), and working knowledge of French  Work Hours: 8  Experience in Months: 84  Level of Education: Bachelor Degree"
  },
  {
    "title": "Head of People & Organisational Development",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Purpose As a member of the Senior Management Team (SMT), the Head of People and Organizational Development (OD) is responsible for contributing to the development and implementation of the Country Programme Strategy, develop people and OD and administration related strategies, policies, procedures systems as well as plan and lead their roll-out, which enable the CP to achieve its strategic AIMS and WaterAids mission. With a deep understanding of the CP strategy and context, she/he will develop and embed appropriate people and organizational solutions, policies, systems, and culture in compliance with labor law and other local laws and policies. She/he will provide oversight on staff engagement, performance management, staff wellbeing, and solutions in program/project design and implementation and ensure that partners have the right organizational capacity. The role holder provides oversight to staff security and safety. In addition, oversee the CPs administration... function, procurement, and logistics, while ensuring compliance and adequate management, maintenance, and safeguarding of WaterAid Rwanda assets.  C. Main Responsibilities and Duties Strategic Leadership  Take an active part in the implementation of the Country Program Strategy.  Develop a clear understanding of the CP people, capacity, and structural needs with the Senior Management Team (SMT) and lead the development and implementation of a people and OD strategy and plans that supports the delivery of CP strategy.  Works effectively as a member of SMT and contributes to overall strategic and effective leadership of the Country Programme by providing advice and support to the Country Director and SMT on People/OD and other management matters like on people management, OD processes, and support functions  Promotes and embeds WaterAids values, culture, and leadership competencies.  Work with the Regional People Lead and wider Global People team: Support the development and delivery of global and regional people projects, sharing learning and resources across the network.  Develop organizational strategies by identifying and researching human resources issues; contributing information, analysis, and recommendations to strategic thinking and direction; establishing human resources objectives in line with organizational objectives.  Implements human resources strategies by establishing accountabilities, including talent acquisition, staffing, employment processing, compensation, health and welfare benefits, training and development, records management, safety and health, succession planning, employee relations and retention, compliance, and labor relations.  Develop human resources operations financial strategies by estimating, forecasting, and anticipating requirements, trends, and variances; aligning monetary resources; developing action plans; measuring and analyzing results; initiating corrective actions; minimizing the impact of variances.  Facilitates the implementation of special People & OD projects by identifying and clarifying issues and priorities; communicating and coordinating CP requirements; expediting fulfilment; evaluating milestone accomplishments; optional courses of action; changing assumptions and direction.  Initiate policy and procedure ideas related to people management and support functions in adminstration.  Takes an active part in collective leadership tasks as a member of the Senior Management Team. People Management  Resourcing: Identify skills and capabilities required to deliver current and future CP work. Develop an annual resourcing plan and support and challenge managers to make timely resourcing choices that secure the best talent. Use appropriate, effective, and creative recruitment and selection approaches  Induction: Ensure new and transitioning employees receive a planned, effective, and timely induction, and coach managers on their role in delivering this.  Identify and maximize potential: Support managers in identifying and maximizing potentials and drive development through succession planning and individual development planning to meet CP skills & capability needs.  Learning and Development: Coach Managers and project coordinators to identify employee learning and career aspirations and agree on effective development plans. Recommend suitable learning methods and develop an annual CPs learning and development plan, supported by learning initiatives from the global people team.  Leadership and Management Development: Work with the Regional People Lead and Global Leadership and Engagement Teams to build Line Manager capability and behaviors.  Compensation and Benefits: Manage and continuously improve CP reward ensuring an appropriate mix of pay, benefits and non-pay rewards in line with WaterAids reward principles and national legislation. Contribute to reward benchmarking and coach managers in talking to employees about total reward. Ensure payroll and reward is delivered and communicated effectively.  Employee Engagement: Foster high levels of employee engagement, including staff participation in the Global Employee Engagement Survey (GEES) and line manager capability, activating GEES action plans.  People Policies and Processes: Develop and maintain all CP people policies, processes, and administration. Ensuring the staff handbook is kept up to date and in line with current statutory legislation and WaterAids global policies (i.e., employment contracts, starters, leavers, and change processes) and standards. Provide in-country management and user support on the WaterAid Human Resources Information System (PeoplePlace).  Employee Relations: Provide specialist advice and instruction to managers on employee relations issues (i.e. disciplinary, grievance, capability, bullying, and harassment) in line with CP policy, Global WaterAid policies, and statutory legislation, working with legal providers as needed.  Diversity Management: Give accurate and appropriate advice, training, and support to managers to recognize, respect, and enable diversity and inclusion.  People Reporting: Collate and accurately analyze people data and metrics for use within the Country Programme and organizational-wide people reporting.  Security Management: Seek guidance from the Global /Regional Security Manager to implement effective security processes and behaviors.  Support and coach team for effective delivery of targets (HR, Admin., Security & Safety, Employee Well-Being, etc.). Organisational Development  Organisational capacity assessments: Carry out organizational, programme, project, and partner capacity assessments; develop and implement effective and sustainable capacity development interventions and programs.  Support and deliver effective change management: Support managers to implement, communicate, and sustain change programs by ensuring clarity on the rationale for change, the future vision, what needs to be done, and the expected impact. Bring HR expertise to diagnose the change requirements across the structure, people, skills, and ways of working.  Embed a Performance Management Culture: Embed and role-model a strong performance management culture and processes. Coach staff and managers in agreeing on SMART appraisal objectives, holding honest conversations, delivering feedback and recognizing success. Hold managers accountable for managing underperformance and implementing performance improvement plans where required.  Partner OD: Contribute to and support Partners Organisational Development in close collaboration with other departments/ teams within the country programme, leading to ensuring adequate support to partner organisations. Administration  Supervise the development and implementation of effective administrative systems and processes for the CP.  Develop and ensure the implementation of administrative policies for the CP, ensuring compliance of local laws, Global policies and guidelines.  Ensure that WARW assets are adequately maintained and safeguarded  Ensure that all external administrative transactions with service providers are in line with WaterAid policies and values e.g. procurement, selection of consultants, equipment/material suppliers, and vehicle maintenance. Procurement  Oversee the roll-out of the Procurement Policies and Procedures Manual,  Monitor and ensure procurement processes are conducted (in the country office and at the field team level) in a compliant, time-efficient, and value-for-money manner including Preferred Suppliers and Vendors are identified and updated regularly  Support the timely, smooth, and effective functioning of the Procurement Committee  Lead the continuous improvement of procurement processes and practices Perform any other responsibilities, tasks, or activities as reasonably required by the line manager as the range of duties is not intended to be a complete description of all.  Safeguarding, Safety & Security  Create and maintain an environment that upholds Water|Aids Global Code of Conduct and associated safeguarding and child protection policies.  Ensure that Safeguarding, Child Protection, and Gender Equality policies are fully embedded in project design and implementation as well as relationships with all actors  Ensure that comprehensive health, safety and security measures (e.g. risk management plans, local security protocols) have been put in place when designing Programmes / project and are consistently upheld during their implementation.  Ensure that partners WaterAid works with are adopt the same health, safety and security standards (as defined in any applicable WaterAid health, safety and security policies), and arrange for capacity building support where gaps or weaknesses are identified.  Understand and put into practice the responsibilities under Safeguarding, Child Protection and Gender policies and Code of Conduct (CoC).  Adhere to any local security protocols that have been put in place when working in the office, travelling to the field or undertaking project / Programme activities.  Immediately reports any health, safety and security incidents or near-misses that occur on WaterAid duty to their line manager, Security Focal Point or CD.  Behave and act in a manner that does not put colleagues or anyone that interacts with WaterAid in immediate danger or harms way.  Other Perform any other responsibilities, tasks or activities as reasonably required as the above given that the duties and are not intended to be a complete description of all tasks.  D. Key Competences, Skills, Experience and Knowledge  Masters degree level qualification in Human Resources Management, Organisation Psychology, Organisational Development, or a masters degree in business administration with a post graduate diploma in Human Resources Management. Candidates with relevant Bachelors degree and commensurate practical experience, and /or pursuing masters studies may be considered.  Professional HR qualification highly desirable. Candidates with part professional qualifications or working towards certifications and having other experience may be considered.  A minimum 10 years HR and OD experience with 5 years leading the HR and OD Department preferably in a regional or international development organisation.  Highly proficient in organisational capacity assessments, recruitment, employee relations, reward, performance management, employment legislation, change management, organisational design, capacity building, policy and processes and learning and development.  Ability to establish credible relationships within the organisation as well as with senior decision-makers in external institutions  Competency in WaterAid common approaches to work including partnerships, convening, inclusion, systems strengthening, creating behavioral change, and mainstreaming gender and inclusion of youth.  OD-oriented approach, strong knowledge of HR best practices and innovative new practices.  Attention to detail  Strong IT skills particularly MS Word, Excel, and Outlook, with experience of using HR databases, online recruitment tools, and Intranets.  Analytical and numeracy skills, to produce and distill accurate information.  Strong communication skills in written and oral English, and presentation  Highly competent in interpreting and applying statutory legislation.  Track record of empowering others and the ability to influence.  Behavioural competencies  Good leadership qualities, team-building spirit, and problem-solving skills; should be able to draw confidence and support from staff, the Federation, partners, and other external stakeholders.  Excellent people management capabilities.  Self-motivated with excellent interpersonal skills and capacity to understand and work with a diversified multicultural and multifunctional team.  Personal integrity, flexible attitude, sense of transparency, proactive, and respect for gender, diversity, and organization cultural.  Cross-cultural awareness and sensitivity.  Ability to work to deadlines and under pressure.  Strong proven delegation, time management, and prioritizing skills.  Agile, flexible, patient and adaptable to a changing environment.  Effective networking abilities.  Attention to detail.  High personal integrity, Authentic and ethical behavior;  A team player with commitment to social transformation, social justice, and gender equality  Strong communication and IT fluency.  Excellent verbal and writing in the English language  Job Experience: No Requirements  Work Hours: 8  Experience in Months:  Level of Education: Associate Degree"
  },
  {
    "title": "Programme Manager Public Health",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Work Relationships Internal: SMT Members, PMEAL Manager, Management Accountant, Research & Knowledge Management Specialist, Communication and Campaign Specialist, Grant Specialist, . External: Development Partners, MoH, MoI, RBC, Other Government officials and District Leaders, HCFs and municipalities, Health professional Councils and Associations, Women organisazions, donors, CSO networks and platforms, communities, private sector.  D. Job Purpose Job Purpose The Programme Manager Public Health will provide thought leadership, strategic advice and support on WASH for Public Health improvement programming. S/he will work collaboratively with other specialists across the wider WaterAid Rwanda Country Program and beyond to embed knowledge and approaches on WASH and Public Health. S/He will develop a Public Health and WASH policy and programme concepts to inform the design of projects to deliver WARws Public Health Aim; identify and ensure delivery of relevant research... advocacy and campaign initiatives for Health and WASH; provide technical support for programme development and fund raising; and ensure PMER core procedures are followed in all relevant and related areas of public health and WASH work including periodic reflection, review and learning.  C. Main Responsibilities and Duties Technical Programme Leadership  Provide leadership in the development of the technical approach of WaterAid Rwanda in Public Health Programmes.  Develop health and WASH policy and programme concepts to inform the design of such initiatives to deliver WARW strategic priorities.  Provide technical support for programme development and fundraising.  Contribute to strategic planning processes for developing and reviewing programme strategies and the country strategy.  Provide leadership in the implementation of the Public Health programme, setting the technical standards to be adhered to by all implementing staff and partners.  Review and approve all the technical reports prepared from the field.  Prepare and produce technical programme reports for dissemination to various stakeholders.  Cultivate and maintain functional relationships and network with relevant stakeholders including government, civil society and private sector to influence integration of WASH in the Health sector.  Lead innovations and adapt to required context to ensure an effective and meaningful response.  Develop practical tools for evaluation and monitoring the technical programme.  Ensure PMER core procedures are followed in all relevant and related areas of public health and WASH work including high quality PPRs for periodic reflection, review and learning.  Develop operating business plan for the technical area in collaboration with the other technical leads and departments.  Provide Public Health technical and strategic input into the development of the Country Strategy. Responsible to provide technical input and support to relevant teams to ensure effective integration and monitoring of WASH in Health activities working closely with the planning and monitoring team.  Provide and coordinate targeted technical support to regional offices on WASH and health programming.  Support specific WASH and health initiatives.  Facilitate organisational learning in WASH and health Programme Development and Grants acquisition  Develop and execute in collaboration with grants team, a strategy to increase funding portfolio for technical programme.  Actively support the roll out of WARws Resource Mobilization and Grants Acquisition plan.  Provide advice on donor management (government/private donors and institutions) ensuring proper resolutions.  Productively manage donor concerns (government/private donors and institutions) ensuring proper resolutions for both parties have been reached  Participate in proposal development processes for Pre-proposal, Proposal development, Post-submission.  Research new proposals in close coordination with other teams in order to ensure high quality proposals that meet the requirements of the donors.  Actively participate in the Go / No-go decision making process and ensure that all risks are addressed consistently.  Research and draft resources in preparation for grant bidding activities, such as capability statements, project summaries, partner profiles, etc. Accountability, learning and innovation  To ensure quality programming, innovative designs, evaluation, reflection, learning and dissemination and reporting of all projects in the Public Health programme.  Ensure that findings and recommendations from various accountability mechanisms such as Reviews, Operational and Finance Audits, Programme evaluations, external and internal evaluations, are acted upon in a timely and effective manner.  In close collaboration with Head of People & OD participate in recruitment and selection processes to ensure skilled programme staff are recruited, retained, and provided with, mentoring and coaching for development.  Support the recruitment of implementing partners  Policy and Advocacy  Provide technical advice on WaterAid Rwanda policy influencing and advocacy strategies that aim to strengthen the capacity and effectiveness of the sector to deliver sustainable WASH services for all.  Identify and ensure delivery of relevant research, advocacy and campaign initiatives for Health and WASH.  Ensure adequate documentation of WASH in Health policy and advocacy initiatives and learning from programme/ project interventions.  Identify and lead key policy initiatives on WASH in health in close collaboration with WARW policy team.  Generate evidence and advocate for the conditions necessary for strengthened institutions, policies and sector performance at national and sub-national levels.  Provide sector leadership and acting as a recognised authority in sector debates on WASH sector governance.  Provide leadership and guidance in shaping national WASH in Public Health sector planning processes, and bottlenecks preventing the development of an effective and functioning WASH sector in collaboration with the International Programs Department.  Networking and Coordination  Manage, coordinate and enable strategic partnerships and engagements for effective relation with Government institutions, international, local, and collaborative organisations.  Maintain effective communications and pro-active relationships with donors and government partners, including visits by donors.  In coordination with Director of Programs and others develop and maintain pro- active relationships with bilateral and multilateral representatives in country  In coordination with the Director of Programmes, develop and maintain good relationships with national government ministries, other NGOs and the development sector in general  In coordination other members of the Technical Services team work closely with field staff on capacity building of national office staff and knowledge sharing within the region.  Safeguarding & Safety & Security  Ensures that Safeguarding, Child Protection, and Gender Equality policies are fully embedded in project design, during implementation and as principles applied in day-to-day work of Program team.  Ensures that comprehensive health, safety and security measures (e.g. risk management plans, local security protocols) have been put in place when designing programs / project and are consistently upheld during their implementation.  Ensures that any partner agencies that WARw works with are adopting the same health, safety and security standards (as defined in any applicable WARw health, safety and security policies), and arrange for capacity building support where gaps or weaknesses are identified.  Understands and puts into practice the responsibilities under Safeguarding, Child Protection and Gender policies and Code of Conduct (CoC).  Adheres to any local security protocols that have been put in place when working in the office, travelling to the field or undertaking project / program activities.  Immediately reports any health, safety and security incidents or near-misses that occur to their line manager, Security Focal Point or  Behaves and acts in a manner that does not put colleagues or anyone that interacts with WA in immediate danger or harms Other Undertake any other activities as requested by Head of Programs.  D. Key Competences, Skills, Experience, and Knowledge  Qualifications, Knowledge and Experience Essential  Master's in Public Health/ Environmental Health with background of Medicine, Medical Sanitation Engineering or related discipline  Minimum 7 years of experience in similar managerial roles  Experience in WASH or public health program delivery and coordination of programs /projects; and understanding of working modality of the Health sector  Ability to create networks between central government ministries, local governments and stakeholders that further sustain behavioural change interventions.  Competency in WaterAid common approaches to work including partnerships, convening, inclusion, systems strengthening, creating behavioral change, and mainstreaming gender and inclusion of youth.  Good communication skills in written and verbal English, with good interpersonal, negotiating and persuasive skills and experience  Desirable  Experience in research in public health and WASH development issues.  Excellent skill in community consultation, group discussions with different and diverse group of people, field observation, interviewing with people and facilitating meetings internally and externally.  Ability to work flexibly, manage competing priorities and meet strict deadlines.  Ability to design, manage and evaluate behavioural change interventions.  Experience of managing and supporting staff and partners.  Experience of working effectively within a culturally diverse and matrix organization.  Behavioural competencies  Extensive commitment, experience and demonstrable knowledge and skills in the area of the integration of WASH and health, WASH and health systems thinking, public health, environmental health, sustainable WASH in developing countries, demonstrated through a progressive career record with at least the most recent significant experience being in a similar level role.  Very strong analytical ability and writing ability in English.  Experienced in producing practical knowledge products targeting needs of diverse audiences.  Proven success in offering technical assistance, consulting, and/or advisory services to empower and to develop capacities.  Demonstrated ability to drive tasks forward to completion in a timely manner while maintaining high quality.  A team player, able to work responsibly, under pressure, and collaboratively across diverse groups and culture.  Working style that reflects WaterAids values.  Work Hours: 8  Experience in Months: 84  Level of Education: Associate Degree"
  },
  {
    "title": "Hydraulic and Hydraulic Engineer",
    "company": "NPD Ltd",
    "location": "Kigali",
    "description": "JOB DETAILS: Job Title  Hydraulic and Hydraulic Engineer  Key Roles/Responsibilities and qualifications required  Roles/responsibilities Analysis and development of technically complex hydrologic and hydraulic computer models for site-specific floodplain assessments Permit application evaluations Review of in-house flood control projects Evaluation of proposed dam and levee projects or proposed modifications to existing structures  Responsible in the collection of climatological data.  Responsible to record and evaluate this data prior to use for drainage design purposes.  Responsible to establish the ideal rainfall, intensity, duration, and frequency data and ensure it corresponds to the data being applied to the design of drainage structure including culverts, canals and bridges.  Responsible to prepare individual watershed areas for each drainage structure located along the proposed road alignment.  Responsible to calculate the ideal time of concentration of runoff from... remote areas down to the point of interest on the road.  Responsible to collect and evaluate stream flow data from previous records.  Responsible to conduct interviews with local residents in the area regarding flood history of the waterway to include flood height, duration, and frequency.  Responsible to calculate the design peak discharge for each drainage structure in different design return periods.  designs and provide drawings for storm water management for every road in plan view.  Ability to perform hydrology and hydraulic design calculations for water flows, drainage systems, culverts, bridge openings, storm water management for roads, erosion, and sediment controls.  Perform any other task including those requested his superior  Educational Requirements & Related Job Experience/Qualifications  Should be a Civil Engineer with at least a Masters degree in hydrology and hydraulics Engineering with a minimum experience of 5 years and he or she should be proficient in English.  He/She should be member of the Rwanda Institute of Engineer.  A minimum experience of 5 years and he or she should be proficient in English.  Work Hours: 8  Experience in Months: 60  Level of Education: Associate Degree"
  },
  {
    "title": "Research & Knowledge Management Specialist",
    "company": "WaterAid Rwanda",
    "location": "Kigali",
    "description": "JOB DETAILS: Work Relationships Internal: Head of Programmes, Program Managers, PMEAL, Communications & Campaigns Specialist, WaterAid East Africa Regional team, UK and other WaterAid offices, External: WARw partners, Media, Donors, Government Officials  Local and National, Line Ministries, UN Organisations, research institutions, academia private sector, Civil Society Organisations, CBOs and other I/NNGOs  B. Job Purpose Job Purpose The Research and Knowledge Management Specialist lead and contribute to the conceptualization, design and conducting research for programmes , generating policy oriented evidence; generate and synthesize knowledge; play key role in documentation, knowledge capture and sharing, and dissemination of WaterAid Rwanda best WASH practices, key learnings, research findings, documenting the impact of our work from various stakeholders, to enhance visibility, amongst the development sector and other stakeholders (both governmental and NGOs, civil society... organizations and the donor community at large). S/He will facilitate the development of a learning culture across the organisation. In addition, S/he will engage with colleagues in other WaterAid country programmes and the International Programmes Department in managing WaterAid's internal programme and policy information library, organising learning events and developing knowledge outputs in various forms such as reports, case studies, posters, and infographics.  C. Main Responsibilities and Duties Research and Knowledge Management  Conduct, commission and supervise research that strengthens the case for WASH policy change.  Conduct systematic reviews and synthesis of published and unpublished research and other evidence and interpret the results into policy-oriented advocacy material; and generate original ideas based on the findings  Document and share learning on WASH policy issues and civil society engagement.  Undertake research on the projects and programmes, primarily to produce policy briefs on behalf of and in conjunction with other project staff.  Gather, analyse, and ensure the exchange and circulation of information on WARWs programmes and government activities related to projetcs.  Design and implement operational research and development activities, including documentation of best practices and lessons learnt  Conduct research and document the impact of our work to the direct and indirect beneficiaries  Initiate and coordinate studies and evaluations by external consultants related to project baseline/end line and evaluations by supporting the hiring process, overseeing quality and disseminating/sharing results.  Conduct regular field visits to collect primary data for producing knowledge product and evidence that can guide WARWs programme design and influencing work.  Study and observe works of other organisations both and national and global levels, capture lessons from their good practices and share internally which will inform effective design of projects and influencing at WaterAid Rwanda.  Conduct research assessment on the global high-level WASH commitments and the level of implementation at regional and national levels.  Conduct research on how GESI, Climate change, and other WASH cross cutting issues such as sustainability, technologies and data are integrated in our WASH programming  Ensure knowledge and information are stored in a safe and effective, and, where required confidential, manner.  In coordination with PMEAL colleagues, support the collection, validation, analysis and dissemination of information related to Knowledge Participate in the development of frameworks, methods and tools to support process improvement and knowledge management activities.  Develop situation reports and other information and knowledge products to support programme and influencing work of WaterAid Rwanda  In coordination with the PMEAL colleagues, support for data visualization including products to support advocacy, resource mobilization efforts, information, education, and communication (IEC) material, etc.  Support the development and dissemination of knowledge and experience through enhanced communication, strengthened knowledge products and publications.  Support programme and advocacy teams to develop policy briefs and other knowledge products from the results of MEAL coordinated/managed evaluations/studies as required.  Engaging policy makers to promote application of research evidence in planning and decision-making process Building capacity in translation, dissemination and use of research evidence by policy makers and other stakeholders at national  Publications and documentation  Collect, collate, edit, publish and distribute relevant Country Programme documentation used for shared learning, branding, awareness and information  Build capacity of staff and partners to contribute to various WA publications.  Participate in the production of documentaries, photo and video shoots showcasing work in the project areas.  Prepare and edit articles for inclusion in sector newsletters, international publications and WA internal/external websites.  Manage, maintain and regularly update the Country Programme site on the internal WaterAid website and provide input to update the Country Programme section on the external websites.  Report quarterly on the progress of project work and the issues arising from that work and contribute to the six monthly and annual reports.  Provide support to the Country Programme team on document formatting and management of photographic and video footage  Manage and maintain an indexed catalogue of soft and hard copies of Country Programme reports and documents in retrievable formatting.  Ensure that advocacy information is updated on all relevant WaterAid platforms e.g. Project Centre.  Partnerships and Resource Mobilization  Build and maintain collaborative partnerships with research institutions, implementing agencies, communities academic institutions etc  Contribute to WaterAids fundraising initiatives through concept, documenting impact of our work, proposal development and reporting.  D. Key Competences, Skills, experience, and Knowledge Qualifications, Knowledge and Experience  A Masters degree preferably Development studies, Communications, Knowledge management, Information science, anthropology, economics, Public Health., Social sciences, or other related and relevant relevant discipline.  At least 5 (five) years of demonstrated experience in knowledge management and learning with reputable organisations preferably INGOs, donor agencies or international organisations.  Strong qualitative and quantitative research skills; a track record in coordinating research programmes; and hands-on experience in synthesising and translating research evidence into outputs for policy engagement and shared learning  Experience in information management (managing electronic and manual publications, systematising creation, control, update, disposal etc of records)  Experience developing a range of knowledge and communication products and formats (for example: briefs, reports, case studies) for varies audience and preferences. Collect, analyse and synthese data (literature reviews, evidence syntheses, semi-structured interviews, and data analysis) involving multiple data sources and types.  Competency in WaterAid common approaches to work including partnerships, convening, inclusion, systems strengthening, climate change, creating behavioral change, community engagement and mainstreaming gender and inclusion of youth.  Knowledge on both qualitative and quantitative research methods; study methodology, tools for capturing knowledge and learnings, MEL techniques and tools, and application of computer software (MS Excel, SPSS, GIS, data visualization software) and monitoring devices shall be considered as an advantage.  Excellent analysis and writing analytical quality report skill is crucial; ability to present study findings with excellent data visualization techniques, and electronic data archiving is required.  Excellent communication skills and experience to work with partners and donors.  Behavioural competencies  Must be self-motivated with good interpersonal skills, team player and capacity to work in a multicultural setting.  Pro-activeness, problem solver, positive attitude and professional integrity.  Capable to work under extreme pressure, ability to prioritize works and meet deadlines.  Should demonstrate gender and cultural awareness.  Ready to undertake extensive field visits as required.  Work Hours: 8  Experience in Months: 60  Level of Education: Associate Degree"
  }
]