[
  {
    "title": "Directeur administratif et financier West Africa Water",
    "company": "Swiss Fresh Water",
    "location": "Senegal",
    "description": "Recherche Directeur Administratif et Financier  Disponibilit Immdiate  Dakar - Sngal  West Africa Water SA (filiale de Swiss Fresh Water SA) recherche un(e) Responsable Administratif et Financier (H/F).   propos de Swiss Fresh Water et West Africa Water :  Rejoignez une aventure entrepreneuriale ambitieuse et socialement responsable ! Swiss Fresh Water, un leader dans la fourniture d'eau de boisson de qualit  prix abordable, est engag dans un modle durable et respectueux de l'environnement en Afrique subsaharienne. Apprenez-en plus sur notre vision sur www.swissfreshwater.com.  West Africa Water, notre dynamique filiale au Sngal, offre aux populations une eau de qualit suprieure,  DIAMO , reconnue pour son got, sa fracheur et sa lgret. Nous produisons et commercialisons cette eau  travers des sites de production dcentraliss, ainsi que des services de livraison via des bouteilles rutilisables commercialises  des tarifs 2  5 fois moins chers que leau... minrale, offrant une solution cologique, conomiquement viable, cratrice demplois et socialement engage.  Votre Mission en tant que Directeur Administratif et Financier :  Rattach(e) au Directeur Gnral, vous pilotez la gestion financire et administrative de notre filiale, en veillant notamment  la fiabilit de notre comptabilit,  la construction et au suivi de budgets de manire rigoureuse, et  la ralisation de reportings financiers mensuels au service des quipes et de la performance, et des actionnaires. Votre expertise contribuera directement au succs de nos quipes commerciales et aprs-vente, grce  un contrle de gestion oprationnel efficace et orient business et un contrle interne de qualit.  Principales Responsabilits :  Comptabilit fiabilise dans les dlais et reportings financiers mensuels.  Travail avec lquipe en Suisse pour la production des comptes consolids.  Contrle de gestion oprationnel et KPIs pour pilotage de la performance et communication aux investisseurs Contrle interne, dfinition et contrle des procdures  Gestion des chapitres administratifs notamment sociaux, juridiques et fiscaux Management des quipes comptabilit, achats et service gnraux, et des partenaires externes (fiscal, juridique, audit, banques)  Profil Recherch :  Fort intrt pour les aspects oprationnels, orient(e) business, hands on  Gestionnaire rigoureux(se) et agile capable damener de la structure dans un environnement startup.  Leader nergique  laise dans un environnement  volution rapide.  Fortes comptences analytiques et relationnelles.  Force de proposition au sein du comit de direction.  Intrt pour le dveloppement durable et linnovation sociale.  Indicateurs de performance :  Production des indicateurs financiers et analytiques, de manire fiable, et dans les temps.  Contrle des cots, contrle interne efficace, et optimisation de la performance financire.  Contribution au process de leve de fond.  Nous cherchons un(e) candidat(e) enthousiaste, prt(e)  s'investir dans un projet porteur de sens et d'impact. Si vous tes motiv(e) par cette opportunit unique de contribuer  notre mission, envoyez votre CV et lettre de motivation  serge.ndao@swissfreshwater.com. Rejoignez-nous pour faire la diffrence et apporter de l'eau de qualit suprieure  un prix abordable  ceux qui en ont le plus besoin, tout en contribuant  construire un modle indit de production et distribution deau"
  },
  {
    "title": "Consultant: Water Specialist/Spcialiste en Eau, Senegal",
    "company": "EnCompass LLC",
    "location": "Dakar",
    "description": "NOTE: Job description posted in English and French/ La description du poste est affiche en anglais et en franais  EnglishPosition Description  EnCompass LLC is seeking a consultant to serve as Water Specialist for a performance evaluation of the NEE (Ndiyam E Ekkolaaji) Activity. We are looking for a consultant with experience with construction or rehabilitation of water and sanitation in in Senegal. The position involves may include travel within Matam region.  EnCompass LLC implements the USAID-funded contract, Monitoring, Evaluation, and Learning in Senegal Platform (the Platform) in partnership with MSI. The purpose of the Platform is to support USAID/Senegal in its performance management and contribute to building a sustainable MEL culture in Senegal through holistic engagement and strengthening of local practitioners and institutions. The Platform will provide evidence-based decision-making to support adaptive management in the Mission, engage USAID partners in their efforts... to continuously improve, and provide capacity-strengthening to local partners and MEL service providers.  Period of Performance  October 2023  February 2024  Estimate of working days: 18  Position Duties and Responsibilities  Administration  Essential functions  Submit a weekly progress report during the data collection phase  Technical  Review documents provided by USAID and other stakeholders to develop the evaluation methodology and data collection tools, and present findings from the document review.  Contribute to work plan development in coordination with team members, including methodology to address evaluation questions, sampling strategy, stakeholders to be interviewed, and data collection tools (interview and discussion guides)  Identify and conduct interviews with stakeholders identified in the workplan  Produce detailed interview notes after each interview  Contribute to data review and analyze to produce a Report for submission USAID  Support the development of the findings and conclusions table  Support the presentation of evaluation initial findings to USAID  Co-facilitate the workshop for the co-creation of recommendations with relevant stakeholders  Contribute to the writing of the evaluation report, integrating comments as needed  Contribute to PowerPoint development and presentation of findings for USAID  Any other tasks or activities necessary for the successful completion of the evaluation  Expected Deliverables Include The Following  Desk review matrix  Work Plan  Data collection tools for the different stakeholders identified in the work plan  Interview notes  Weekly progress report during data collection phase  Findings and conclusions table  Recommendations matrix  PowerPoint presentation of results  Draft of evaluation report  Final evaluation report with abstract  All work products to be determined in consultation with the Platform team  Position Requirements  Qualifications  Academic Qualifications  Advanced degree in social sciences or relevant field with 10 years of experience in development, evaluation and/or social science research. Bachelor's degree and additional years of experience may substitute  Experience and Skills?  Experience with managing water system in Senegal, familiarity with evaluation methodologies is an asset  Strong analytical, writing and synthesis skills are required  Advanced proficiency in French is required and fluency in English is an asset  Previous experience conducting assessments, evaluations, and/or research and experience with USAID an asset  Demonstrated experience with participatory and iterative research methods  Familiarity with qualitative and/or quantitative analysis software is an asset  How to Apply  Please submit CV to Senegal.recrutement@encompassworld.com with the subject line: Water Specialist by October 27, 2023.  Only short-listed candidates will be contacted  The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.  EnCompass LLC is a progressive Equal Opportunity Employer. We promote, celebrate, and support a diverse and inclusive organizational culture and workforce. We are committed to providing all of our employees with an environment free from discrimination and harassment, where all are treated with dignity and respect. We do not tolerate, and explicitly prohibit, discrimination or harassment of any kind, at any time, in all aspects of employment. This includes recruitment, hiring, promotions, disciplinary measures, terminations, compensation, benefits, social and recreational programs, and training. EnCompass also does not tolerate retaliation against individuals who report discrimination or harassment. Our continuing commitment to the principle of Equal Opportunity Employment for all means all employment decisions are based only on the job requirements, the candidates qualifications, and the needs of EnCompass as a businessnot on race, color, ethnicity, national origin, religion, belief, sex (including pregnancy and related medical conditions), gender identity or expression, sexual orientation, age, disability status, veteran status, genetic information, HIV status, family/marital/parental status, or any other status protected by the laws and regulations in the jurisdictions where we work.  For US based positions: The employer will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990.  The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.  The incumbent must be able to work in a fast-paced environment with demonstrated ability to juggle and prioritize multiple, competing tasks and demands and to seek supervisory assistance as appropriate.  If you require accommodations in line with the Americans with Disabilities Act to complete your application, please call 301-287-8700, provide your contact information and a description of your accessibility issue. We will make a determination on your request for reasonable accommodation on a case-by-case-basis, and we will call you back within approximately 3 business days.  EEO is the Law & EEO is the Law Supplement, Pay Transparency Nondiscrimination Provision  VEVRAA Notice  FRENCH  EnCompass LLC recherche un consultant pour servir de Spcialiste en Eau afin de faire lvaluation du projet NEE. Nous recherchons un consultant ayant une exprience dans la construction ou la rhabilitation des points deau ou dassainissement au Sngal.  Le poste peut inclure des dplacements dans la rgion de Matam.  EnCompass LLC met en uvre la Plateforme Monitoring, Evaluation, and Learning au Sngal (la Plateforme), financ par l'USAID en partenariat avec MSI. L'objectif de la Plateforme est de soutenir l'USAID/Sngal dans sa gestion des performances et de contribuer  l'instauration d'une culture MEL durable au Sngal, grce  un engagement holistique et au renforcement des acteurs et des institutions locales. La Plateforme facilitera la prise de dcisions fondes sur des donnes probantes pour soutenir la gestion adaptative de la mission, engagera les partenaires de l'USAID dans leurs efforts d'amlioration continue, et fournira un renforcement des capacits aux partenaires locaux et aux fournisseurs de services MEL.  Dlai D'Excution  Octobre 2023  Fvrier 2024  Estimation des jours de travail : 18  Rles et Responsabilits  Fonctions essentielles  Administration  Soumettre un rapport hebdomadaire de progression du travail durant la phase de collecte des donnes sur le terrain  Technique  Effectuer la revue des documents fournis par lUSAID et les autres parties prenantes pour dvelopper la mthodologie d'valuation et des outils de collecte de donnes, et prsenter les rsultats.  Contribuer au dveloppement du plan de travail avec les autres membres de l'quipe dvaluation, notamment la mthodologie, la stratgie dchantillonnage et lidentification des cibles et dveloppement des outils de collecte de donnes (guides d'entretien et de discussion)  Identifier et conduire des entretiens avec les acteurs identifis dans le plan de travail  Produire des notes dentretien dtailles aprs chaque interview  Contribuer  lexamen et lanalyse des donnes afin de produire un rapport  soumettre  lUSAID?  Participer au dveloppement de la table des constatations, et conclusions  Participer  la prsentation des rsultats prliminaires de lvaluation  lUSAID  Co-faciliter latelier de co-cration des recommandations  Contribuer  la rdaction du rapport dvaluation, intgrer des commentaires si ncessaire  Contribuer au dveloppement du PowerPoint des rsultats finaux et de sa prsentation  l'USAID  Toute autre tche ou activit ncessaire pour la russite de lvaluation  Les Livrables Attendus Sont Les Suivants  Matrice de la revue documentaire  Plan de travail  Outils de collecte de donnes pour les diffrentes parties prenantes identifies dans le plan de travail  Notes des entretiens raliss  Rapport hebdomadaire de progression de la collecte des donnes sur le terrain  Table des constatations et conclusions  Matrice des recommandations  PowerPoint de prsentation des rsultats  Draft du rapport dvaluation  Version finalise du rapport  Tous produits  dterminer en concertation avec l'quipe de la Plateforme  Exigence du Poste  Qualifications Acadmiques  Diplme suprieur en sciences sociales ou dans un domaine pertinent avec 10 ans dexprience dans le dveloppement, les valuations et/ou la recherche en sciences sociales. Une licence et des annes d'exprience supplmentaires peuvent remplacer le diplme  Expriences et Comptences  Exprience avec le systme de gestion de leau au Sngal, familiarit avec les mthodologies dvaluation est un plus  Solides comptences en matire d'analyse, de rdaction et de synthse sont requises  Matrise avance du franais est requise, matrise de langlais est un atout  Exprience antrieure dans la conduite d'valuations et/ou de recherches requise, une exprience avec l'USAID est un atout  Exprience avre des mthodes de recherche participatives et itratives  Familiarit avec des logiciels qualitatifs et/ou quantitatifs est un atout.  Comment Postuler  Merci de soumettre un CV  Senegal.recrutement@encompassworld.com avec pour objet : Spcialiste en Eau avant le 27 Octobre 2023.  Seuls les candidats prslectionns seront contacts  Les dclarations ci-dessus ont pour but de dcrire la nature gnrale et le niveau du travail effectu par les personnes affectes  ce poste. Ils ne constituent pas une liste exhaustive de toutes les tches, responsabilits et comptences requises du personnel concern"
  },
  {
    "title": "Systems Strengthening Director | Dakar, Senegal | 2023",
    "company": "Chemonics",
    "location": "Dakar",
    "description": "Chemonics seeks a systems strengthening director for the anticipated USAID Water, Sanitation and Hygiene activity in Senegal. The purpose of this new activity is to increase sustainable access to improved sanitation and water services while increasing consumer demand The systems strengthening director will deploy a systems approach to develop and lead interventions to strengthen factors (including regulation, service provision, technology, and accountability mechanisms), capacity of actors (including communities, local government, private and public institutions, households, and development agencies), and their relationships to improve the quality and accessibility of WASH services in Senegal. They will work closely with national-level stakeholders and local counterparts to identify, co-develop, and implement sustainable WASH approaches and interventions. This position will be based in Dakar, Senegal, with frequent travel to target activity zones throughout Senegal.  Chemonics... International Inc. is a US-based international development consulting company, operating in over 95 countries. We are looking for individuals who have a passion for making a difference in the lives of people around the world.  Responsibilities:  Serve as lead for technical component leading all WASH systems strengthening, working closely with counterparts from the Government of Senegal, private sector actors, and the Activitys implementing partners to develop and manage effective and responsive interventions  Determine technical needs and priorities to support activity implementation, such as:  Upgrading, rehabilitating, or building low-tech, decentralized wastewater systems and delivery of associated capacity strengthening for system operators  Water resource interventions that prevent or mitigate flooding, increase water storage, and strengthen early warning systems  Linking/facilitating spare parts and consumables supply chains  Management information systems for asset management, water resources data, water resource mapping  Work across teams to ensure the perspectives and voices of women, youth, and underrepresented or underserved groups are integral to the activitys implementation  Qualifications:  Advanced degree in international affairs, international development, water management, global public health, or another relevant field  Minimum of 10 years of relevant professional experience implementing WASH programs or strengthening WASH systems, particularly in the following technical areas: water production, transmission, and distribution; utility services strengthening; adaptation for climate resilient infrastructure; sewered sanitation networks; wastewater treatment; sludge management; water treatment systems; operations and maintenance; asset management; and capital investment planning  Demonstrated leadership, versatility, and integrity  Fluency in English required, additional language skills preferred  How to apply  Application instructions:  Please send an email with your updated CV, cover letter, and the contact information of three professional references attached and Systems Strengthening Director Senegal WASH Activity in the subject line to Mr. Luca DiDomenico at ldidomenico@chemonics.com by March 17, 2023. No telephone inquiries, please. Chemonics will contact finalists.  Chemonics is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity, marital status, disability, genetic information, age, membership in an employee organization, or other non-merit factors.  Chemonics values the protection of your personal data. If you are in the European Union, please read our EU Recruiting Data Privacy Notice to learn how we process personal data. You may access the notice via the following link: https://chemonics.com/eu-recruiting-data-privacy-notice"
  },
  {
    "title": "Humanitarian Water, Sanitation and Hygiene Adviso",
    "company": "Senjob",
    "location": "Dakar",
    "description": "Contract length: 1 year renewableChild safeguardingLevel 3: the post holder will have contact with children and/or young people either frequently (e.g. once a week or more) or intensively (e.  g. four days in one month or more or overnight) because they work country programs; or are visiting country programs; or because they are responsible f....."
  },
  {
    "title": "ONG ACCESS TO WATER recrute 01 Secrtaire Comptable.",
    "company": "ONG ACCESS TO WATER",
    "location": "Dakar",
    "description": "ONG ACCESS TO WATER recrute 01 Secrtaire Comptable H / F  Entreprise  ONG ACCESS TO WATER  Description de lentreprise  LONG Access To Water mne des programmes daccs  leau gratuite au Sngal, en installant des systmes de traitement lire la suite  Dtails de lannonce  Poste propos : Secrtaire Comptable H / F  Missions : Secrtariat :  Secrtariat :  Gestions des changes entre lONG et les partenaires, suivi des contrats de partenariats,  Suivi du stock de matriel  Suivi des actions de maintenance.  Comptabilit :  Tenir la comptabilit gnrale, des dbiteurs et des cranciers  Tenir du journal de caisse, des frais courants  Saisir les dcomptes dheures du personnel et leurs frais  Contrle et saisir les dcomptes dheures du personnel et leurs frais.  Profil recherch pour le poste : Secrtaire Comptable H / F  Qualifications :  Niveau Bac+2 en Comptabilit  Avec 2 ans dexpriences sur le terrain  Matrise des logiciels de Microsoft : Excel, Word... PowerPoint  Bon niveau professionnel en franais, crit et parl,  La comprhension de la langue anglaise est un plus, mais pas obligatoire.  Un rel intrt pour les projets de lONG.  Critres de lannonce pour le poste : Secrtaire Comptable H / F"
  }
]