[
  {
    "title": "Short Term Water quality officer (5 Months)",
    "company": "IRC - The International Rescue Committee",
    "location": "Baidoa",
    "description": "**Job Description**  The Water Quality Officer reports to the Environmental Health coordinator and is responsible for ensuring the supply of potable water to IDPs and host community members in south-west region of Somalia. The Primary responsibilities of Water Quality Officer includes overseeing the proper treatment of water at permanent and temporary treatment plants; supervision and monitoring of regular water quality test activities; set up of water quality data management system (data collection, try, analysis, reporting); and conducting regular trainings to build the staff capacity on water quality. The water quality officer position also requires proper management of equipment, consumables and other resources under the program and reporting periodically to supervisors.  *Detailed Responsibilities and Tasks**  *Operation:**  \\- Ensure proper treatment/disinfection of water at treatment plants. \\- Establish clear and straightforward management systems including Jar tests and... Chlorine dosage, chemical preparation, etc. \\- Organize regular water quality data monitoring system and conduct regular water quality test starting from the Intake, to different stages of treatment plant, tap stands, storage reservoir/s, household level, etc. to ensure IDP/host community are supplied with safe water as per IRC and international standards. \\- Develop necessary formats and a database for regular water quality data collection, data entry, storage, analysis and report production. \\- Raise purchase requests for procurement of equipment, reagents, treatment chemicals, and ensure the availably of all necessary items in stock for regular water quality test and operation. \\- Ensure the cleaning of treatment plant units, service reservoir, and clean water wells at regular, scheduled intervals. \\- Prepare the preparation of Operation manuals for the water treatment plants in Somalia (particularly for IDP settlements) \\- Work with Environmental Health team and coordinate with other sectors on information sharing related with water quality and promotion of proper water storage at household level. \\- Summarize and produce weekly, and monthly water quality report to the EH Coordinator. \\- Serve as the focal person for water quality issues for Somalia (particularly in South west IDP camps).  *Capacity building:**  \\- Conduct quarter regular training/refreshment/ jointly with the government water quality officers including EH team. \\- Prepare notes, modules, and other related resources regarding the training component and share for the trainees.  *Qualifications**  *SKILLS AND QUALIFICATIONS**  \\- Diploma or Bachelor level qualification in Sanitary Engineering, Water Quality Laboratory technician, Applied Chemistry, Biology, or any other relevant field. \\- Minimum 6 years work experience for diploma or 4 years for BSc on similar job. \\- Previous experience of managing/monitoring of town water supply \\- Good written and spoken English. \\- Good in Microsoft Office (especially with Excel)  **Standard of Professional Conduct***  **The IRC and IRC workers must adhere to the values and principles outlined in IRC Way - Standards for Professional Conduct. These are Integrity, Service, and Accountability. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.***  **Gender Equality & Equal Opportunity***  **Gender Equality: IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce including parental leave, gender-sensitive security protocols and other supportive benefits and allowances.***  ****Diversity and Inclusion*****  *at IRC, we are passionate about creating an inclusive workplace that promotes and values diversity. Organizations that are diverse in age, gender identity, race, physical or mental ability, nationality, and perspective are validated to be better organizations. More importantly, creating a safe workspace environment where everyone, from any background, can do their best is the right thing to do. So, bring your whole self to work"
  },
  {
    "title": "Short Term water and sanitation infrastructure Officer (5 Months)",
    "company": "IRC - The International Rescue Committee",
    "location": "Baidoa",
    "description": "**Job Description**  The purpose of the Water and Sanitation & Infrastructure officer is to ensure that all the WASH aspects detailed in the project including hygiene promotion at community and health facility level, rehabilitation and maintenance of WASH infrastructure at community and health facility level; are undertaken in a professional manner as per the standard design, specification and guidelines of the project.  *Key Responsibilities:**  To provide supervision and technical assistance to project staff for the assessment, design, monitoring and implementation of WASH projects and all infrastructure related projects across sectors within areas of operation in south-west region of Somalia.  \\- To prepare and submit monthly, quarterly and annual project progress reports. \\- Prepare detailed engineering design and tender documents for WASH and infrastructure projects such as water supply pipeline, storage, treatment and distribution system for water supply projects... latrines/sanitation infrastructures, schools, health facilities, rain water harvesting structures, dams, etc. \\- Develop design plans, working drawings, technical specifications, and bill of quantities as per approved standards by respective clusters or any other institution as required for all construction works outlined on the project design for the said projects using AutoCAD or similar drafting computer software.  1\\. Assessment 2\\. Project implementation 3\\. Project Monitoring 4\\. Information documentation and reporting 5\\. Evaluation  *Other Competencies/Attributes:**  \\- Demonstrates well-developed interpersonal skills, excellent communication skills, both verbal and written, as well as negotiation skills \\- Must adhere to set security standards \\- Ensure a gender perspective in the scope of work  *Qualifications**  *Qualifications: Education/Knowledge/Technical Skills and Experience**  \\- *Educational level required*: Bachelor degree in Civil Engineering, Water Engineering, Building Construction and or related field. \\- *Technical Training qualifications required*: Skills in auto cad, water Cad and/or EPANET.  \\- *Experience*: 3 years experience in project implementation preferably in water and sanitation or infrastructure.  \\- Proficiency in using computer software e. g MS office and internet.  \\- Fluency in Somali language and English is required  **Standard of Professional Conduct***  **The IRC and IRC workers must adhere to the values and principles outlined in IRC Way - Standards for Professional Conduct. These are Integrity, Service, and Accountability. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.***  **Gender Equality & Equal Opportunity***  **Gender Equality: IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce including parental leave, gender-sensitive security protocols and other supportive benefits and allowances.***  ****Diversity and Inclusion*****  *at IRC, we are passionate about creating an inclusive workplace that promotes and values diversity. Organizations that are diverse in age, gender identity, race, physical or mental ability, nationality, and perspective are validated to be better organizations. More importantly, creating a safe workspace environment where everyone, from any background, can do their best is the right thing to do. So, bring your whole self to work"
  },
  {
    "title": "Water Engineer-Garowe",
    "company": "Amal Bank",
    "location": "Garowe",
    "description": "Job Title: Water Engineer  Location: Garowe  Job Description: We are seeking a highly skilled and motivated Water Engineer to join Amal Real Estate and Construction. As a Water Engineer, you will be responsible for designing, implementing, and managing various water infrastructure projects. You will work on a wide range of assignments related to water supply, treatment, distribution, and stormwater and wastewater management. This position requires a deep understanding of engineering principles, excellent problem-solving abilities, and a strong commitment to environmental sustainability and resource management.  Responsibilities:  Conduct thorough analysis of water supply systems, including source identification, water quality assessment, and demand forecasting.  Design and develop efficient water treatment processes, considering factors such as sedimentation, filtration, disinfection, and chemical dosing.  Collaborate with multidisciplinary teams to plan, design, and implement... water distribution systems, ensuring optimal hydraulic performance, reliability, and cost-effectiveness.  Perform hydraulic modeling and simulations to evaluate system performance and identify potential improvements.  Conduct field investigations and collect data for water infrastructure projects, including site surveys, water sampling, and monitoring.  Prepare detailed engineering drawings, specifications, and technical reports for water projects.  Evaluate and select appropriate water infrastructure materials, equipment, and technologies.  Provide technical support and guidance to junior engineers and technicians.  Ensure compliance with regulatory requirements and environmental standards throughout all project stages.  Collaborate with government agencies, consultants, contractors, and other stakeholders to ensure successful project delivery.  Stay updated with the latest advancements in water engineering practices and contribute to ongoing professional development.  Requirements:  Bachelors degree in Hydrology, Geology, Environmental Engineering, or relevant degree. A Masters degree is preferred.  Proven working experience as a Water Engineer with a minimum of 7 years experience  Proven experience in water engineering, including design and management of water infrastructure projects.  Proficiency in relevant engineering software, such as hydraulic modeling tools (e.g., EPANET, WaterCAD) and AutoCAD.  Strong knowledge of water treatment processes, water distribution systems, and wastewater management practices.  Familiarity with regulatory frameworks and industry standards related to water engineering.  Excellent analytical and problem-solving skills, with the ability to identify and resolve complex engineering challenges.  Effective communication and interpersonal skills, with the ability to collaborate with multidisciplinary teams and stakeholders.  Excellent project management abilities, including budgeting and scheduling.  Ability to adapt to changing priorities and work under tight deadlines.  Commitment to environmental sustainability and water resource management.  Report writing skills"
  },
  {
    "title": "Water Engineer | Burao | Somalia | Somaliland",
    "company": "WeltHungerHilfe (WHH)",
    "location": "Burco",
    "description": "ORGANIZATION AND POSITION OVERVIEW  Welthungerhilfe (WHH) Welthungerhilfe is one of the biggest private development organizations in Germany. It was founded in 1962 as the National Committee for the Freedom from Hunger Campaign of the Food and Agricultural Organization of the United Nations (FAO). Welthungerhilfe is non-profit, non-political, and non-denominational. With a global presence in 33 countries, WHH has been actively engaged in multisector interventions across four regions of Somaliland (Awdal, Maroodi-jeh, Toghdeer, and Sanaag) since 2001 and recently secured EU funding for Toghdeer, Somaliland.  WHH is looking for a professionally confident, self-motivated, experienced, and committed team player to fill the vacant position of Water Engineer. The primary objective of the position is to manage and supervise water structure construction and rehabilitation projects effectively. The selected expert will closely liaise with implementing partners such as ACTED and Candlelight... (CL) while fostering collaboration with relevant government agencies.  1. Objectives of the position  The position's objective is to effectively manage and supervise water structure construction and rehabilitation projects. This involves overseeing ongoing work, ensuring contractual adherence, maintaining construction quality, and meeting project deadlines. Collaboration with project engineers and managers is essential in preparing various reports, TORs, success stories, procurement, and joint technical assessments with the Ministry of Water Resources and Development.  Duties and area of responsibility  2.1. Duties with own area of responsibility  1. In close collaborations with the MoWRD/MoRD and local stakeholders, the engineer will support site selection process based on the requirement of the donor.  2. In close collaboration with other project engineers and the project manager, she or he will provide regular supervision of ongoing work at critical stages and provide technical recommendations regularly to contractors to ensure strict adherence to the signed contract.  3. Ensure the good quality of water structures under construction by providing close monitoring to ensure the usage of quality construction materials such as cement, ballast sand pipes, fittings, solar panels, and pumps in line with the signed contract agreement.  4. In close collaboration with the other project engineer and the project manager, the engineer will conduct joint technical assessments with the MoWRD for newly targeted villages and develop drawings and BQs.  5. Make sure that all ongoing construction work meets set deadlines by pushing contractors and providing the required support to do so in a timely manner.  6. The engineer will be responsible for confirmation of progress made and processing payments to contractors at different construction milestones as stipulated in the contracts.  7. Ensures that workers, e.g., plumbers and masons, have all the right tools and equipment for the right job at all construction sites.  8. Ensure that plumbers are using the required pipes and fittings in the right direction in all sections of the piping system.  9. For direct implementation (not so much encouraged), he or she will perform the registration and tracking of materials such as cement, pipes, and fittings in and out of  the store at every construction site and update the head of the project regularly.  10. Compile a short report and provide briefings on a daily basis on progress made, using material with photos as evidence.  11. Register all daily workers and ensure they sign the daily attendance sheet to support their payments.  2.2. Duties without own area of responsibility  1. Work in liaison with the administration of the town and the water committee to establish a close collaboration to finalize the activities as planned.  2. Regularly monitor and accurately quantify all manner of work to be done according to current market rates at all assigned sites and share it with the Head of Project.  3. In close collaboration with the WHH Project Engineer, monitor and measure completed works at the required stages and submit payment release reports to finance and the head of the project.  4. Prepare site progress reports, TORs, success stories, and any other site-related literature and submit it to the Head of Project.  5. Update the price list of commonly used construction materials and submit it to the Head of Project.  2.3. Specific Activities and duties of the position  1. The engineer will form part of the technical working group and will provide updates and lessons learned for improvements.  2. Conduct a technical assessment of the proposed water structure to be rehabilitated and suggest durable techniques that can be easily adopted by the locals for maintenance.  3. Train selected locals on how to maintain the constructed/rehabilitated water source/road using local materials and equipment.  4. The engineer will estimate required materials, raise PRFs, and support the procurement process within the current market rates.  5. Provide periodic supervision at the sites and guide the selected local workers on the road rehabilitation works.  6. In collaboration with local community workers, the engineer will suggest suitable, adoptable tools and equipment that fit in the local context for road construction and future rehabilitation.  7. The engineer will provide technical guidance to the local workers during the construction of dry masonry drifts, which are slightly raised above the ground level and constructed of impervious structures, to avoid water absorption but harvest it instead.  8. Documentation of relevant technical and procurement processes in accordance with the co-financing agreement or Welthungerhilfe directives (such as the Assignment Allocation Regulation, AAR)  9. Fulfillment of any other tasks that are assigned by the management and correspond in general with the character of this position"
  },
  {
    "title": "Chief Wash",
    "company": "United Nations Children's Fund",
    "location": "Somalia",
    "description": "Within this context, water governance in Somalia is impacted by limited horizontal and vertical coordination between water sector institutions and those sector institutions supporting socio-economic development. In many instances these institutions have limited resources and stretched capacity. These institutions play a key role in supporting the evolving policy, legal and institutional framework, in strengthening water resource management based upon improved scientific data and information, and in developing infrastructure to support development and address climate extremes. Cognizant of the myriad of challenges facing Somalias declining water resources, progressive effort to develop a sound constitutional framework to solidify state-building reforms and enact legislative and regulatory instruments for the case for water sector cannot be gainsaid.  Summary of key functions/accountabilities:  Managerial and technical leadership  Strategic guidance in Programme development and... planning  Efficiency in programme management, monitoring and quality control of results  Advisory services and technical support  Advocacy, networking and partnership building  Quality, timeliness and predictability of humanitarian WASH preparedness and response  Innovation, knowledge management and capacity building  Managerial and technical leadership:  Establish the annual work plan, determining priorities and performance measurements. Monitor workplan implementation, to ensure that WASH output results are achieved to schedule and performance standards. Report critical issues to the Deputy Representative for timely action.  Establish the annual workplan outputs, activities and developmental priorities of the WASH section staff. Provide timely guidance to enable the WASH section staff to perform their duties responsibly and efficiently.  Manage WASH team building and motivation. Signal potential conflicts and take preventive action, in coordination with Human Resources staff.  Strategic guidance in programme development and planning  Oversee the preparation of the WASH inputs for the situation analysis. Ensure that comprehensive and current data is used to inform WASH policy and programme development, planning, management and implementation. Keep abreast of global, regional and national WASH sector developments, for maximum efficiency and effectiveness in WASH programme design, management and implementation.  Collaborate with colleagues and partners to discuss national WASH priorities, resources, strategies and methodologies to ensure the most strategic use of the collective resources of external support agencies.  Lead the development of the WASH outcome and output results of the country programme, along with related background, strategic analysis and delivery strategies, ensuring alignment with the UNICEFs Strategic Plan, UNICEFs global WASH strategy and the country programme as well as government plans and priorities, and the role of other WASH external support agencies. Lead the development of output-related indicators, baselines, targets and means of verification. Lead the development of the WASH content of the CPAP.  Ensure the development and management of a fund-raising strategy for WASH, aligned with the WASH output results in the country programme, and lead interactions with senior staff of donor agencies.  Support the development and modification of UNICEF WASH policy and strategy instruments based on WASH programming monitoring, studies and assessments, and UNICEF field experience and lessons learned.  Efficiency in programme management, monitoring and quality control of results:  Prepare documentation for programme reviews and analytical statements on progress and constraints of WASH outcome and output results.  Provide technical and operational support throughout all stages of programming processes for the achievement of the WASH output results. Ensure effective collaboration with other UNICEF sectors, where needed.  With other external support agencies, analyze national government WASH sector programmes and projects, with a focus on WASH outcomes (behaviors), using bottleneck analysis tools available in the sector (WASH-BAT, CSOs, SDAs).  Manage monitoring and evaluation of the WASH programme and its components, programme reviews and annual sectoral reviews with government and other partners and prepare reports for CO management and WASH sector coordination bodies.  Monitor, report and certify the use of sectoral programme resources (financial, administrative and other assets), verify compliance with approved allocations, organizational rules, regulations/procedures and donor commitments, standards of accountability and integrity.  Ensure timely donor reporting, negotiate any changes required to agreements with donor in a timely manner. Ensure systems are in place for HACT compliance.  Advisory services and technical support:  Participate in strategic discussions to influence national WASH policies and strategies, including the reduction of inequalities, contributing to global sector learning.  Advise senior officials in government, NGOs, UN agencies and WASH sector donors on WASH policies, strategies and best practices.  Lead the preparation of policy papers, reports, briefing notes and other strategic materials for use by management, donors, UNICEF regional offices and headquarters.  Coordinate the use of technical experts from the Regional Office and HQ, as and where appropriate in the WASH programme, through remote support and on-site visits.  Advocacy, networking and partnership building:  Build and strengthen strategic partnerships with government counterparts, UN agencies, donor agencies, WASH institutions, NGOs, research institutes and the private sector to stimulate coordination and collaboration.  Oversee the analysis of national budgets for WASH, cost analysis and value-for-money studies, to advocate for improvements in sector efficiency.  Produce materials for WASH programme advocacy to promote awareness, establish partnerships and support fund-raising.  Represent UNICEF in inter-agency discussions, ensuring that UNICEFs position, interests and priorities are fully considered and integrated in planning and agenda setting.  Interact with global and regional initiatives and partnerships for WASH and support / assume UNICEF leadership in key global/regional WASH platforms  Quality, timeliness and predictability of humanitarian WASH preparedness and response:  Ensure the annual preparation/revision of UNICEFs preparedness for WASH in emergencies.  Ensure the coordination arrangements for humanitarian WASH are in place, for instant robust coordination in case of an emergency.  Ensure that all UNICEF WASH staff are familiar with UNICEFs procedures for responding in an emergency.  In case of an emergency, ensure that UNICEF meets its commitments for WASH in the response and early recovery.  Support government to strengthen WASH emergency preparedness.  Innovation, knowledge management and capacity building:  Organize and lead the development, implementation, monitoring and documentation of WASH action research and innovation (technical or systems), ensuring rigorous monitoring and wide sharing of results.  Determine priorities for learning/knowledge products, covering innovative approaches and good practices, to support overall WASH sector development.  Systematically plan, support and monitor the professional development of UNICEF WASH staff, to ensure our sector capacity remains up-to-date with latest developments.  Organize the systematic assessment of WASH sector capacity gap analysis, in collaboration with government and other stakeholders, and support the design of initiatives to strengthen capacities systematically.  Ensure regular updates of the UNICEF knowledge sharing platforms with WASH learning / knowledge products in support of the organization wide Enterprise Content Management (ECM) initiative, including support in the feedback and use of the knowledge products and learnings.  To qualify as an advocate for every child you will have  An advanced university degree in one of the following fields is required: public health, social sciences, health and hygiene behavior change communication, environmental or public health, water resource management or another relevant technical field.  Additional relevant post-graduate courses that complement/supplement the main degree are an asset.  A minimum of ten years of professional experience in WASH-related programmes at the national and international levels in a mix set of country context (including humanitarian, fragile, developing) is required.  Proven ability to effectively lead a team to deliver results is required.  Emergency field experience working in humanitarian situations, including deployment missions (with UN-Govt-INGO) is required.  Experience working in multiple geographic regions is strongly desirable  Fluency in English is required. Knowledge of another official UN language or a local language is an asset.  Source: https://jobs.unicef.org/cw/en-us/job/564500"
  },
  {
    "title": "Wash Assistant",
    "company": "IRC - The International Rescue Committee",
    "location": "Dhuusamareeb",
    "description": "**Job Description**  The WASH Assistant will work with under the overall leadership of the WASH Coordinator for the implementation of the IRC WASH program in Somalia, but directly supervised by the WASH Officer. The WA will create links between the IRC, the community elders, the community at large and other stakeholders.  *Roles & Responsibilities**  \\- The position is responsible for rehabilitation and construction activities for target IDP camps in Galgadud WASH systems - including water systems, sanitation facilities and hygiene promotion. This includes all elements of Supervision, planning, and quality control. \\- The WASH Assistant will be assisting implementation water, environmental sanitation, and hygiene promotion activities in the operation area. \\- Mobilize all stakeholders to respond appropriately to outbreaks of cholera and acute watery diarrhea. \\- To facilitate community hygiene outreach for internally displaced people (IDPs) camps including the host communities. \\- To... ensure that planned hygiene promotion activities are being undertaken correctly in designated project locations, usually in coordination with other WASH activities. \\- Facilitate and ensure that all hygiene components and sanitation issues are understood and implemented among the communities/IDPs. \\- Conduct household water safety and hygiene promotion assessment and build the capacity of local communities for sustainable water safety and hygiene promotion services. \\- Support and conduct training of water management committees \\- Support the existing community organization for dialogue in order to improve and upscale positive hygiene practices among the communities/IDPs \\- Conduct water quality surveys at all IRC rehabilitated water supply systems.  *Qualifications**  \\- Diploma certificate in Water Supply, Public Health or related discipline, or equivalent work experience in community water, sanitation, and hygiene program. \\- At least one year & halve experience in working with an INGO in WASH sector \\- Relevant training and experience in Water, Sanitation, and hygiene. \\- Experience in community social work \\- Good report writing and communication skills  **Standard of Professional Conduct***  The IRC and IRC workers must adhere to the values and principles outlined in IRC Way - Standards for Professional Conduct. These are Integrity, Service, and Accountability. In accordance with these values, the IRC operates and enforces policies on Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.*  **Gender Equality & Equal Opportunity***  Gender Equality: IRC is committed to narrowing the gender gap in leadership positions. We offer benefits that provide an enabling environment for women to participate in our workforce*  including parental leave, gender-sensitive security protocols and other supportive benefits and allowances.*  **Diversity and Inclusion***  at IRC, we are passionate about creating an inclusive workplace that promotes and values diversity. Organizations that are diverse in age, gender identity, race, physical or mental ability, nationality, and perspective are validated to be better organizations. More importantly, creating a safe workspace environment where everyone, from any background, can do their best is the right thing to do. So, bring your whole self to work.*  IRC is committed to creating a diverse, inclusive, respectful, and safe work environment where all persons are treated fairly, with dignity and respect. In keeping with our core values of Integrity, Service, Accountability and Equality, IRC strives to maintain a work environment built on mutual respect in which all individuals treat each other professionally, and free of bias, prejudice, and harassment. IRC expressly prohibits and will not tolerate discrimination, harassment, retaliation, or bullying of IRC Persons in any work setting. All IRC staff, wherever they are located, are accountable for creating an environment free of discrimination, harassment, bullying, and retaliation"
  },
  {
    "title": "WASH Engineer",
    "company": "Somali Relief and Development Action",
    "location": "Mogadishu",
    "description": "JOB SUMMARY:  The Project Engineer is responsible for coordinating and implementation of Water, Hygiene and Sanitation and water delivery system including daily management of program activities and program staff, and ensuring appropriate systems and support mechanisms are in place to track, analyze and report on results. S/he is responsible for coordinating and implementing the necessary water and sanitation (WASH) facilities constructed for the IDPs and Host community and will serve as a strong team leader, able to develop and mentor team members in Luuq and Dolow with the skills of an effective communicator, able to work with internal and external stakeholders to achieve common objectives. The Project Engineer is responsible for managing relationships with local partners, beneficiaries and partners representatives. S/he has the ability to effectively lead and implement water and sanitation infrastructure project in an emergency setting for IDP camps in less than ideal conditions as... well as the ability to develop an effective implementation plan and alternative project delivery methods to meet very tight construction schedule. S/he has the experience dealing with multiple contractors to ensure projects are done on-time and within budget.  ESSENTIAL JOB FUNCTIONS  Design and Planning  Contribute to the analysis of the humanitarian and development WASH needs in the district and provide technical input to the Director of Programs for design of appropriate, technically sound WASH programming.  Ensure quality WASH programming through regular monitoring and evaluation of the project activities and providing technical support to the WASH team on the field and the local communities.  Lead the WASH team and ensure their co-ordination with other departments (Logistics, Admin and Finance, etc).  Introduce strategic program integration (WASH, Nutrition, and Food Security programs) through joint assessments and work plan development.  Enhance SRDAs technical contribution to the WASH sector through improving coordination, networking, and research and policy engagement with other agencies at the national and regional level.  Enhance and ensure adequate WASH capacities at Dolow office and field depending on the development and humanitarian needs.  Ensure WASH approaches are technically sound and appropriate for the context and environment of interventions (IDPs)  Implementation and Programs Coordination  Design and introduce innovative approaches and activities in the WASH sector leading to a comprehensive and integrated WASH strategy.  Identify strategic research issues from program and sector level challenges in the country that SRDA can address and contribute at program and policy levels.  Plan and develop appropriate development and emergency WASH interventions for the areas where SRDA operates as well as identify new emerging opportunities for program expansion.  Provide strategic management of SRDA WASH objectives and promote strong linkages with other cross cuttings themes (gender and resilience, etc).  Develop appropriate targeting criteria and mechanisms for WASH interventions to ensure the needs of identified vulnerable groups are met  Take the lead in designing, managing and implementing WASH programs in the region.  Support and lead the WASH Team in developing and implementing acceptable WASH infrastructure designs, using appropriate technology.  Ensure SRDA WASH team and local contractors follow standard policies, protocols and guidelines.  Make sure all WASH activities are properly integrated into other programming considerations.  Support logistics in developing technical tender/bid documents related to WASH activities.  Approve and Review WASH related procurement requests.  Support the WASH Team in developing and reviewing activity based budgets for all WASH program activities.  Implement monitoring, evaluation and learning activities, including the development of tools for WASH programming in coordination with Monitoring, Evaluation and Learning (MEAL) teams.  Contribute to related donor reports and proposals and information sharing as appropriate.  Representation  Represent SRDA in meetings and discussions on all WASH sect oral issues with other implementing actors and donors.  Ensure all WASH activities are carried out in accordance with local government policies and do not duplicate or interfere with activities proposed or carried out by the government and/or other NGOs.  Actively participate and represent SRDA in different WASH forums and networking including the WASH Cluster.  Attending monthly and WASH Cluster meeting at regional and national level.  Fill in WASH Cluster monthly 4W matrix  Safety, Security and Access  Ensure compliance with security procedures and policies as determined by the safety and security department.  Proactively ensure that team members operate in a secure environment and are aware of policies, Procedure and SOPs.  KNOWLEDGE AND EXPERIENCE  BSc degree in Civil/Water/ Environmental Engineering or Public Health or other related field, MSc preferred.  3 years experience of design and construction of water and sanitation infrastructure experience  Experience working in development and emergency contexts with humanitarian organizations, in a similar position.  Experience in working with local contractors and communities in a volatile context.  Experience of contract management on medium-large scale WASH projects  Demonstrated ability to manage and communicate effectively with team members of varied work styles.  Experience in chairing/ moderating forums and Workshops.  Ability to conduct rapid, needs and baseline assessment and have strong analytical skills and report writing  Excellent computer skills including familiarity with Autocad (latest version), ARC GIS, Microsoft Word and Excel.  Excellent oral and written English skills required; proficiency in Somali is a plus.  Strong written and verbal communication skills.  Experience of Integrated Water Resource Management  Experience of Public health promotion and community mobilization  Strong knowledge of and ability to train others on CHAST, PHAST and CLTS approaches  How to apply  Interested candidates who meet the criteria above are encouraged to send their CV and motivation letter clearly indicating the Position to recruitment@srdaorganization.org by 20th August 2022.  Please be informed only shortlisted candidates will be contacted. Please indicate WASH Engineer as the subject  SRDA is an Equal Opportunity Employer. Female candidates are strongly encouraged as much as men to apply"
  },
  {
    "title": "Wash Engineering-Garowe",
    "company": "SRCS",
    "location": "Garowe",
    "description": "SRCS is a non-political, independent humanitarian organization and is part of the International Red Cross and Red Crescent Movement.  Job Description  JOB DESCRIPTION  WASH ENGINEER  Job Grade: 7  Department: Wash Engineering  Location Garowe with covering all Puntland Branches  Reports To: Disaster Management Director  Technically Reports None  Background  SRCS is an independent, non-political humanitarian organisation. It was established in April 1963 and became a legal entity following Presidential Decree No. 187 in 1965. SRCS has operated continuously throughout the countrys period of civil war and political divide and is credited for its unity as one National Society. It operates through a network of nineteen branches with activities spread all across the country.  SRCS is currently seeking to recruit a qualified candidate to fill the vacant position of Wash Engineer based in Garowe and covering all puntland branches.  Duties and Responsibilities  Preparation of technical... designs and drawings, Bill of Quantities/cost estimation, tender documents and supervise for all WASH infrastructures including the installation of solar systems  Supervises contractors working on project sites and conducts quality control of infrastructure installed by the national society.  Ensures that contract terms are understood and respected by the contractors  Establishes a close working relationship and networks with the relevant stakeholders  Oversees hand-over of SRCS-provided infrastructure to end-users  Organizes trainings for end-users in relation to the operation and maintenance of infrastructure installed by SRCS  Prepares activity implementation/progress reports and shares with the technical supervisor  Assist Operations officer and the NS relevant branch in rehabilitation design and implementation of program  Verification of the appropriate standard and quantity of materials used in water and sanitation schemes.  Ensuring construction of projects in accordance with approved designs  Providing training to community members on proper operation and maintenance of schemes  Work in close cooperation with all key stakeholders including government authorities, community leaders, beneficiaries, partner organizations, and other providers.  Ensure timely and efficient monitoring and evaluation of project activities  Contribute to the development of water and sanitation schemes  Assist in the design and implementation of other complementary rehabilitation interventions (including livelihoods).  Participate in field assessments, baseline studies and periodic studies in order to map areas requiring new water sources and sanitation facilities in Puntland regions.  Compile quality construction, progress reports and updates  Conduct any other programming responsibility delegated by the supervisors.  Closely collaborate an liaise with the SRCSs country operations officer  Fulfill another tasks directed by the line manager.  Skills and Qualifications  Minimum qualifications and required competencies  University degree in Civil Engineering, Construction management, Architecture, mechanical, water or environmental engineering  3 years of professional experience in the supervision of WASH-related infrastructural/Civil engineering works; experience working with an international humanitarian organization is an asset  Proficient in the use of drawing software; AutoCAD, WaterCAD, or other relevant software  Experience in managing technical support staff  Detail-oriented, highly organized and practices strict adherence to timelines  Excellent planning and reporting skills  Fluency in written and spoken English and Somali languages  Computer proficiency especially in MS office suite  How to apply  Interested candidates should send their updated CV and cover letter in one PDF to hr.srcs@yahoo.com  Note: applications which do not meet the above requirements will not be considered. Only Shortlisted Candidates will be contacted. Please write the position you are applying on the subject line. If you fail to write the subject line, your application will be disqualified.  Deadline for Applications: 5th May, 2023.  Email: hr.srcs@yahoo.com"
  },
  {
    "title": "WASH Engineer",
    "company": "Mercy-USA for Aid and Development",
    "location": "Mogadishu",
    "description": "NATURE AND SCOPE OF THE POSITION  Mercy-USAs programs in Somalia cover a wide variety of sectors including WASH, Health, Nutrition, Education, Agriculture and Food Security, and Livelihoods through support from various multilateral, bilateral and private donors.  The WASH Engineer will be responsible for technical assessments, design of construction projects, supervision of construction, and assessment of completed projects.  Duties  Conducts technical assessments on the infrastructure (Water and Sanitation) surveys;  Develops design plans, working drawings, technical specifications, bill of quantities as per approved standards by the donor and the relevant Ministries for all construction works outlined on the project designs for the said projects, including emergency sanitation facilities;  Ensures that all WASH components are implemented as per the project papers, including design, developing of bills of quantities for water supplies, emergency latrines, Emergency WASH NFIs... etc., as per identified needs and within provisions of the project budget;  Develops, negotiates and manages contracts with service providers (may include preparation of tender documents for purposes of soliciting bids/tenders from contractors for the said project);  Assists in ensuring the close liaison and consultation with the communities leaders during implementation of the WASH services as per project document requirement;  Assists in undertaking of the capacity building of the various groups involved in projects, including Household Sanitation Committees, Water/WASH Committees, Community Hygiene Promoters, in aspects of Water Sanitation and Hygiene in an emergency humanitarian situation;  Conducts regular site visits to construction sites makes reports on findings and recommendations;  Participates in kick-off meetings with selected construction companies to endure their understanding of technical requirements and BoQs;  Prepares designs and BoQs for WASH infrastructure especially shallow wells, boreholes, tap stands, water kiosks, solar powered water systems and latrines, including infrastructure suitable for persons with disabilities;  Monitors the implementation of WASH related contracts and proper quality of work and services and ensures that the specifications and dimensions are matching the BoQs or drawings;  Designs and carries out operation and maintenance trainings for beneficiaries;  Prepares technical assessments, progress, final and monitoring reports of WASH infrastructure;  Monitors the technical condition of the infrastructure;  Oversees the procedure of regular water testing and signs of the report;  Any other duties as required by the PDQC and Head of Programs;  Frequent travels to the field locations.  Partner Support  Provide technical support to partners in implementation of water schemes restoration/ rehabilitation interventions;  Support in social mobilization around technical issues when applicable.  Administration and reporting  Compile project technical reports highlighting project impact against indicators;  Contribute to field-based reports to Mercy-USA/or external donors.  JOB SPECIFICATION  Academic  Degree in Engineering  Master Degree (M.Sc.)  Experience  At least 2-year experience in same field;  Technical expertise in WASH infrastructure;  Experience in constructing solar powered water infrastructure;  Experience working in complex contexts;  Experience working in humanitarian/development programming.  Technical expertise in Health/Nutrition infrastructure;  Previous work experience in Somalia.  Work related skills  Fluency in English and Somali (written and oral) required;  Knowledge about water and sanitation infrastructure;  Knowledge about solar powered water systems;  MS Office very good;  Writing detailed and coherent technical reports;  Strong organizational skills;  Strong time management skills;  Strong communication skills, including ability to lead and manage remote teams;  Ability to work in harsh conditions;  Able to meet deadlines  Able to identify program technical challenges and plan and communicate alternatives for smooth program implementation.  Ability to carry out water testing.  Personal attributes  Ability to travel to remote and hardship locations for monitoring of project activities;  Ability to work under pressure;  Trustworthy;  Team player;  Responsiveness;  Strong interpersonal skills;  Strong customer relations skills;  Integrity.  How to apply  Mercy-USA for Aid and Development is dedicated to alleviating human suffering and supporting individuals and their communities in their efforts to become more self-sufficient. Incorporated in the State of Michigan in 1988, Mercy-USAs projects focus on improving health, nutrition and access to safe water, as well as promoting economic and educational growth around the world.  Any interested candidate can send a CV and cover letter to the following email address: hr.eaprogram@mercyusa.org  The applications will be reviewed on a rolling basis with the deadline to apply 31st May 2022  What we stand for:  Mercy USA for Aid and Development is committed to creating and maintaining a caring and protective environment, which promotes its core values, and prevents and addresses child abuse and exploitation. We strongly condemn all form of child abuse and exploitation, be it within or outside of our organization, and always respond to any case of proven, alleged or attempted abuse within our sphere of influence according to its nature. Efforts ensure that mechanisms are in place to raise awareness, aid prevention, encourage reporting and ease response.  Mercy USA for Aid and Development does not discriminate based on gender, ethnicity, race, or persons with disabilities"
  },
  {
    "title": "Program Officer  Capacity Building (WASH)-Dollow",
    "company": "Norwegian Church Aid (NCA)",
    "location": "Doolow",
    "description": "ABOUT NCA We provide emergency assistance in disasters, work for long-term development in local communities and address the root causes of poverty, we advocate for just decisions by public authorities, business and religious leaders. Norwegian Church Aid is an ecumenical diaconal organisation for global justice. We work to help the poorest and those in need, regardless of their creed, race, political or religious affiliation.  Job Description  Purpose of Position:  The Capacity Building Officer will be part of the NCA Somalia WASH Team and will be the focal person ensuring capacity strengthening of stakeholders especially community members, partners and government officials aimed at sustainability. He/ She will provide support for training and communication to participating communities and collaborators within the WASH sector specifically CLTS and organizational development to the extent possible. The other core focus will be using innovative approaches to address hygiene promotion... challenges within the sector.  This position is field based.  Roles and Responsibilities of the job holder  Conduct assessment, to determine capacity gaps and plan to fill the gaps, accordingly.  Develop training materials and facilitate trainings on water management, sanitation, and hygiene promotion.  Assist in organization and facilitation of trainings to partner staff, community members and other stakeholders.  Closely liaise with the other WASH staff to draw work plans, progress reports and operational guidelines.  Facilitate and monitor CLTS in communities while working closely the line ministry of Health and CLTS protocols and find solutions to address sanitation gaps through community action plans.  Keeps records and monitoring/follow ups of all the community action plans (CAPs) incliuding behavour change practices in communities  Compiling village specific CLTS triggering reports (highlighting village baseline status, OD Maps, the trigger moment, trigger type registered, record of tools used, attendance by sex, declaration to change photo, action plans towards basic sanitation for all etc.)  Under the technical support of the WASH Engineer and WASH Program Officer, monitor and support and supervise WASH projects implementation while closely working with local administrations, community structures and target beneficiaries.  Identify gaps and finding improvement opportunities for targeted areas and improving the hygiene practices and access to better sanitation hardware services.  Assist the WASH department in conducting Field WASH Assessments for Drought and other interventions and preparation of Field Assessment reports.  Prepare and submit quality and timely monthly, quarterly, annual and end of project reports in line with policies and procedures to the line manager.  Responsible for identifying and helping to resolve problems and conflicts that arise in relation to the project. If unable to resolve a problem or conflict you will promptly share the issue with the Area Coordinator  Help to foster a culture of mutual respect and transparency among field staff and community management groups that the project works with.  Ensure that any complaints or concerns raised by participating communities are brought to the attention of the appropriate team members fully and respectfully addressed.  Perform any other assignments allocated to him/her.  Skills and Qualifications  Job Requirements:  Degree in Public Health, Social Sciences, Environmental Health, Community Development  Experience:  Excellent communication, facilitation and listening skills and be a good coordinator and delegator of responsibilities.  At least 3 years experience in WASH projects implementations at community level including organizational development.  Excellent training, mentoring and coaching skills.  Community mobilization and facilitation skills  Flexible, proactive, results-oriented with the ability to work independently with minimum supervision and as part of a larger team.  Knowledge of computer Applications, MS Office, and Excel.  S/he will be a Somali National.  Technical knowledge of WASH infrastructure development will be an added advantage.  Language:  Excellent spoken and written English and Somali.  The successful candidate will be expected to have a proper understanding, interpretation, and commitment to NCAs vision, mission, values and strategies. NCA upholds the right of equal opportunity and qualified female candidates are encouraged to apply.  Applicants who meet the requirements and qualifications outlined above are encouraged to apply.  How to apply  We Offer  Contract period: 12 Months with the possibility of extension.  Salary: According to NCA salary scale.  Duty Station: Dollow.  Travel: Some  NB: Candidates are encouraged to apply early, as applications may be screened. Email application will not be accepted"
  }
]