[
  {
    "title": "Consultant (WASH International Project Manager ) P3",
    "company": "World Health Organization (WHO)",
    "location": "So Tom",
    "description": "jobs-near-me.org  JOB DESCRIPTION  ..  Qualifications  TERMS OF REFERENCE  This TOR for a WASH International Project Manager (Consultant) is requested by:  Country Office:  Sao Tome and Principe  Department:  Grade  P3  Title of the Position:  WASH International Project Manager (Consultant)  CONTEXTUALIZATION AND JUSTIFICATION  The availability of reliable water, sanitation, and hygiene (WASH) services in health facilities is a key element for fulfilling several health objectives, including quality universal health coverage, prevention, and control of infections and communicable diseases, patient safety, and child and maternal health. According to the WASH-FIT assessment that was carried out by the WHO from September to November 2021 in Sao Tome and Principe, 100% (40) of the health facilities assessed in the country do not have adequate WASH infrastructure. Without this basic element, healthcare facilities cannot guarantee adequate hygiene of daily procedures, equipment, and staff... increasing the risk of infections and communicable diseases spread among patients and staff. Access to WASH in schools helps reduce children drop off and absenteeism, improve schools performance and increase/promote gender balance.  The WHO, UNDP and WFP is jointly implementing a project called Green Infrastructure for Health and Education in Sao Tome and Principe. The joint program will contribute to improved water and energy access in the health and school facilities, further contributing to improved quality in health, school feeding and education sectors in Sao Tome and Principe. By addressing better access to quality and safe health services, through improved clean energy supply (hybrid solar photovoltaic systems with corresponding generators and batteries for lighting and abstraction of water from boreholes or wells), water, sanitation, and hygiene (WASH) in 7 district health care facilities (WASH), the programme will contribute to accelerating universal health coverage, the linchpin for all SDGs health related targets. Additionally, it will provide the country with a more sustainable and environmentally friendly school feeding program in 20 schools, powered by renewable energies and able to deliver daily nutritious hot meals to more than 5 000 school children 180 days per school year (adequate preparation and preservation of food), while also creating new market dynamics for 20 smallholder producers.  The WASH component of the joint project will be implemented by WHO. WHO will work with the Ministry of Health (MoH) and its institutions to guarantee accessibility of quality and safe healthcare services in the 7 district health centers in Sao Tome and Principe. This project will strengthen the foundation for primary healthcare and reduce delay in using services and hence is an essential component to a comprehensive support to improve health outcomes, and for social and economic development of the country.  This will be achieved through:  1. Construction / rehabilitation of WASH infrastructures in 7 healthcare facilities (HCF)  2. Provision of critical and essential WASH supplies  3. Risk communication and community engagement (RCCE)  4. Capacity building of health care workers  5. Coordination and Mechanism for Maintenance and sustainability  MAIN TASKS AND RESPONSIBILITIES  1. Kickstart and put all necessary conditions for the project  2. Provide technical support in developing implementation strategies in ensuring efficiency of service delivery in the program  3. Supervise the development and/or rehabilitation of appropriate WASH infrastructure in the health facilities including the adapted clean energy supply  4. Technical and operational support for programme implementation including development of guidelines and building human resources capacities.  5. Train / provide refresher training for health workers on WASH in health facilities.  6. Work closely with Construction Manager and national consultant in delivery of WASH supplies  7. Document and disseminate best practices on Water resources management in WASH coordination and other meetings in field level as may be required  8. Coordinate interventions with focal points from government ministries and departments involved and with other stakeholders (UNDP, WFP)  9. Carry out any other related responsibilities as would be assigned by the Project Coordinator  TECHNICAL SUPERVISION  The WASH international project manager (consultant) will work under the supervision of:  Manager:  Claudina Augusto da Cruz  Email:  cruzc@who.int  SPECIFIC REQUIREMENTS  Qualifications required:   Masters Degree in civil engineering, management of water and sanitation services and infrastructures / environmental science or related field from an accredited/recognized institution or equivalent  Desirable   Advanced degree in public health  Experience required:  Essential   At skills wleast 5 years experience in assessing, designing, planning, implementing, monitoring and evaluation of WASH Projects / Programs (WASH in Health Care Facilities, WASH in Schools, WASH in Urban or Rural Communities).   Good project management skills with ability to monitor and communicate progress in terms of process and results  Desirable   Knowledge on various applications of renewable energy   Experience in the health sector including health facility assessment    Prior working experience with UN   Preferably have successfully completed other similar field assignments at international level in LMIC.  Skills   Proven knowledge and skills in infection prevention and control, rapid assessment techniques.   Strong organizational and communication skills including ability to negotiate with National authorities   Demonstrated knowledge of water, sanitation, hygiene and health care waste management in emergency response   Excellent analytical and organizational skills, with proven ability to elaborate and implement projects  WHO Competencies   Teamwork   Respecting and promoting individual and cultural differences   Communication   Ensuring effective use of resources   Building and promoting partnerships across the organization and beyond   Creating an empowering and motivating environment  Language requirements:  Excellent knowledge of Portuguese  Working knowledge of English and French will be an asset  PLACE OF ASSIGNMENT  WHO country office in Sao Tome and Princip  DURATION OF ASSISTANCE:  6 months  Apply for job  To help us track our recruitment effort, please indicate in your cover/motivation letter where (jobs-near-me.org) you saw this internship posting"
  }
]