[
  {
    "title": "Jobs at ministry of Water and Environment",
    "company": "Ministry of Water and Environment",
    "location": "Kampala",
    "description": "The Government of Uganda (GoU) represented by the Ministry of Water and Environment has received financing from the Islamic Development Bank (IsDB) to implement the Farm Income Enhancement and Forestry Conservation (FIEFOC) Programme (Project 3): Irrigation Schemes Development Project in Unyama, Namalu, and Sipi regions. The project specific objective is to improve household incomes, food security, and climate resilience through sustainable natural resources management and agricultural enterprise development. The project consists of four components namely: (i) Agriculture Infrastructure Development; (ii) Agribusiness Development; (iii) Integrated Natural Resources Management; and (iv) Project Management. The Ministry of Water and Environment therefore wishes to recruit qualified personnel to provide technical support to the project as specified below.  1.Agri-business Development Officer (ADO)  2.Assistant Procurement Officer (APO)  3.Assistant Accountant  See details here"
  },
  {
    "title": "Project Assistant-WASH",
    "company": "Hot Uganda Jobs",
    "location": "Kampala",
    "description": "Description  LWF World Service is the humanitarian and development arm of the Lutheran World Federation. We are a widely recognized, international, faith-based organization working in over 20 countries.  We seek to bring people of all backgrounds together in the common quest for justice, peace, and reconciliation in an increasingly complex and fragmented world.  A commitment to the human rights of every individual, regardless of their status, guides our work, actions, and operations.  We are particularly known for our timely, compassionate, and professional humanitarian work, and for our field presence in hard-to-reach areas.  Our work is people-centered and community- based. Above all, we work with the most vulnerable, and in order to claim and uphold their rights, we engage proactively with local government and community structures.  LWF Uganda works closely with United Nations agencies (UNHCR, UNFPA, UNICEF, WFP), Charity water, PRM, EU / ECHO, BFTW, etc.  LWF Related and... faith-based agencies and their back donors.  For additional information, please see  The LWF Uganda Program is looking for a qualified and experienced person to fill the following position : Job Title : Project Assistant WASH position.  Place of Assignment : Kitgum / Pader  Reports to : Project Officer-WASH  Starting date : ASAP  Duration of Contract : 8-month contract (with possibility of extension)  The closing date for applications : 19 July  Job Summary : Under the guidance of the Project Officer, the Project Assistant is responsible for monitoring of WASH infrastructure, household sanitation, and hygiene status, promoting safe hygiene practices, and periodically preparing and submitting activity reports / success stories to the Project Officer.  Roles and Responsibilities :  Mobilize and sensitize communities and institutions on best Water, Sanitation, and Hygiene practices .  Supervise works for all water supply schemes / civil works to ensure quality work, and provide technical support services to management, fellow staff, and the community in line with set standards and guidelines.  Conduct water quality monitoring / surveillance.  Effective supervision of community-based facilitators and community resource persons on the ground such as VHTs and handpump mechanics  Support water user committees in developing operation and maintenance strategies for WASH facilities"
  },
  {
    "title": "Water Treatment Plant Operator",
    "company": "Mukwano Group of Companies (Uganda)",
    "location": "Kampala",
    "description": "ABOUT THE COMPANY  Mukwano Group of Companies is one of the leading conglomerates in Eastern and Central Africa. Our companies are major players in key business sectors that drive the Ugandan economy. The company's origins go back to 1910 when members of the family first set foot in East Africa and established a trading company. Our business has grown through visionary diversification into manufacturing, agriculture  JOB SUMMARY  Requirements Diploma in industrial chemistry or any other related discipline. 1-year relevant experience in a manufacturing plant  RESPONSIBILITIES   Operate, run and monitor the water pumps from off-loading area, storage and filtration. Ensure that all water pumps are functional and in good working condition. Cleaning and sanitization of the water line from transit trucks to the reservoir tanks and from the buffer tanks to the rinse machine. Co-ordinate with the Quality Control Officer in sampling of raw  water from the transit trucks before... off-loading into the reservoir tanks. Ensure adequate raw water is pumped into the reservoir tanks and buffer tanks and that there is no overflow of water or wastage of any kind. Ensure proper record keeping and filtration of water meter readings and quality assurance report. Carry out backwashing in the presence of the quality control officer and assist in changing of the filters. Informs the officer when it is the due date for changing of the filters and the U.V lamps. Oversee overall cleaning and sanitization of the water treatment plant. Ensure that quality bottled water is produced after end of treatment as per the water treatment sop. Adhere to health and safety practices. Detect and report any faults to the Plant Maintenance Electrician/Mechanic. Implement the food safety management system, ISO/HACCP/PRP/OPRP. Monitor and control defined critical control points in the respective sections. Report about the status of critical control points respectively. Ensure the parameters required for bottled drinking water are followed as per the available standards. Any other duties assigned by the supervisor.  REQUIRED SKILLS  Quality management, Ability to coordinate, Machine operation, Safety systems  REQUIRED EDUCATION  Diploma, Associate's degree"
  },
  {
    "title": "3 Fresher Sanitation Officer NGO Jobs",
    "company": "International Lifeline Fund (Lifeline)",
    "location": "Kampala",
    "description": "Job Title :  Organisation : International  Lifeline Fund (Lifeline)  Duty Station : Uganda  Uganda  About US : International  International  Lifeline Fund (Lifeline) is a registered is nongovernmental organization in  Uganda, with project offices in Lira, Apac and Moroto. Lifeline has been doing  humanitarian and Development work in Uganda since 2006 through its Environment  and Water, Sanitation & Hygiene Programs.  Job Summary : The Sanitation Officer will be responsible for  assessing, implementing and monitoring hygiene and sanitation in accordance  with Lifeline WASH Program procedures and standards. In addition, he / she will  carry out behavioural change practices and hygiene promotion campaigns and  promote Lifelines mission and core values.  Qualifications, Skills and Experience :  Bachelors  degree in Public health (monitoring in health promotion). Environmental  science, social works and social Administration, Development studies is  preferred, or equivalent work... experience.  At least  five years of demonstrated Water, sanitation, and hygiene (WASH) knowledge /  experience is not essential, but a plus.  Prociency  with MS Office software  Excellent  communication skills.  Language :  English, knowledge of Luo is an advantage.  Ethical,  responsible, proactive, and hard working. You enjoy working directly with  community members and encouraging their participation"
  },
  {
    "title": "Accountant Receivable",
    "company": "SPOUTS of Water",
    "location": "Kampala",
    "description": "JOB DESCRIPTION  Who we are  SPOUTS of Water LTD is a for-profit social business that manufactures and sells the Purifaaya ceramic water filters and distributes rocket stove technology. SPOUTS was created in Uganda in 2014 with the simple idea that ceramic water filters could be made and sold locally, providing an amazingly effective product through a sustainable business model. SPOUTS is currently the largest ceramic water filter manufacturer in Africa.  Since SPOUTS sold its first Purifaaya in 2015, it has distributed 130,000+ filters to East Africa providing over 650,000 end-users with long-term access to safe drinking water. SPOUTS is a rapidly-growing organization with over 500 employees across Uganda and Rwanda. The next step is to expand its operations throughout East, West and Southern Africa  JOB INFORMATION  Job Title  Accountant Receivable  Reports to (Job Title)  Finance & Accounting Manager  Department  Finance Department  Location  Head Office  Country  Uganda  PURPOSE... OF THE JOB  To provide support in posting all customer payments for SPOUTS of Water.  MAIN RESPONSIBILITIES  RESPONSIBILITIES UNIQUE TO THE ROLE  Responsibility  % Contribution to jobs performance  To coordinate and post customer payments in the system, to ensure customers are cleared of their dues.  30%  To prepare reconciliation of customers balances to ascertain the accurate number of accounts receivables and inform the management about the outstanding dues  30%  To reconcile all receivable mobile money accounts  10%  To coordinate payment for commercial commissions, to confirm how much money should be paid to the sales team  10%  Coordinate all invoices under strategic programs to ensure timely payments of the invoices  10%  Any other roles added from time to time in relation to departmental objectives  10%  JOB DIMENSIONS  Geographical scope  Uganda  REQUIREMENTS  Qualifications  Bachelors Degree in Science in Finance and Accounting, Business Administration majoring in Accounting, or any other related field  CPA level 1 is added advantage  Experience  2 Years experience in in a similar role in a social enterprise setting.  Past experience in ERP and computer skills is required.  Business Understanding / Knowledge  Experience Manufacturing is an added advantage.  Languages  Proficiency in spoken and written English  COMMUNICATION REQUIREMENTS  (MOST RELEVANT FOR THE JOB)  Internal Stakeholders  HR, Operations, Production, Sales, Customer service, IT, Marketing.  External Stakeholders  Customers.  SPECIAL CONDITIONS  Regular travel between Head office, factory and field.  ANY OTHER COMMENTS  The position requires the job holder to be proactive and self-driven to fulfil the company mission of providing solutions to immediate problems.  Deadline 15th November, 2023.  Female candidates are strongly encouraged to apply.  We will review applications on a rolling basis, so please apply as soon as possible. Due to the volume of applications, we may not be able to respond to every individual application we receive. If you do not receive an invitation for an interview from us within 3 weeks of applying, please consider your application unsuccessful"
  },
  {
    "title": "Maintenance Mechanic  Plumbing (Chancery)",
    "company": "Hot Uganda Jobs",
    "location": "Kampala",
    "description": "Description  Marketing Statement : We encourage you to read and understand the Eight Qualities of Overseas Employees before you apply.  Summary : The U.S. Mission in Uganda is seeking eligible and qualified applicants for the position of Plumber.  The work schedule for this position is :  Full Time, 40 hours per week  Start date : Candidate must be able to begin working within a reasonable period of time following receipt of agency authorization and / or clearances / certifications or their candidacy may end.  Supervisory Position : No  Duties : Will complete assigned tasks within the allotted time established in the Collaborative Management Initiative (CMI) service standards, and according to International Building Code (IBC) standards.  The incumbent specializes in plumbing and mechanical systems operation and maintenance. Systems include but are not limited to;  water supply and storage, filtration, disinfection and other water treatments, hot water systems and equipment, piping... tubing, fittings and controls, irrigation, domestic plumbing fixtures including waterless urinals, drainage, sanitary systems, on-site sewage treatment, and storm water management.  Qualifications and Evaluations  EDUCATION : Completion of secondary school is required. Completion of vocational training program from an accredited institute recognized as producing journeyman level plumbers and mechanical system specialist trained in the maintenance of commercial or industrial buildings / facilities is required.  Training through a recognized apprenticeship program provided by a trade union is considered acceptable.  Requirements :  EXPERIENCE : A minimum of three years experience working as a journey-level plumber in the repair and maintenance of plumbing / mechanical systems in commercial or industrial facilities is required.  Must have experience working with PVC, CPVC, copper, galvanized, concrete, and black pipe, circulation and well pumps, and water treatment equipment.  JOB KNOWLEDGE : The incumbent is required to have a thorough, technical understanding of major building plumbing / mechanical systems and equipment, with a specialty in plumbing systems.  Familiarization with general mechanical systems, including domestic hot and cold-water piping systems, wastewater piping systems and vent stacks, storm water management systems, chilled water systems, water treatment facilities, swimming pool equipment, fire suppression systems, compressed air systems, and irrigation systems is required.  Familiarization with the many different types of pipe and fittings (PVC and CPVC, copper, galvanized, concrete, black, etc.  is required. Must know how to diagnose the root cause of a problem and what materials and equipment will be needed to facilitate repairs.  Must know how to work safely on equipment, systems and associated components including the use of lock-out / tag-out safety measure.  Knowledge of IBC standards, and fire and life safety codes is required.  Evaluations : (This may be tested)  LANGUAGE : English level II (Limited Knowledge) Written / Speaking / Reading in English is required.  Luganda level III (Good knowledge) Written / Speaking / Reading is required. In order to communicate with local contractors and other LE Staff.  SKILLS AND ABILITIES : The incumbent must be skilled at reading and interpreting technical documents including layout drawings, as-built drawings, riser diagrams, equipment schedules, operations and maintenance manuals, and other manufacturers literature.  The incumbent shall have the skills and abilities in the following areas : diagnosing and repairing filtration systems, water pumps, hot and cold-water systems;  testing potable water system components, monitoring of chemical and salt injection systems, and taking equipment readings with various meters;  use of hand tools, power tools, and specialty tools to determine appropriate repairs. Additional skills include installation and repair to the various types of plumbing pipe such as PVC and CPVC, copper, galvanized, concrete, and black pipe;  distinguishing frequencies and sounds, color codes and odors in the operation of equipment in order to troubleshoot for repairs.  Additional abilities include responding to emergency situations in an efficient and timely manner to effect immediate repairs;  work in various adverse conditions such as tight or enclosed spaces, on ladders at various heights, and in temperature extremes, indoors or outdoors to complete work assignments;  communicate orally and in writing with co-workers, contractors and vendors to obtain and provide pertinent information. Must be computer literate, able to navigate through the Microsoft Office Suite software including MS Word, Excel, Outlook, and Power Point;  able to draft reports and create spreadsheets, and able to write e-mails and research information on the Internet. A valid Class B drivers license is required.  Must have excellent interpersonal skills and be able to handle a large workload and multiple tasks. Must be organized.  Qualifications : All applicants under consideration will be required to pass medical and security certifications.  EQUAL EMPLOYMENT OPPORTUNITY (EEO) : The U.S. Mission provides equal opportunity and fair and equitable treatment in employment to all people without regard to race, color, religion, sex, national origin, age, disability, political affiliation, marital status, or sexual orientation.  Other information :  HIRING PREFERENCE SELECTION PROCESS : Applicants in the following hiring preference categories are extended a hiring preference in the order listed below.  Therefore, it is essential that these applicants accurately describe their status on the application. Failure to do so may result in a determination that the applicant is not eligible for a hiring preference.  HIRING PREFERENCE ORDER"
  },
  {
    "title": "Logistics Assistant",
    "company": "DAI Global",
    "location": "Kampala",
    "description": "Closing date30 Nov 2023 Project Background:  The USAID Uganda Feed the Future Water and Food Systems for Resilient Communities Activity (FTF WFSRCA) is a five year activity (2023-2028) that aims to inclusively and equitably improve food and water security in the Kyoga Basin in northeastern Uganda, specifically three watersheds  Lokok, Awoja, and Lokere, by empowering individuals and communities to mitigate and adapt to shocks and stressors in order to improve livelihoods, maintain nutrition and health wellbeing, address drivers of conflict, and reduce reliance on humanitarian assistance. This area is home to nomadic pastoralists whose livelihoods are at risk due to violent cattle raiding and the effects of climate change (drought and flooding). This part of Uganda also suffers from fragmented markets, chronic underinvestment in public services, and a lack of private sector investment. This Activity is aligned with the Water and Development II (WADI II) scope to access critical... technical services in support of the U.S. Governments Global Water Strategy, Global Food Security and Strategy Refresh, Agency Climate Strategy, and the Presidents Emergency Plan for Adaptation and Resilience; and is a cornerstone of the USAID Uganda (2022) Country Development Cooperation Strategy Development Objective (DO) 2, Resilient Growth Enhanced. The activity aims therefore aims to achieve results under the following development objectives:  Improve water supply and integrated water resource management. Increase equitable access to sanitation and hygiene services for households and schools. Improved agriculture-based livelihoods. Increased consumption of nutritious foods among women and children. Expanded access to financial resources for women, men, youth, indigenous people, and marginalized groups. Improve local capacity to manage shocks and stressors"
  },
  {
    "title": "Procurement Assistant",
    "company": "USAID",
    "location": "Kampala",
    "description": "Closing date30 Nov 2023 Project Background:  The USAID Uganda Feed the Future Water and Food Systems for Resilient Communities Activity (FTF WFSRCA) is a five year activity (2023-2028) that aims to inclusively and equitably improve food and water security in the Kyoga Basin in northeastern Uganda, specifically three watersheds  Lokok, Awoja, and Lokere, by empowering individuals and communities to mitigate and adapt to shocks and stressors in order to improve livelihoods, maintain nutrition and health wellbeing, address drivers of conflict, and reduce reliance on humanitarian assistance. This area is home to nomadic pastoralists whose livelihoods are at risk due to violent cattle raiding and the effects of climate change (drought and flooding). This part of Uganda also suffers from fragmented markets, chronic underinvestment in public services, and a lack of private sector investment. This Activity is aligned with the Water and Development II (WADI II) scope to access critical... technical services in support of the U.S. Governments Global Water Strategy, Global Food Security and Strategy Refresh, Agency Climate Strategy, and the Presidents Emergency Plan for Adaptation and Resilience; and is a cornerstone of the USAID Uganda (2022) Country Development Cooperation Strategy Development Objective (DO) 2, Resilient Growth Enhanced. The activity aims therefore aims to achieve results under the following development objectives:  Improve water supply and integrated water resource management. Increase equitable access to sanitation and hygiene services for households and schools. Improved agriculture-based livelihoods. Increased consumption of nutritious foods among women and children. Expanded access to financial resources for women, men, youth, indigenous people, and marginalized groups. Improve local capacity to manage shocks and stressors. FtF WFSRCA will enhance market systems, strengthen relevant institutions, expand access to climate-resilient services, andin two of the most vulnerable of the 20 districts covered by the activityemploy graduation approaches to assist the ultra-poor. These initiatives will incorporate conflict sensitivity, local leadership, climate change adaptation, and approaches inclusive of women, youth, the elderly, persons with disabilities, and indigenous groups.  Roles Purpose:  The Procurement Assistant will provide support to the Procurement Manager and ensure all paperwork is accounted for and stored in the proper places. He/she will document procurements from start to finish, ensuring that the process was competitive, free, and open. He/she will collaborate with technical teams to ensure the projects needs are taken into account throughout the procurement process.  Key Duties and Responsibilities:  Provide assistance to procurement team in database entry, procurement tracking, and reporting. Maintain integrity of procurement system and files in compliance with DAI practices and policies and USAID rules and regulations. Maintain procurement activity tracker and provide regular updates on status to the Procurement Manager and relevant technical staff. Review procurement documents in TAMIS as well as hard copy files to ensure all back up documents are included in compliance with the project Field Operations Manual, and revise/correct as required. Report accurate financial data to Finance Manager on planned procurement activities. Assist with the preparation of source selection memos which provide clear justification for selection of vendor/local subcontractor. Assist in developing procurement plans in accordance with the work plan. Qualifications  Bachelors degree plus 2 years of relevant experience in procurement, logistics, or related area Prior experience in USAID project procurement and/or DAI procurement systems a plus. Professional proficiency in English is required, and proficiency in local languages is preferred"
  },
  {
    "title": "Grants Assistant",
    "company": "Non-Governmental Organisation (NGO)",
    "location": "Moroto",
    "description": "The USAID Uganda Feed the Future Water and Food Systems for Resilient Communities Activity (FTF WFSRCA) is a five year activity (2023-2028) that aims to inclusively and equitably improve food and water security in the Kyoga Basin in northeastern Uganda, specifically three watersheds  Lokok, Awoja, and Lokere, by empowering individuals and communities to mitigate and adapt to shocks and stressors in order to improve livelihoods, maintain nutrition and health wellbeing, address drivers of conflict, and reduce reliance on humanitarian assistance. This area is home to nomadic pastoralists whose livelihoods are at risk due to violent cattle raiding and the effects of climate change (drought and flooding). This part of Uganda also suffers from fragmented markets, chronic underinvestment in public services, and a lack of private sector investment. This Activity is aligned with the Water and Development II (WADI II) scope to access critical technical services in support of the U.S... Governments Global Water Strategy, Global Food Security and Strategy Refresh, Agency Climate Strategy, and the Presidents Emergency Plan for Adaptation and Resilience; and is a cornerstone of the USAID Uganda (2022) Country Development Cooperation Strategy Development Objective (DO) 2, Resilient Growth Enhanced. The activity aims therefore aims to achieve results under the following development objectives:  Improve water supply and integrated water resource management. Increase equitable access to sanitation and hygiene services for households and schools. Improved agriculture-based livelihoods. Increased consumption of nutritious foods among women and children. Expanded access to financial resources for women, men, youth, indigenous people, and marginalized groups. Improve local capacity to manage shocks and stressors.  FtF WFSRCA will enhance market systems, strengthen relevant institutions, expand access to climate-resilient services, andin two of the most vulnerable of the 20 districts covered by the activityemploy graduation approaches to assist the ultra-poor. These initiatives will incorporate conflict sensitivity, local leadership, climate change adaptation, and approaches inclusive of women, youth, the elderly, persons with disabilities, and indigenous groups. Roles Purpose: The Grants Assistant will support the projects grants portfolio. The Grants Assistant will support help the design and management of the grants funds. S/he will be responsible for adherence to the projects Field Operations Manual (FOM), USAID regulations, contract requirements and limitations, grant policies, procedures, controls, and reporting systems. The individual will proactively coordinate with all staff on planning and implementing grants through open communication, proactive market research, and price analysis. Key Duties and Responsibilities:  Supports the evaluation and selection committee process for grantees and participate without vote in the Grants selection committee. Drafts the required approvals to ensure compliance with internal and external contract and policy requirements. Conducts all due diligence processes for verification of the information submitted by possible grantees. Supports the preparation of grant agreements and amendments, explaining terms, conditions, roles, and responsibilities. Ensures that identified weaknesses in initial grantee assessments and related requirements are incorporated into the agreements explicitly/clearly with the required monitoring and actions on the part of the grantee. Supports post award grant management in accordance with relevant regulations and generates reports of status of grant activities, such as forecasting payment, inventory, amendments, close outs, and sector specific data (i.e. monthly and quarterly reporting). Supports the Grants Manager in implementing the grants monitoring system that, at minimum, tracks the following: 1) number of funded activities and dollar amounts; 2) type of organization; 3) activity type; 4) cost-sharing; and 5) development impact among others. Reviews grants for completeness and appropriateness with the work plan. Ensures all required documentation is uploaded in the grants database TAMIS and SharePoint. Reviews grant milestones and requests for payments against grant agreements to ensure compliance. Works with the procurement department to compete and purchase goods and services for in-kind grantees. Ensures the files are audit ready. Troubleshoots grant related issues with the other grant staff. Other tasks as assigned by Grants Manager and/or COP.  Qualifications  Bachelors degree plus 2 years of relevant experience in relevant field. Prior experience in USAID project grants is a plus. Professional proficiency in English is required, and proficiency in local languages is preferred.  Skills  Highly organized. Strong problem-solving skills. Excellent communication written and oral communication skills.  Reporting The Grants Assistant will report to the Grants Manager"
  },
  {
    "title": "Project Assistant-WASH, Pader",
    "company": "Hot Uganda Jobs",
    "location": "Kampala",
    "description": "Description  LWF World Service is the humanitarian and development arm of the Lutheran World Federation. We are a widely recognized, international, faith-based organization working in over 20 countries.  We seek to bring people of all backgrounds together in the common quest for justice, peace, and reconciliation in an increasingly complex and fragmented world.  A commitment to the human rights of every individual, regardless of their status, guides our work, actions, and operations.  We are particularly known for our timely, compassionate, and professional humanitarian work, and for our field presence in hard-to-reach areas.  Our work is people-centered and community- based. Above all, we work with the most vulnerable, and in order to claim and uphold their rights, we engage proactively with local government and community structures.  LWF Uganda works closely with United Nations agencies (UNHCR, UNFPA, UNICEF, WFP), Charity water, PRM, EU / ECHO, BFTW, etc.  LWF Related and... faith-based agencies and their back donors.  For additional information, please see  The LWF Uganda Program is looking for a qualified and experienced person to fill the following position : Job Title : Project Assistant WASH position.  Place of Assignment : Kitgum / Pader  Reports to : Project Officer-WASH  Starting date : ASAP  Duration of Contract : 8-month contract (with possibility of extension)  The closing date for applications : 19 July  Job Summary : Under the guidance of the Project Officer, the Project Assistant is responsible for monitoring of WASH infrastructure, household sanitation, and hygiene status, promoting safe hygiene practices, and periodically preparing and submitting activity reports / success stories to the Project Officer.  Roles and Responsibilities :  Mobilize and sensitize communities and institutions on best Water, Sanitation, and Hygiene practices .  Supervise works for all water supply schemes / civil works to ensure quality work, and provide technical support services to management, fellow staff, and the community in line with set standards and guidelines.  Conduct water quality monitoring / surveillance.  Effective supervision of community-based facilitators and community resource persons on the ground such as VHTs and handpump mechanics  Support water user committees in developing operation and maintenance strategies for WASH facilities.  Conduct hygiene advocacy campaigns in the community and institutions.  Participate in communicable and non-communicable diseases surveillance where applicable  Assist POs to manage and distribute WASH materials related to assigned project activities.  Organise and conduct dialogue and sensitization meetings on WASH-related issues.  Assist the PO in developing proposals / project work plans and budget estimations  Together with the Project officer, the project assistant develops weekly and monthly activity work plans  Prepare activity work plan with the community-based facilitators / community resource persons  Build the capacity of community-based facilitators and resource persons for the effective implementation of project activities  Participate in the implementation of a robust M&E System to monitor project performance and ensure an appropriate level of accountability;  Conduct periodic assessments / surveys on WASH activities.  Participate in developing M&E Tools and ensure effective deployment and use of those tools.  In liaison with the project officer, participate in budget revisions for the project / program according to the standards of the donor;  In liaison with the project officer, keep track of all project / program budgets and ensure that project / program activities are within assigned budgets;  In liaison with the project officer, review management accounts to track expenditures and provide feedback to the SPA;  Document and submit financial-related issues / concerns arising in the implementation of project activities  Participate in WASH sector coordination with other stakeholders during project implementation.  Work closely with the existing structures of LWF partner organizations in implementing the project activities  Periodically prepare / document and submit accurate activity reports / success stories to the project officer in a timely manner.  Education, Qualifications & Experience Required : Diploma in Water Engineering or University degree in Water Engineering, Environmental science, and public health;  Post Graduate training in Project Planning and Management and sound knowledge of financial management is an added advantage;  At least 2-3 years experience in implementing WASH interventions and Community Development programming  Proven knowledge and experience in developing and implementing community resource mobilization projects.  Knowledge, skills, and experience in participatory methods for hygiene promotion e.g., PHAST, CHAST, CLTS.  Experience in working in rural areas, including WASH infrastructure and construction  Special Skills, Aptitude or Personality Requirements : Demonstrates developed communications skills  Problem-solving and decision-making skills;  Ability to inspire and build the capacity of community resources persons;  Good interpersonal skills and excellent negotiation skills;  Excellent English Language (both written and spoken"
  }
]