[
  {
    "title": "Water Systems Infrastrucure and Performance Manager - USAID’S...",
    "company_name": "Mercy Corps",
    "location": "  Goma, République démocratique du Congo   ",
    "via": "via UNjobnet",
    "description": "Mercy Corps is powered by the belief that a better world is possible. To do this, we know our teams do their best work when they are diverse and every team member feels that they belong. We welcome diverse backgrounds, perspectives, and skills so that we can be stronger and have long term impact.\n\nThe Program/Department Summary\n\nMercy Corps has been operating in the Democratic Republic of the Congo (DRC) since August 2007, with a staff of around 400 people working in Eastern DRC, with the overall country goal being to support vulnerable communities through crises, while fostering programs that build resilience and promote long-term change. Mercy Corps’ national office is in Goma with sub-field offices in North Kivu, South Kivu and Ituri. Mercy Corps DRC’s key programming areas include a combination of longer-term development and immediate humanitarian response programs in order to 1) Improve water service delivery and ensuring equitable access to Water, Sanitation and Hygiene... services, in urban and rural areas; 2) Improve food security and nutrition; 3) Promote diversified livelihoods, economic recovery and development; 4) Support peacebuilding and local governance. Mercy Corps DRC’s humanitarian programs aim specifically to assist populations affected by the conflict and crisis in Eastern Congo.\n\nIn October 2020, Mercy Corps started the five-year USAID’s Sustainable Water and Sanitation Systems Activity, with a budget of $32 million to be implemented in 4 locations across North and South Kivu. Building on the successes of Mercy Corps’ IMAGINE program, and those of other WASH actors in Eastern DRC, USAID’s Sustainable Water and Sanitation Systems Activity (SWASSA) has brought together a consortium of 3 international partners (Mercy Corps, TetraTech and Sanergy) to focus on water and sanitation. In partnership with USAID and in line with Development Objective 2 of USAID’s DRC Country Development Cooperation Strategy (CDCS), SWASSA aims to show that it is possible to achieve genuinely sustainable increases in access to clean water by implementing contextually relevant, performance-based contractual models for water service delivery in collaboration with state and local entities including Territorial (ETDs) and Provincial Administrations. The consortium of international partners works interconnectedly, leveraging their expertise in different areas to ensure the success of the\n\nActivity managed by Mercy Corps, Tetra Tech will focus on the infrastructure and market system delivery plan; and Sanergy provides the technical expertise in sanitation.\n\nThe Position\n\nThe role of the Water Systems Infrastructure and Performance (WSIP) Manager is to provide key delivery support to enable the SWASSA Activity to deliver sustainable water services. Mercy Corps is seeking a talented (international) professional with extensive experience in the governance of the development of water supply infrastructure and service delivery. The WSIP-Manager will lead activities to assess water system infrastructure and operational reliability of utilities and water service providers. The WSIP-Manager will mainly engage in a wide variety of technical and management activities aimed at expanding and improving the water service delivery, including the development of drinking water service delivery systems, the development of new contractual models with the Regies Provincials, Decentralized Territorial Entities (DTEs) and Water Users Associations (ASUREPs), and capacity building and training for private water service providers.\n\nWe are looking for (international) candidates with experience in the management of peri-urban water supply systems and a good understanding of performance management. Applicants should have knowledge of Public-Private Partnership contractual models for water services and water sector governance and be able to articulate trade-offs between design options and operational costs at short and long term of different service delivery models.\n\nThe Manager will be responsible for setting strategy, ensuring quality implementation and overseeing all activities. They will be responsible for ensuring compliance with USAID's regulations, working closely with relevant partners (Sanergy and Tetratech) and supervising a team of approximately 20 people. In addition, they will work closely with the Chief of Party to identify potential delays and resolve key risks, ensuring that the program is delivered on time. The Manager is expected to manage his/her team in an empowering and collaborative manner, with a focus on capacity building. He/she will be responsible for risk mitigation, crisis management, health and safety, with an emphasis on adherence to gender and safeguard best practices.\n\nResponsibilities\n• Support multi-criteria analysis for site selection in coordination with SWASSA consortium members and program stakeholders, support field information and data collection.\n• Oversee water network assessments which should cover the following components: technical management, operation and maintenance, financial management, organizational structures, customer service and energy efficiency.\n• Perform various types of analysis including actual infrastructure condition and cost, cost recovery and financial models, and basic performance indicators such as unremunerated water and other key performance indicators (KPIs).\n• Provide advice for planned infrastructure investments, including analysis of trade-offs between design options and short- and long-term operating costs and commercial viability.\n• Work on infrastructure planning and supervision, including design and build tenders, procurement support, and QA/QC.\n• Implement tasks related to improving the financial performance, business practices and customer service of water service providers.\n• Serve as the key point of contact between SWASSA and target water service providers related to business- and operational performance.\n• Liaise with international/local short-term technical assistance providing advice on specific improvement activity areas.\n\nQualifications:\n• Possess a bachelor's degree (Bac+3) in business administration, economics, public policy, urban planning, engineering, or any other relevant field; Masters level is preferred.\n• Must have at least 10 years of relevant working experience in the water and sanitation sector and a thorough understanding with water utilities/operating service providers.\n• Knowledge of the governance of water supply infrastructure development and finance (public and private). Specific knowledge of structuring and implementing Public-Private Partnerships is an advantage.\n• Demonstrated experience in technical interventions such as contracting for water services, unremunerated water, metering, and local actor ownership of water and sanitation services.\n• Experience in one or more of the following: development and management of small and medium enterprises; development and implementation of business plans; design and implementation of capacity building programs; technical management and financial management; and improving business efficiency.\n• Good communication and analytical skills with the ability to write well-structured technical reports and perform critical business plan reviews.\n• Must have computer proficiency in Microsoft Office applications such as Word, Excel, MS-Project, etc.\n• Experience working with donor funded projects and with different partners.\n• Fluency in French and English is required; fluency in Swahili is appreciated.\n• Work experience in East Africa and DRC ideally.\n\nSupervisory Responsibility: North Kivu Infrastructure Lead, South Kivu Infrastructure Lead, Sanitation Manager, GIS & CAD Engineer. Dotted line supervision to Tetratech Project Engineer.\n\nAccountability\n\nReports Directly To: Chief of Party\n\nWorks Directly With: DCOP – Governance, Director of Program Controls, MSD manager, Director of MERL, GESI manager, Consortium partners (Sanergy, Tetratech)\n\nAccountability to Participants and Stakeholders\n\nMercy Corps team members are expected to support all efforts toward accountability, specifically to our program participants, community partners, other stakeholders, and to international standards guiding international relief and development work. We are committed to actively engaging communities as equal partners in the design, monitoring and evaluation of our field projects.\n\nSuccess Factors\n\nThe successful Water Systems Infrastructure and Performance Manager will combine a strong collaborative working style with relevant technical expertise and a deep understanding of the challenges of implementing infrastructure projects in this kind of context. S/he should be an adept project manager, with the ability to implement quickly and accurately, troubleshooting and problem solving before issues arise, meet deadlines and process information to support the evolution of the program.\n\nS/he will demonstrate adaptability, flexibility in approach, and a strong sense of equity. The successful candidate will be expected to develop and strengthen the capacity of his/her team to grow with the program, ensuring a team who are not only technically brilliant but who have an understanding of the USAID regulations and Mercy Corps minimum standards. S/he will have strong coaching and mentoring skills and be able to apply them in difficult situations with a cross-cultural team.\n\nDue to the nature of this program, and the operating environment, the successful candidate must have a high level of internal resilience. In this program, patience, diplomacy, tenacity, compassion, determination and a sense of humor are all important factors for success.\n\nLiving Conditions / Environmental Conditions\n\nThis position is a non-accompanied position in Goma (DRC). Individual accommodation will be provided according to Mercy Corps DRC housing policy. Goma is a provincial capital of over 900,000 inhabitants. Living in Goma is mostly comfortable, although water and electricity can be unstable. Outside Goma, travel can be dangerous and unpredictable due to armed forces and rebel activity.\n\nMercy Corps' sub-offices experience variable levels of insecurity, with the situation closely monitored by UN peacekeepers. Air travel is necessary to get from one end of the country to the other. Mobile phones and cellular service are widely available. Internet is available in all Mercy Corps offices. Travel to field sites will be required where living conditions are clean and secure, but basic. There are a number of health services available with evacuation options for serious illnesses. There’s reasonable access to most consumer goods, although they can be expensive.\n\nMercy Corps Team members represent the agency both during and outside of work hours when deployed in a field posting or on a visit/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC's policies, procedures, and values at all times and in all in-country venues.\n\nFostering a diverse and open workplace is an important part of Mercy Corps’ vision. Mercy Corps is an Equal Opportunity Employer regardless of background. We are committed to creating an inclusive environment.\n\nOngoing Learning\n\nIn support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and/or professional growth and development.\n\nDiversity, Equity & Inclusion\n\nAchieving our mission begins with how we build our team and work together. Through our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world’s most complex challenges. We strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.\n\nWe recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.\n\nEqual Employment Opportunity\n\nMercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis. We actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.\n\nWe are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all. We do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.\n\nSafeguarding & Ethics\n\nMercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity. We are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASC and have signed on to the Interagency Misconduct Disclosure Scheme. We will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members. As part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to Mercy Corps Code of Conduct Policies and values at all times. Team members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis",
    "job_highlights": [
      {
        "items": [
          "Mercy Corps is powered by the belief that a better world is possible. To do this, we know our teams do their best work when they are diverse and every team member feels that they belong. We welcome diverse backgrounds, perspectives, and skills so that we can be stronger and have long term impact.\n\nThe Program/Department Summary\n\nMercy Corps has been operating in the Democratic Republic of the Congo (DRC) since August 2007, with a staff of around 400 people working in Eastern DRC, with the overall country goal being to support vulnerable communities through crises, while fostering programs that build resilience and promote long-term change. Mercy Corps’ national office is in Goma with sub-field offices in North Kivu, South Kivu and Ituri. Mercy Corps DRC’s key programming areas include a combination of longer-term development and immediate humanitarian response programs in order to 1) Improve water service delivery and ensuring equitable access to Water, Sanitation and Hygiene... services, in urban and rural areas; 2) Improve food security and nutrition; 3) Promote diversified livelihoods, economic recovery and development; 4) Support peacebuilding and local governance. Mercy Corps DRC’s humanitarian programs aim specifically to assist populations affected by the conflict and crisis in Eastern Congo.\n\nIn October 2020, Mercy Corps started the five-year USAID’s Sustainable Water and Sanitation Systems Activity, with a budget of $32 million to be implemented in 4 locations across North and South Kivu. Building on the successes of Mercy Corps’ IMAGINE program, and those of other WASH actors in Eastern DRC, USAID’s Sustainable Water and Sanitation Systems Activity (SWASSA) has brought together a consortium of 3 international partners (Mercy Corps, TetraTech and Sanergy) to focus on water and sanitation. In partnership with USAID and in line with Development Objective 2 of USAID’s DRC Country Development Cooperation Strategy (CDCS), SWASSA aims to show that it is possible to achieve genuinely sustainable increases in access to clean water by implementing contextually relevant, performance-based contractual models for water service delivery in collaboration with state and local entities including Territorial (ETDs) and Provincial Administrations. The consortium of international partners works interconnectedly, leveraging their expertise in different areas to ensure the success of the\n\nActivity managed by Mercy Corps, Tetra Tech will focus on the infrastructure and market system delivery plan; and Sanergy provides the technical expertise in sanitation.\n\nThe Position\n\nThe role of the Water Systems Infrastructure and Performance (WSIP) Manager is to provide key delivery support to enable the SWASSA Activity to deliver sustainable water services. Mercy Corps is seeking a talented (international) professional with extensive experience in the governance of the development of water supply infrastructure and service delivery. The WSIP-Manager will lead activities to assess water system infrastructure and operational reliability of utilities and water service providers. The WSIP-Manager will mainly engage in a wide variety of technical and management activities aimed at expanding and improving the water service delivery, including the development of drinking water service delivery systems, the development of new contractual models with the Regies Provincials, Decentralized Territorial Entities (DTEs) and Water Users Associations (ASUREPs), and capacity building and training for private water service providers.\n\nWe are looking for (international) candidates with experience in the management of peri-urban water supply systems and a good understanding of performance management. Applicants should have knowledge of Public-Private Partnership contractual models for water services and water sector governance and be able to articulate trade-offs between design options and operational costs at short and long term of different service delivery models.\n\nThe Manager will be responsible for setting strategy, ensuring quality implementation and overseeing all activities. They will be responsible for ensuring compliance with USAID's regulations, working closely with relevant partners (Sanergy and Tetratech) and supervising a team of approximately 20 people. In addition, they will work closely with the Chief of Party to identify potential delays and resolve key risks, ensuring that the program is delivered on time. The Manager is expected to manage his/her team in an empowering and collaborative manner, with a focus on capacity building. He/she will be responsible for risk mitigation, crisis management, health and safety, with an emphasis on adherence to gender and safeguard best practices.\n\nResponsibilities\n• Support multi-criteria analysis for site selection in coordination with SWASSA consortium members and program stakeholders, support field information and data collection.\n• Oversee water network assessments which should cover the following components: technical management, operation and maintenance, financial management, organizational structures, customer service and energy efficiency.\n• Perform various types of analysis including actual infrastructure condition and cost, cost recovery and financial models, and basic performance indicators such as unremunerated water and other key performance indicators (KPIs).\n• Provide advice for planned infrastructure investments, including analysis of trade-offs between design options and short- and long-term operating costs and commercial viability.\n• Work on infrastructure planning and supervision, including design and build tenders, procurement support, and QA/QC.\n• Implement tasks related to improving the financial performance, business practices and customer service of water service providers.\n• Serve as the key point of contact between SWASSA and target water service providers related to business- and operational performance.\n• Liaise with international/local short-term technical assistance providing advice on specific improvement activity areas.\n\nQualifications:\n• Possess a bachelor's degree (Bac+3) in business administration, economics, public policy, urban planning, engineering, or any other relevant field; Masters level is preferred.\n• Must have at least 10 years of relevant working experience in the water and sanitation sector and a thorough understanding with water utilities/operating service providers.\n• Knowledge of the governance of water supply infrastructure development and finance (public and private). Specific knowledge of structuring and implementing Public-Private Partnerships is an advantage.\n• Demonstrated experience in technical interventions such as contracting for water services, unremunerated water, metering, and local actor ownership of water and sanitation services.\n• Experience in one or more of the following: development and management of small and medium enterprises; development and implementation of business plans; design and implementation of capacity building programs; technical management and financial management; and improving business efficiency.\n• Good communication and analytical skills with the ability to write well-structured technical reports and perform critical business plan reviews.\n• Must have computer proficiency in Microsoft Office applications such as Word, Excel, MS-Project, etc.\n• Experience working with donor funded projects and with different partners.\n• Fluency in French and English is required; fluency in Swahili is appreciated.\n• Work experience in East Africa and DRC ideally.\n\nSupervisory Responsibility: North Kivu Infrastructure Lead, South Kivu Infrastructure Lead, Sanitation Manager, GIS & CAD Engineer. Dotted line supervision to Tetratech Project Engineer.\n\nAccountability\n\nReports Directly To: Chief of Party\n\nWorks Directly With: DCOP – Governance, Director of Program Controls, MSD manager, Director of MERL, GESI manager, Consortium partners (Sanergy, Tetratech)\n\nAccountability to Participants and Stakeholders\n\nMercy Corps team members are expected to support all efforts toward accountability, specifically to our program participants, community partners, other stakeholders, and to international standards guiding international relief and development work. We are committed to actively engaging communities as equal partners in the design, monitoring and evaluation of our field projects.\n\nSuccess Factors\n\nThe successful Water Systems Infrastructure and Performance Manager will combine a strong collaborative working style with relevant technical expertise and a deep understanding of the challenges of implementing infrastructure projects in this kind of context. S/he should be an adept project manager, with the ability to implement quickly and accurately, troubleshooting and problem solving before issues arise, meet deadlines and process information to support the evolution of the program.\n\nS/he will demonstrate adaptability, flexibility in approach, and a strong sense of equity. The successful candidate will be expected to develop and strengthen the capacity of his/her team to grow with the program, ensuring a team who are not only technically brilliant but who have an understanding of the USAID regulations and Mercy Corps minimum standards. S/he will have strong coaching and mentoring skills and be able to apply them in difficult situations with a cross-cultural team.\n\nDue to the nature of this program, and the operating environment, the successful candidate must have a high level of internal resilience. In this program, patience, diplomacy, tenacity, compassion, determination and a sense of humor are all important factors for success.\n\nLiving Conditions / Environmental Conditions\n\nThis position is a non-accompanied position in Goma (DRC). Individual accommodation will be provided according to Mercy Corps DRC housing policy. Goma is a provincial capital of over 900,000 inhabitants. Living in Goma is mostly comfortable, although water and electricity can be unstable. Outside Goma, travel can be dangerous and unpredictable due to armed forces and rebel activity.\n\nMercy Corps' sub-offices experience variable levels of insecurity, with the situation closely monitored by UN peacekeepers. Air travel is necessary to get from one end of the country to the other. Mobile phones and cellular service are widely available. Internet is available in all Mercy Corps offices. Travel to field sites will be required where living conditions are clean and secure, but basic. There are a number of health services available with evacuation options for serious illnesses. There’s reasonable access to most consumer goods, although they can be expensive.\n\nMercy Corps Team members represent the agency both during and outside of work hours when deployed in a field posting or on a visit/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC's policies, procedures, and values at all times and in all in-country venues.\n\nFostering a diverse and open workplace is an important part of Mercy Corps’ vision. Mercy Corps is an Equal Opportunity Employer regardless of background. We are committed to creating an inclusive environment.\n\nOngoing Learning\n\nIn support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and/or professional growth and development.\n\nDiversity, Equity & Inclusion\n\nAchieving our mission begins with how we build our team and work together. Through our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world’s most complex challenges. We strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.\n\nWe recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.\n\nEqual Employment Opportunity\n\nMercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis. We actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.\n\nWe are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all. We do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.\n\nSafeguarding & Ethics\n\nMercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity. We are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASC and have signed on to the Interagency Misconduct Disclosure Scheme. We will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members. As part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to Mercy Corps Code of Conduct Policies and values at all times. Team members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.mercykit.org/",
        "text": "mercykit.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=Mercy+Corps&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCM8F",
        "text": "Voir les résultats Web pour Mercy Corps"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTa3AfieDDaKpRwXwlPE6a8Cgix5vyPTam1OBhu&s=0",
    "extensions": [
      "il y a 4 jours",
      "À plein temps"
    ],
    "detected_extensions": {
      "posted_at": "il y a 4 jours",
      "schedule_type": "À plein temps"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBTeXN0ZW1zIEluZnJhc3RydWN1cmUgYW5kIFBlcmZvcm1hbmNlIE1hbmFnZXIgLSBVU0FJROKAmVMgU3VzdGFpbmFibGUgV2F0ZXIgYW5kIFNhbml0YXRpb24gU3lzdGVtcyBBY3Rpdml0eSIsImh0aWRvY2lkIjoiR19TM3hKd1AxQUlsRFF3V0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6ImNnIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVXhQYm5CWlYybGhVV05FT0Rsa01IRmhVa0ZJYUd0ek9GZDFaM2szT1dvdFQzcFdPVXRmWW13d01FOTRiMnhMUzFsQ1JGcDNkVFpZZG1sMVlscGFNVW81YjJkUFpsYzNhakEwTVhkWmRGTmZXSHAxVFhWWGNVOUlNV1JUVGxJNGF6RlVlbk5PWlRGYVNWOW9WM0F3U0VSVFYxSlRZbEZXZVdKTWIxWklablpFUkZKUlFsVktiMGxIZWtjU0YweDZTbkphWlRkTVFWcFBNSEIwVVZCek5XMXBaMEZSR2lKQlNuZHJMVGhtZHpSMFQzTTFNV3BIZEZscFVHaEhlR1F4WmtaTVUzZzNaV2xSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiIubkZnMmVie2ZvbnQtd2VpZ2h0OjUwMH0uQmk2RGRje2ZvbnQtd2VpZ2h0OjUwMH1Qb3N0dWxlciBzdXIgVU5qb2JuZXQiLCJsaW5rIjoiaHR0cHM6Ly93d3cudW5qb2JuZXQub3JnL2pvYnMvZGV0YWlsLzY1NTUxMDc5P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Business Improvement Advisor – Sustainable Water and Sanitation...",
    "company_name": "Tetra Tech",
    "location": "  Bukavu, République démocratique du Congo   ",
    "via": "via MENA Jobs",
    "description": "The United States Agency for International Development (USAID) – funded Sustainable Water and Sanitation Systems Activity (SWASSA) in Democratic Republic of Congo, implemented by Tetra Tech International Development (www.tetratech.com/intdev) is currently accepting expressions of interest for a Business Improvement Advisor (Advisor). This position will be located in the secondary office in Bukavu, South Kivu, and s/he will report to the Business Improvement Manager who is based in Goma.\n\nThe Business Improvement Advisor will be part of a team implementing specific activities that result in increased financial sustainability and operational reliability of water and sanitation utilities/ service providers. S/he will join the Market Systems Development (MSD) team and work towards improving the capacity of supply chain actors to respond to demand for water and sanitation service delivery. The Advisor will also be engaged in a wide variety of technical activities designed to expand and... improve water service delivery, including, but not limited to development of drinking water service delivery systems and capacity building/ training for water service providers.\n\nResponsibilities:\n• Support organizational capacity assessments of water and sanitation service providers to understand their technical, administrative, financial, and commercial capabilities.\n• Design capacity building plans to improve core business functions such as human resources; financial management and accounting; costs management; sales; customer service; technical management; and system maintenance for water service providers.\n• Implement capacity building plans and facilitate trainings and workshops to address key areas of weakness for water services providers.\n• Support development of financial models and assessment of financial viability of the business models recommended for each site for implementation by SWASSA. Contribute to the development of business plans for water service providers.\n• Support planning and development of awareness raising campaigns designed to engage with existing and potential private water service providers and other actors within the value chain.\n• Support implementation of market-based public-private partnership contracts and procurement processes for water service delivery to communities including coordination and capacity building for governing entities.\n• Link the SWASSA activity with market actors and other key stakeholders in the water and sanitation sector.\n• Liaise with international/ local STTA providing guidance on specific improvement business areas.\n\nQualifications:\n• Possess a bachelor’s degree in Business Administration, Finance, Economics, or other relevant field; Master’s degree preferred.\n• Must have at least five (5) years of relevant professional experience in small and medium enterprise start-up, development, and management; business plans development; capacity building programs design and implementation; and business efficiency improvement.\n• Familiarity with water utilities/ service providers’ operations preferred.\n• Knowledge of DRC government’s laws and policies relevant to the water sector, including procurement regulations and policies preferred.\n• Experience working with donor-funded projects and with different partners in market development.\n• Strong communication and analytical skills, with the ability to write well-structured technical reports and to perform critical reviews of business plans.\n• Ability to work effectively in a multi-cultural and multi-ethnic environment.\n• Must be computer literate (in Microsoft Office applications such as Excel, Word, PowerPoint, etc.); strong skills in Microsoft Excel required.\n• Fluency in written and spoken French and/or Swahili is required; proficiency in English is preferred.\n• Experience working in Democratic Republic of Congo preferred.\n\nHow to apply\n\nTo be considered applicants must submit the following as part of the on-line process:\n• Cover Letter\n• CV in reverse chronological format\n\nPlease indicate where you saw Tetra Tech’s IDS ad posted.\n\nApply on-line at: https://bit.ly/BussinessImpSWASSA\n\nApplications that do not meet the minimum requirements listed above will not be considered. Please ensure that all necessary documents are uploaded, as incomplete applications and/or corrupt files may delay processing of your application or remove you from consideration. No phone calls will be accepted.\n\nAt Tetra Tech, health and safety play a vital role in our success. Tetra Tech’s employees work together to comply with all applicable health & safety practices and protocols, including health orders and regulations related to COVID-19 that are mandated by local, state, and federal authorities.\n\nTetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees – 21,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in over 450 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams. We are an equal opportunity employer: EOE AA/M/F/Vets/Disability",
    "job_highlights": [
      {
        "items": [
          "The United States Agency for International Development (USAID) – funded Sustainable Water and Sanitation Systems Activity (SWASSA) in Democratic Republic of Congo, implemented by Tetra Tech International Development (www.tetratech.com/intdev) is currently accepting expressions of interest for a Business Improvement Advisor (Advisor). This position will be located in the secondary office in Bukavu, South Kivu, and s/he will report to the Business Improvement Manager who is based in Goma.\n\nThe Business Improvement Advisor will be part of a team implementing specific activities that result in increased financial sustainability and operational reliability of water and sanitation utilities/ service providers. S/he will join the Market Systems Development (MSD) team and work towards improving the capacity of supply chain actors to respond to demand for water and sanitation service delivery. The Advisor will also be engaged in a wide variety of technical activities designed to expand and... improve water service delivery, including, but not limited to development of drinking water service delivery systems and capacity building/ training for water service providers.\n\nResponsibilities:\n• Support organizational capacity assessments of water and sanitation service providers to understand their technical, administrative, financial, and commercial capabilities.\n• Design capacity building plans to improve core business functions such as human resources; financial management and accounting; costs management; sales; customer service; technical management; and system maintenance for water service providers.\n• Implement capacity building plans and facilitate trainings and workshops to address key areas of weakness for water services providers.\n• Support development of financial models and assessment of financial viability of the business models recommended for each site for implementation by SWASSA. Contribute to the development of business plans for water service providers.\n• Support planning and development of awareness raising campaigns designed to engage with existing and potential private water service providers and other actors within the value chain.\n• Support implementation of market-based public-private partnership contracts and procurement processes for water service delivery to communities including coordination and capacity building for governing entities.\n• Link the SWASSA activity with market actors and other key stakeholders in the water and sanitation sector.\n• Liaise with international/ local STTA providing guidance on specific improvement business areas.\n\nQualifications:\n• Possess a bachelor’s degree in Business Administration, Finance, Economics, or other relevant field; Master’s degree preferred.\n• Must have at least five (5) years of relevant professional experience in small and medium enterprise start-up, development, and management; business plans development; capacity building programs design and implementation; and business efficiency improvement.\n• Familiarity with water utilities/ service providers’ operations preferred.\n• Knowledge of DRC government’s laws and policies relevant to the water sector, including procurement regulations and policies preferred.\n• Experience working with donor-funded projects and with different partners in market development.\n• Strong communication and analytical skills, with the ability to write well-structured technical reports and to perform critical reviews of business plans.\n• Ability to work effectively in a multi-cultural and multi-ethnic environment.\n• Must be computer literate (in Microsoft Office applications such as Excel, Word, PowerPoint, etc.); strong skills in Microsoft Excel required.\n• Fluency in written and spoken French and/or Swahili is required; proficiency in English is preferred.\n• Experience working in Democratic Republic of Congo preferred.\n\nHow to apply\n\nTo be considered applicants must submit the following as part of the on-line process:\n• Cover Letter\n• CV in reverse chronological format\n\nPlease indicate where you saw Tetra Tech’s IDS ad posted.\n\nApply on-line at: https://bit.ly/BussinessImpSWASSA\n\nApplications that do not meet the minimum requirements listed above will not be considered. Please ensure that all necessary documents are uploaded, as incomplete applications and/or corrupt files may delay processing of your application or remove you from consideration. No phone calls will be accepted.\n\nAt Tetra Tech, health and safety play a vital role in our success. Tetra Tech’s employees work together to comply with all applicable health & safety practices and protocols, including health orders and regulations related to COVID-19 that are mandated by local, state, and federal authorities.\n\nTetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees – 21,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in over 450 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams. We are an equal opportunity employer: EOE AA/M/F/Vets/Disability"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.tetratech.com/",
        "text": "tetratech.com"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=Tetra+Tech&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCP4F",
        "text": "Voir les résultats Web pour Tetra Tech"
      }
    ],
    "extensions": [
      "À plein temps"
    ],
    "detected_extensions": {
      "schedule_type": "À plein temps"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBJbXByb3ZlbWVudCBBZHZpc29yIOKAkyBTdXN0YWluYWJsZSBXYXRlciBhbmQgU2FuaXRhdGlvbiBTeXN0ZW1zIEFjdGl2aXR5LCBCdWthdnUsIENvbmdvIChLaW5zaGFzYSkiLCJodGlkb2NpZCI6ImZvbTVvNDQ5S05KOUxrOG5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJjZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVV4UGJuQlpWVzVtYURFeGQxUTRTbVUwZURCeVQyNXNhSFZLZUVJd2JIVkpPRmt6VFZRM2VISmxUVjlaVHkxc04xcHdObXRGVVc1eE1HTjRibVphT1ZSRVZ6WlFTalZaYmkxUWRtSTRlakZ2WWtKVFQxQnBOVlJVTjI1RVZsZE9TV3AzU0VrNVRXbzFTV3BtTFhneVJsaG9iM1Y0Y0V3d05HWmFRV1l4WmtoT1YxaEdWR3RRUXpCZldUUVNGMHg2U25KYVpUZE1RVnBQTUhCMFVWQnpOVzFwWjBGUkdpSkJTbmRyTFRobWJqUjBXUzFIVnpnMVJHNWFSMVp1Y1dWSmFsbDRkVWwzUlZKbiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiUG9zdHVsZXIgc3VyIE1FTkEgSm9icyIsImxpbmsiOiJodHRwczovL21lbmEtam9icy5jb20vam9iL2J1c2luZXNzLWltcHJvdmVtZW50LWFkdmlzb3Itc3VzdGFpbmFibGUtd2F0ZXItYW5kLXNhbml0YXRpb24tc3lzdGVtcy1hY3Rpdml0eS1idWthdnUtY29uZ28ta2luc2hhc2EvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Senior Officer, Water Treatment Technical",
    "company_name": "Globe 24-7",
    "location": "  République démocratique du Congo   ",
    "via": "via LinkedIn The Democratic Republic Of Congo",
    "description": "The Company\n\nKamoa Copper SA is a joint venture between Ivanhoe Mines (39.6%), Zijin Mining Group (39.6%), Crystal River Global Limited (0.8%) and the Government of the Democratic Republic of Congo (20%). It's a very large, near-surface, flat-lying, stratiform copper deposit with adjacent prospective exploration areas within the Central African Copperbelt, at approximately 25 kilometres west of the town of Kolwezi and about 270 kilometres west of the provincial capital of Lubumbashi.\n\nIn its endeavours to ramp up copper production and become the third-largest copper producer, the mine has started earthworks on a 500 000 t/y direct-to-blister flash. As they continue to break new ground and set new standards for sustainable and responsible mining, we invite you to be a part of their journey towards excellence.\n\nThe Role\n\nThe successful incumbent will ensure, organise, coordinate, and oversee the safe and effective operation of wastewater treatment equipment according to production... targets\n\nThe Key Responsibilities\n• Support implementation of water treatment equipment & commissioning\n• Ensure normal operation, maintenance and transformation of water treatment equipment and facilities within the Acid Plant\n• Drive effective problem-solving and continuous improvement\n• Build working relationships across teams and functional lines to enhance work delivery, collaboration and innovation\n• Reduce costs and waste\n• Support the Transformation agenda\n• Follow the HSEQ plan for the Business area\n• Adhere to and improve reporting processes for the area of responsibility\n• Meet Quality Assurance standards and participate in audits\n\nThe Requirements\n• Junior college with relevant Chemical engineering majors\n• 2 years' relevant wastewater treatment experience\n• Operating Acid plant machines or equipment\n• Wastewater treatment process management\n\nThe Rewards\n\nThe position offers a 2 year contract with a competitive remuneration package on single status with a great FIFO roster. The newly built accommodation village offers secure and modern facilities with meals provided on-site.\n\nApplying\n\nPease submit your CV together with a copy of your ID or passport via the necessary link.\n\nShould you not hear from us within 30 days of submitting your application then please consider it to be unsuccessful",
    "job_highlights": [
      {
        "items": [
          "The Company\n\nKamoa Copper SA is a joint venture between Ivanhoe Mines (39.6%), Zijin Mining Group (39.6%), Crystal River Global Limited (0.8%) and the Government of the Democratic Republic of Congo (20%). It's a very large, near-surface, flat-lying, stratiform copper deposit with adjacent prospective exploration areas within the Central African Copperbelt, at approximately 25 kilometres west of the town of Kolwezi and about 270 kilometres west of the provincial capital of Lubumbashi.\n\nIn its endeavours to ramp up copper production and become the third-largest copper producer, the mine has started earthworks on a 500 000 t/y direct-to-blister flash. As they continue to break new ground and set new standards for sustainable and responsible mining, we invite you to be a part of their journey towards excellence.\n\nThe Role\n\nThe successful incumbent will ensure, organise, coordinate, and oversee the safe and effective operation of wastewater treatment equipment according to production... targets\n\nThe Key Responsibilities\n• Support implementation of water treatment equipment & commissioning\n• Ensure normal operation, maintenance and transformation of water treatment equipment and facilities within the Acid Plant\n• Drive effective problem-solving and continuous improvement\n• Build working relationships across teams and functional lines to enhance work delivery, collaboration and innovation\n• Reduce costs and waste\n• Support the Transformation agenda\n• Follow the HSEQ plan for the Business area\n• Adhere to and improve reporting processes for the area of responsibility\n• Meet Quality Assurance standards and participate in audits\n\nThe Requirements\n• Junior college with relevant Chemical engineering majors\n• 2 years' relevant wastewater treatment experience\n• Operating Acid plant machines or equipment\n• Wastewater treatment process management\n\nThe Rewards\n\nThe position offers a 2 year contract with a competitive remuneration package on single status with a great FIFO roster. The newly built accommodation village offers secure and modern facilities with meals provided on-site.\n\nApplying\n\nPease submit your CV together with a copy of your ID or passport via the necessary link.\n\nShould you not hear from us within 30 days of submitting your application then please consider it to be unsuccessful"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=Globe+24-7&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCKoG",
        "text": "Voir les résultats Web pour Globe 24-7"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTUFHR5KReAjpNrStv9ClrF2Di9bq3tx8SxCew6jOQ&s",
    "extensions": [
      "À plein temps"
    ],
    "detected_extensions": {
      "schedule_type": "À plein temps"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgT2ZmaWNlciwgV2F0ZXIgVHJlYXRtZW50IFRlY2huaWNhbCIsImh0aWRvY2lkIjoiWWdMemNrc1VWbkVLbkU4UEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6ImNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJQb3N0dWxlciBzdXIgTGlua2VkSW4gVGhlIERlbW9jcmF0aWMgUmVwdWJsaWMgT2YgQ29uZ28iLCJsaW5rIjoiaHR0cHM6Ly9jZC5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1vZmZpY2VyLXdhdGVyLXRyZWF0bWVudC10ZWNobmljYWwtYXQtZ2xvYmUtMjQtNy0zNzQxMzcyNDM3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Project Engineer - Wastewater",
    "company_name": "IRIS | Networx | Recruitment Software & Services",
    "location": "  République démocratique du Congo   ",
    "via": "via LinkedIn The Democratic Republic Of Congo",
    "description": "About The Company\n\nWhy not come and work for one of Ireland's most progressive and ambitious engineering and environmental consultancies. We work in sustainability so if you want to progress your career in a socially responsible company working towards a sustainable planet then join us.\n\nWe are based in Ireland but also work in the UK, Europe, Africa, Asia, and the Middle East. We are part of the RSK Group, a group of more than 175 companies with over 11,000 employees operating around the globe and are one of the leading engineering and environmental science companies in the world. do.\n\nAbout The Role\n\nWe are currently seeking a highly skilled and experienced Project Engineer specializing in Wastewater engineering to join our team to work on projects in Ireland and internationally. The successful candidate will be responsible for the planning, design, procurement, and construction administration of Wastewater infrastructure projects.\n\nKey Duties And Responsibilities\n• Preparation of... Feasibility, Route and Site Selections and Concept Design Reports.\n• Preparation of Detailed Designs including detailed design drawings, calculations, and reports.\n• Preparing Technical Specifications and Contract Documents for main works and investigation contracts.\n• Undertaking Tender Evaluation and Procurement processes.\n• Preparation of all documentation required for statutory approvals such as planning permissions and acquiring of land acquisition & wayleaves.\n• Construction stage contract administration.\n• Developing detailed project plans, including budgets, schedules, and resource allocation.\n• Contributing on Wastewater engineering projects from inception to completion, ensuring they are delivered within budget and on schedule.\n• Collaborating with clients, stakeholders, and regulatory bodies to ensure project compliance with applicable regulations and standards.\n• Providing technical expertise and guidance to junior engineers and support staff.\n• Performing site visits and inspections to monitor project progress, quality, and adherence to specifications.\n• Preparing and reviewing technical reports, drawings, and specifications.\n• Monitoring and controlling project costs, including tracking expenses and managing change orders.\n• Identifying and mitigating project risks and implementing effective risk management strategies.\n• Fostering effective communication and collaboration among project team members and stakeholders.\n\nKey Requirements\n• Bachelor's degree in civil engineering or a related field.\n• Minimum of 5 years of experience in water engineering, with a focus on feasibility study, detailed design, planning approvals, procurement, and construction contract administration of water infrastructure projects.\n• Strong knowledge of Wastewater engineering principles, practices, and regulations.\n• Proficiency in design of Wastewater infrastructure projects and analysis software.\n• Strong knowledge of various Contract Forms for Construction Contracts\n• Proven track record in successfully managing Wastewater engineering projects of varying complexity.\n• Excellent project management skills, including the ability to prioritize tasks, manage resources, and meet project milestones.\n\nIf you are a highly motivated and experienced Project Engineer with a strong background in Wastewater engineering and a passion for delivering high-quality projects, we invite you to apply for this exciting opportunity. Join our team and contribute to the sustainable development of water infrastructure in Ireland",
    "job_highlights": [
      {
        "items": [
          "About The Company\n\nWhy not come and work for one of Ireland's most progressive and ambitious engineering and environmental consultancies. We work in sustainability so if you want to progress your career in a socially responsible company working towards a sustainable planet then join us.\n\nWe are based in Ireland but also work in the UK, Europe, Africa, Asia, and the Middle East. We are part of the RSK Group, a group of more than 175 companies with over 11,000 employees operating around the globe and are one of the leading engineering and environmental science companies in the world. do.\n\nAbout The Role\n\nWe are currently seeking a highly skilled and experienced Project Engineer specializing in Wastewater engineering to join our team to work on projects in Ireland and internationally. The successful candidate will be responsible for the planning, design, procurement, and construction administration of Wastewater infrastructure projects.\n\nKey Duties And Responsibilities\n• Preparation of... Feasibility, Route and Site Selections and Concept Design Reports.\n• Preparation of Detailed Designs including detailed design drawings, calculations, and reports.\n• Preparing Technical Specifications and Contract Documents for main works and investigation contracts.\n• Undertaking Tender Evaluation and Procurement processes.\n• Preparation of all documentation required for statutory approvals such as planning permissions and acquiring of land acquisition & wayleaves.\n• Construction stage contract administration.\n• Developing detailed project plans, including budgets, schedules, and resource allocation.\n• Contributing on Wastewater engineering projects from inception to completion, ensuring they are delivered within budget and on schedule.\n• Collaborating with clients, stakeholders, and regulatory bodies to ensure project compliance with applicable regulations and standards.\n• Providing technical expertise and guidance to junior engineers and support staff.\n• Performing site visits and inspections to monitor project progress, quality, and adherence to specifications.\n• Preparing and reviewing technical reports, drawings, and specifications.\n• Monitoring and controlling project costs, including tracking expenses and managing change orders.\n• Identifying and mitigating project risks and implementing effective risk management strategies.\n• Fostering effective communication and collaboration among project team members and stakeholders.\n\nKey Requirements\n• Bachelor's degree in civil engineering or a related field.\n• Minimum of 5 years of experience in water engineering, with a focus on feasibility study, detailed design, planning approvals, procurement, and construction contract administration of water infrastructure projects.\n• Strong knowledge of Wastewater engineering principles, practices, and regulations.\n• Proficiency in design of Wastewater infrastructure projects and analysis software.\n• Strong knowledge of various Contract Forms for Construction Contracts\n• Proven track record in successfully managing Wastewater engineering projects of varying complexity.\n• Excellent project management skills, including the ability to prioritize tasks, manage resources, and meet project milestones.\n\nIf you are a highly motivated and experienced Project Engineer with a strong background in Wastewater engineering and a passion for delivering high-quality projects, we invite you to apply for this exciting opportunity. Join our team and contribute to the sustainable development of water infrastructure in Ireland"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=IRIS+%7C+Networx+%7C+Recruitment+Software+%26+Services&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCNcG",
        "text": "Voir les résultats Web pour IRIS | Networx | Recruitment Software & Services"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLT1ZyP0ZfgYBK8SgMgyBSLfmJDGm01A-QNmEja_c&s",
    "extensions": [
      "il y a 1 mois",
      "Prestataire"
    ],
    "detected_extensions": {
      "posted_at": "il y a 1 mois",
      "schedule_type": "Prestataire"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQcm9qZWN0IEVuZ2luZWVyIC0gV2FzdGV3YXRlciIsImh0aWRvY2lkIjoiWkpGM0FINTZ5UmRranZaOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6ImNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJQb3N0dWxlciBzdXIgTGlua2VkSW4gVGhlIERlbW9jcmF0aWMgUmVwdWJsaWMgT2YgQ29uZ28iLCJsaW5rIjoiaHR0cHM6Ly9jZC5saW5rZWRpbi5jb20vam9icy92aWV3L3Byb2plY3QtZW5naW5lZXItd2FzdGV3YXRlci1hdC1pcmlzLW5ldHdvcngtcmVjcnVpdG1lbnQtc29mdHdhcmUtc2VydmljZXMtMzc1MjAzMzA0ND91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Senior Resident Engineer - MEICA",
    "company_name": "IRIS | Networx | Recruitment Software & Services",
    "location": "  République démocratique du Congo   ",
    "via": "via LinkedIn The Democratic Republic Of Congo",
    "description": "About The Company\n\nWhy not come and work for one of Ireland's most progressive and ambitious engineering and environmental consultancies. We work in sustainability so if you want to progress your career in a socially responsible company working towards a sustainable planet then join us.\n\nWe are based in Ireland but also work in the UK, Europe, Africa, Asia, and the Middle East. We are part of the RSK Group, a group of more than 175 companies with over 11,000 employees operating around the globe, and are one of the leading engineering and environmental science companies in the world.\n\nSenior Resident Engineer - MEICA\n\nWe currently are seeking a Senior Resident Engineer - MEICA position for a regional-based role in Greater Dublin, Ireland with the preferred candidates having at least 7 years of experience in a similar role.\n\nThis role provides an exciting opportunity to play a vital role within the site supervision team on Water and Wastewater infrastructure projects in a rapidly... growing established Irish-owned company where efficient procedures and processes, in an ever-changing business environment, are a must.\n\nThe successful candidate will be an integral member of our Team and will work with our Staff to ensure the highest quality and standards are achieved in all our activities and services that we provide to our Clients.\n\nKey Duties And Responsibilities\n\nThe successful candidate will, amongst other things, be responsible for:\n• Reporting to the Project Resident Engineer and Employer’s Representative.\n• Liaison with the Site Supervision Teams on each Contract.\n• Dealing with contractual matters on-site related to MEICA Works.\n• Assessment of Contractor claims and writing reports on same.\n• Assessment of Contractor payment applications against work completed.\n• Assessment of Contractor performance against Contractual KPIs.\n• Assessment of Contractor submissions including method statements and preparation of clear comments.\n• Review Contractor MEICA design submissions including equipment details against client requirements and preparation of clear comments.\n• Supervise works, keeping records, measuring, managing correspondence, and contractual documentation.\n• Monitoring the commissioning of the works and process proving.\n• Other duties as may be assigned.\n\nKey Requirements\n• Primary degree in Mechanical or Electrical Engineering or other relevant disciplines.\n• 7 to 10 years of relevant experience in major engineering projects.\n• Strong knowledge of the water industry is preferred.\n• Familiarity with industry-standard forms of contract.\n• Experience in the design, installation, and commissioning of MEICA infrastructure.\n• Expertise with P&IDs, Electrical Wiring Diagrams, Control Philosophy, and Factory/Site Acceptance Testing.\n• Awareness of Health & Safety and welfare at work requirements during construction and operation",
    "job_highlights": [
      {
        "items": [
          "About The Company\n\nWhy not come and work for one of Ireland's most progressive and ambitious engineering and environmental consultancies. We work in sustainability so if you want to progress your career in a socially responsible company working towards a sustainable planet then join us.\n\nWe are based in Ireland but also work in the UK, Europe, Africa, Asia, and the Middle East. We are part of the RSK Group, a group of more than 175 companies with over 11,000 employees operating around the globe, and are one of the leading engineering and environmental science companies in the world.\n\nSenior Resident Engineer - MEICA\n\nWe currently are seeking a Senior Resident Engineer - MEICA position for a regional-based role in Greater Dublin, Ireland with the preferred candidates having at least 7 years of experience in a similar role.\n\nThis role provides an exciting opportunity to play a vital role within the site supervision team on Water and Wastewater infrastructure projects in a rapidly... growing established Irish-owned company where efficient procedures and processes, in an ever-changing business environment, are a must.\n\nThe successful candidate will be an integral member of our Team and will work with our Staff to ensure the highest quality and standards are achieved in all our activities and services that we provide to our Clients.\n\nKey Duties And Responsibilities\n\nThe successful candidate will, amongst other things, be responsible for:\n• Reporting to the Project Resident Engineer and Employer’s Representative.\n• Liaison with the Site Supervision Teams on each Contract.\n• Dealing with contractual matters on-site related to MEICA Works.\n• Assessment of Contractor claims and writing reports on same.\n• Assessment of Contractor payment applications against work completed.\n• Assessment of Contractor performance against Contractual KPIs.\n• Assessment of Contractor submissions including method statements and preparation of clear comments.\n• Review Contractor MEICA design submissions including equipment details against client requirements and preparation of clear comments.\n• Supervise works, keeping records, measuring, managing correspondence, and contractual documentation.\n• Monitoring the commissioning of the works and process proving.\n• Other duties as may be assigned.\n\nKey Requirements\n• Primary degree in Mechanical or Electrical Engineering or other relevant disciplines.\n• 7 to 10 years of relevant experience in major engineering projects.\n• Strong knowledge of the water industry is preferred.\n• Familiarity with industry-standard forms of contract.\n• Experience in the design, installation, and commissioning of MEICA infrastructure.\n• Expertise with P&IDs, Electrical Wiring Diagrams, Control Philosophy, and Factory/Site Acceptance Testing.\n• Awareness of Health & Safety and welfare at work requirements during construction and operation"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=IRIS+%7C+Networx+%7C+Recruitment+Software+%26+Services&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCIQH",
        "text": "Voir les résultats Web pour IRIS | Networx | Recruitment Software & Services"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLT1ZyP0ZfgYBK8SgMgyBSLfmJDGm01A-QNmEja_c&s",
    "extensions": [
      "À plein temps"
    ],
    "detected_extensions": {
      "schedule_type": "À plein temps"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUmVzaWRlbnQgRW5naW5lZXIgLSBNRUlDQSIsImh0aWRvY2lkIjoiZTJScXNLcU5ObUlDNG9RR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6ImNnIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJQb3N0dWxlciBzdXIgTGlua2VkSW4gVGhlIERlbW9jcmF0aWMgUmVwdWJsaWMgT2YgQ29uZ28iLCJsaW5rIjoiaHR0cHM6Ly9jZC5saW5rZWRpbi5jb20vam9icy92aWV3L3Nlbmlvci1yZXNpZGVudC1lbmdpbmVlci1tZWljYS1hdC1pcmlzLW5ldHdvcngtcmVjcnVpdG1lbnQtc29mdHdhcmUtc2VydmljZXMtMzc0MDUzMTExMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Chief of Party – USAID’s Sustainable Water and Sanitation Systems...",
    "company_name": "Mercy Corps",
    "location": "  Goma, République démocratique du Congo   ",
    "via": "via MENA Jobs",
    "description": "About Mercy Corps\n\nMercy Corps is a leading global organization powered by the belief that a better world is possible. In disaster, in hardship, in more than 40 countries around the world, we partner to put bold solutions into action — helping people triumph over adversity and build stronger and resilient communities from within. Now, and for the future.\n\nThe Program/Department Summary\n\nMercy Corps has been operating in the Democratic Republic of the Congo (DRC) since August 2007, with a staff of around 400 people working in Eastern DRC, with the overall country goal being to support vulnerable communities through crises, while fostering programs that build resilience and promote long-term change. Mercy Corps’ national office is in Goma with sub-field offices in North Kivu, South Kivu and Ituri. Mercy Corps DRC’s key programming areas include a combination of longer-term development and immediate humanitarian response programs in order to 1) Improve water service delivery and ensuring... equitable access to Water, Sanitation and Hygiene services, in urban and rural areas; 2) Improve food security and nutrition; 3) Promote diversified livelihoods, economic recovery and development; 4) Support peacebuilding and local governance. Mercy Corps DRC’s humanitarian programs aim specifically to assist populations affected by the conflict and crisis in Eastern Congo.\n\nIn October 2020, Mercy Corps started the five-year USAID’s Sustainable Water and Sanitation Systems Activity, with a budget of $32 million to be implemented in 4 locations across North and South Kivu. Building on the successes of Mercy Corps’ IMAGINE program, and those of other WASH actors in Eastern DRC, USAID’s Sustainable Water and Sanitation Systems Activity (SWASSA) has brought together a consortium of 3 international partners (Mercy Corps, TetraTech and Sanergy) to focus on water and sanitation. In partnership with USAID and in line with Development Objective 2 of USAID’s DRC Country Development Cooperation Strategy (CDCS), SWASSA aims to show that it is possible to achieve genuinely sustainable increases in access to clean water by implementing contextually relevant, performance-based contractual models for water service delivery in collaboration with state and local entities including Territorial (ETDs) and Provincial Administrations. The consortium of international partners works interconnectedly, leveraging their expertise in different areas to ensure the success of the Activity. Led by Mercy Corps, Tetra Tech will focus on the design of the infrastructure and market system delivery plan; and Sanergy provides the technical expertise in sanitation.\n\nThe Position\n\nThe Chief of Party (COP) provides strategic vision, overall leadership, technical oversight (particularly for WASH market systems), and team and program management of this multi-million dollar USAID-funded program, while managing staff, partners and resources to ensure that the program meets its targets and deliverables on-time, on scope, and within budget.\n\nThe CoP will work closely with the Senior Leadership Team composed of the Deputy Chief of Party – Stakeholder Engagement & Governance, Director – Program Controls, Director – Monitoring, Evaluation, Research and Learning; and 6 Program Delivery Managers. Together, they will be responsible for supervising program staff and ensuring accountability to Mercy Corps policies and donor rules and regulations.\n\nKey responsibilities\n\nPROGRAM LEADERSHIP\n• Drive a culture of collaboration, learning and adaptation throughout the team and prosecute continuous improvement\n• Maintain focus and promote attention throughout the team of the overarching program goal, consistently ensuring alignment throughout all activities.\n• Lead overall cross team coordination efforts, bringing together different stakeholders to proactively find a collective and innovative solution for challenges.\n• Contribute to country wide team building efforts through collaboration with the Mercy Corps DRC team and influencing the development and strengthening of the organization.\n• Represent the program across the Mercy Corps global team and internally at Mercy Corps DRC, promoting best practice, sharing lessons learned and influencing the global strategy.\n\nTECHNICAL OVERSIGHT\n• Provide direction for Market Systems Development to ensure the approach and performance can be sustainable with developed service implementation models. Work closely with Tetra Tech to ensure the highest standard of MSD strategy and implementation across four program sites. Critically analyze and provide feedback on the proposed plans, ensuring integration and synergy with the other components, particularly governance.\n• Provide technical direction, leadership and oversight of all technical elements. This encompasses Markets System Delivery, Stakeholder Relations and Governance, Water Infrastructure, Sanitation, Research, Monitoring and Evaluation, Gender, Youth, and Communication.\n• Environment – ensure cross program strategy aligns with USAID environmental regulations and best practice. Oversee Environment focal point, and the development of USAID required documents including: the global environmental management plan, the site-specific environmental review of factors, site specific environmental review reports and annual environmental management and mitigation report.\n• Resilience – ensure cross cutting resilience strategies are purposefully introduced to ensure the program is implemented in a sustainable way. This includes introducing an increased focus on climate resilience.\n\nSTRATEGY AND VISION\n• Ensure programs are running in alignment with Mercy Corps’ principles, values and the program’s strategic plan, particularly in regard to maintaining a focus on gender equality and social inclusion across the program.\n• Recognize, promote and act on opportunities for innovative action and create an environment where this is regularly encouraged.\n• Set the direction and support the Director – Program Controls in the development of annual, integrated strategic work-plans for the program.\n\nTEAM MANAGEMENT\n• Create and sustain a work environment of mutual respect where accountability is promoted, alternative viewpoints welcomed, the team strives to achieve excellence, and is conducive to professional growth. A key facet of the SWASSA team is to ensure accountability and to build trust; maintaining and strengthening a healthy team culture is essential to this role.\n• Promote a team culture which values ongoing collaboration, learning and adaptation, integrating an increased Resilience approach to program implementation.\n• Supervise the Senior Leadership Team existing of 6 team members from Mercy Corps and partners. Clearly establish and communicate performance expectations and regularly provide constructive feedback via performance reviews with direct supervisees.\n• Strengthen the ownership of the Senior Leadership Team, empowering them to make decisions individually, contribute to strategic discussions and invest in continuous growth.\n• Promote a team culture that values diversity, equity and inclusion and work closely with HR and the Senior Leadership Team to actively promote diversity, equity and inclusion within the SWASSA team composition and leadership structure\n• Contribute to country team-building efforts, help team members identify problem solving options and ensure the integration of all team members into relevant decision-making processes.\n• Work with the Director of Program Controls to implement a workforce development plan, actively managing and promoting professional development and ongoing training of staff to ensure they are of the quality and technical capacity necessary to ensure the successful implementation of activities.\n\nPROGRAM MANAGEMENT\n• Work closely with the Director of Program Controls to ensure oversight and implementation of the highest standard of program management tools. This includes risk management, updated and timely workplans and accurate budgeting.\n• Lead Consortium Management, with the two critical international program partnerships to ensure sound coordination in the context of an overall program strategic and resilience-building framework\n• Provide oversight of all component implementation, including ensuring that each component has a detailed implementation plan aligned and coordinated with others.\n• Supervise and manage all program staff to ensure day-to-day activities are implemented in a coordinated fashion according to schedule, budget and quality.\n• Set direction by prioritizing and organizing actions and resources to achieve objectives.\n• Act as program lead on relevant incident management responses, in coordination with country level leadership, as they arise.\n\nOPERATIONS, FINANCE AND COMPLIANCE MANAGEMENT\n• Ensure Positive coordination with operations, finance and other support departments, ensuring open and transparent communication and coordination between both parties and knowledge and adherence to processes and policies.\n• Ensure effective systems and structures (including finance, logistics, procurement, security, administration and human resources) are implemented to maximize support to field activities whilst ensuring compliance with regulations and policies.\n• Hold ultimate accountability for budgetary oversight and management, whilst building the team’s capacity to understand budgeting and financial management.\n• Promote compliance with USAID regulations, Mercy Corps policies and procedures and ensure all activities are implemented accordingly.\n• Confirm that programs are designed and implemented with a clear analysis and understanding of security management priorities.\n\nCOORDINATION AND REPRESENTATION\n• Primary program representative for USAID and other cooperating sponsors, donors and high-level international stakeholders, including private sector entities, NGOs, public utilities, etc. Responsible for building strong relationships in the sector and ensuring proactive and continuous engagement to promote the program and maintain abreast of sector specific news and events.\n• Support the DCoP – Stakeholder Engagement, in engaging regularly with local government and civil society, Community and Water Sector based partners building a strong reputation for the program and creating support.\n• When required, act as the media spokesperson on behalf of the program, giving interviews, delivering speeches and hosting press conferences under the strict guidance of the Communication team.\n\nSupervisory Responsibility\n\nDeputy Chief of Party – Stakeholder Relationships & Governance; Director – Program Controls; Director – Monitoring, Evaluation, Research and Learning; Environment, Sanitation & Infrastructure Delivery Manager; Market Systems Development Lead (Tetratech), Water Infrastructure Manager (Tetratech).\n\nReports Directly To: Director of Programs\n\nWorks Directly With: Country Director, DRC Program Directors, Deputy Chief of Party, Program Delivery Managers (M&E, Market Service Delivery, Governance, Infrastructure), Heads of Offices, Operations Director, HR/Admin Director, Finance Director and associated Managers.\n\nAccountability to Participants and Stakeholders\n\nMercy Corps team members are expected to support all efforts toward accountability, specifically to our program participants, community partners, other stakeholders, and to international standards guiding international relief and development work. We are committed to actively engaging communities as equal partners in the design, monitoring and evaluation of our field projects.\n\nMinimum Qualification & Transferable Skills\n• MA/MSc in business, program management, financial administration or equivalent.\n• 10 years or more of management experience in increasingly responsible positions – preferably as the lead for a comparable water and sanitation project or senior leadership/management position on a larger project.\n• Experience working with water or electricity utilities, either public or private.\n• Demonstrated ability to build and maintain relationships with host governments, private sector entities, donors, other donor-funded projects and stakeholders, local organizations, and partners.\n• Demonstrated knowledge of and experience with USAID policies, procedures and approaches with regards to design, implementation, budgeting, monitoring and evaluation for projects of a similar size.\n• Exceptional relationship building skills, with demonstrated experience in management of large and cross cultural teams. Must be committed to promoting equality and inclusion throughout their management style.\n• Strong preference will be given to applicants with private sector experience, business acumen and interest in public-private partnerships and contractual agreements (involving interlinked infrastructure and service delivery).\n• Certified in program management or commitment to achieve certification within first 3 months of position.\n• Fluency in oral/written English and French at high intermediate level is required.\n• Previous experience leading programs in a similar context to DRC is strongly desired.\n\nSuccess Factors\n\nThe successful Chief of Party will embody a collaborative and values driven leadership approach, combining exceptional program management and technical skills in commercial market sectors and business model development. S/he should bring experience of building and maintaining robust donor, private sector, government and partner relationships in a challenging context. The successful candidate will have an outstanding ability to ensure technical excellence, whilst holding team members accountable to the highest standards of program management and pushing for continuous adaptation and innovative improvements. S/he will also have proven experience with cross-cultural team and capacity building, individual staff development and strong mentoring skills.\n\nThe CoP must have demonstrated experience managing market sector development in a water or electricity utility (public or private). S/he will have demonstrated skills in managing large scale and challenging programs in volatile and insecure environments. Multi-tasking, prioritizing, problem-solving and simultaneous attention to detail whilst maintaining strategic vision are essential. The most successful Mercy Corps staff members have a strong commitment to teamwork and accountability, thrive in evolving and changing environments and make effective written and verbal communication a priority in all situations.\n\nDue to the nature of this program, and the operating environment, the successful candidate must have a high level of internal resilience.\n\nLiving Conditions / Environmental Conditions\n\nThis position is an accompanied position in Goma (DRC) (based in Gisenyi, Rwanda if accompanied with spouse and/or children). Individual accommodation will be provided according to Mercy Corps DRC housing policy. Goma is a provincial capital of over 900,000 inhabitants. Living in Goma is mostly comfortable, although water and electricity can be unstable. Outside Goma, travel can be dangerous and unpredictable due to armed forces and rebel activity.\n\nMercy Corps’ sub-offices experience variable levels of insecurity, with the situation closely monitored by UN peacekeepers. Air travel is necessary to get from one end of the country to the other. Mobile phones and cellular service are widely available. Internet is available in all Mercy Corps offices. Travel to field sites will be required where living conditions are clean and secure, but basic. There are a number of health services available with evacuation options for serious illnesses. There’s reasonable access to most consumer goods, although they can be expensive.\n\nMercy Corps Team members represent the agency both during and outside of work hours when deployed in a field posting or on a visit/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC’s policies, procedures, and values at all times and in all in-country venues.\n\nFostering a diverse and open workplace is an important part of Mercy Corps’ vision. Mercy Corps is an Equal Opportunity Employer regardless of background. We are committed to creating an inclusive environment.\n\nOngoing Learning\n\nIn support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and/or professional growth and development\n\nDiversity, Equity & Inclusion\n\nAchieving our mission begins with how we build our team and work together. Through our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world’s most complex challenges. We strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.\n\nWe recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.\n\nEqual Employment Opportunity\n\nMercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis. We actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.\n\nWe are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all. We do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.\n\nSafeguarding & Ethics\n\nMercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity. We are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASC and have signed on to the Interagency Misconduct Disclosure Scheme. We will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members. As part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to Mercy Corps Code of Conduct Policies and values at all times. Team members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis.\n\nHow to apply\n\nApply here: https://jobs.jobvite.com/mercycorps/job/oo9nkfwY",
    "job_highlights": [
      {
        "items": [
          "About Mercy Corps\n\nMercy Corps is a leading global organization powered by the belief that a better world is possible. In disaster, in hardship, in more than 40 countries around the world, we partner to put bold solutions into action — helping people triumph over adversity and build stronger and resilient communities from within. Now, and for the future.\n\nThe Program/Department Summary\n\nMercy Corps has been operating in the Democratic Republic of the Congo (DRC) since August 2007, with a staff of around 400 people working in Eastern DRC, with the overall country goal being to support vulnerable communities through crises, while fostering programs that build resilience and promote long-term change. Mercy Corps’ national office is in Goma with sub-field offices in North Kivu, South Kivu and Ituri. Mercy Corps DRC’s key programming areas include a combination of longer-term development and immediate humanitarian response programs in order to 1) Improve water service delivery and ensuring... equitable access to Water, Sanitation and Hygiene services, in urban and rural areas; 2) Improve food security and nutrition; 3) Promote diversified livelihoods, economic recovery and development; 4) Support peacebuilding and local governance. Mercy Corps DRC’s humanitarian programs aim specifically to assist populations affected by the conflict and crisis in Eastern Congo.\n\nIn October 2020, Mercy Corps started the five-year USAID’s Sustainable Water and Sanitation Systems Activity, with a budget of $32 million to be implemented in 4 locations across North and South Kivu. Building on the successes of Mercy Corps’ IMAGINE program, and those of other WASH actors in Eastern DRC, USAID’s Sustainable Water and Sanitation Systems Activity (SWASSA) has brought together a consortium of 3 international partners (Mercy Corps, TetraTech and Sanergy) to focus on water and sanitation. In partnership with USAID and in line with Development Objective 2 of USAID’s DRC Country Development Cooperation Strategy (CDCS), SWASSA aims to show that it is possible to achieve genuinely sustainable increases in access to clean water by implementing contextually relevant, performance-based contractual models for water service delivery in collaboration with state and local entities including Territorial (ETDs) and Provincial Administrations. The consortium of international partners works interconnectedly, leveraging their expertise in different areas to ensure the success of the Activity. Led by Mercy Corps, Tetra Tech will focus on the design of the infrastructure and market system delivery plan; and Sanergy provides the technical expertise in sanitation.\n\nThe Position\n\nThe Chief of Party (COP) provides strategic vision, overall leadership, technical oversight (particularly for WASH market systems), and team and program management of this multi-million dollar USAID-funded program, while managing staff, partners and resources to ensure that the program meets its targets and deliverables on-time, on scope, and within budget.\n\nThe CoP will work closely with the Senior Leadership Team composed of the Deputy Chief of Party – Stakeholder Engagement & Governance, Director – Program Controls, Director – Monitoring, Evaluation, Research and Learning; and 6 Program Delivery Managers. Together, they will be responsible for supervising program staff and ensuring accountability to Mercy Corps policies and donor rules and regulations.\n\nKey responsibilities\n\nPROGRAM LEADERSHIP\n• Drive a culture of collaboration, learning and adaptation throughout the team and prosecute continuous improvement\n• Maintain focus and promote attention throughout the team of the overarching program goal, consistently ensuring alignment throughout all activities.\n• Lead overall cross team coordination efforts, bringing together different stakeholders to proactively find a collective and innovative solution for challenges.\n• Contribute to country wide team building efforts through collaboration with the Mercy Corps DRC team and influencing the development and strengthening of the organization.\n• Represent the program across the Mercy Corps global team and internally at Mercy Corps DRC, promoting best practice, sharing lessons learned and influencing the global strategy.\n\nTECHNICAL OVERSIGHT\n• Provide direction for Market Systems Development to ensure the approach and performance can be sustainable with developed service implementation models. Work closely with Tetra Tech to ensure the highest standard of MSD strategy and implementation across four program sites. Critically analyze and provide feedback on the proposed plans, ensuring integration and synergy with the other components, particularly governance.\n• Provide technical direction, leadership and oversight of all technical elements. This encompasses Markets System Delivery, Stakeholder Relations and Governance, Water Infrastructure, Sanitation, Research, Monitoring and Evaluation, Gender, Youth, and Communication.\n• Environment – ensure cross program strategy aligns with USAID environmental regulations and best practice. Oversee Environment focal point, and the development of USAID required documents including: the global environmental management plan, the site-specific environmental review of factors, site specific environmental review reports and annual environmental management and mitigation report.\n• Resilience – ensure cross cutting resilience strategies are purposefully introduced to ensure the program is implemented in a sustainable way. This includes introducing an increased focus on climate resilience.\n\nSTRATEGY AND VISION\n• Ensure programs are running in alignment with Mercy Corps’ principles, values and the program’s strategic plan, particularly in regard to maintaining a focus on gender equality and social inclusion across the program.\n• Recognize, promote and act on opportunities for innovative action and create an environment where this is regularly encouraged.\n• Set the direction and support the Director – Program Controls in the development of annual, integrated strategic work-plans for the program.\n\nTEAM MANAGEMENT\n• Create and sustain a work environment of mutual respect where accountability is promoted, alternative viewpoints welcomed, the team strives to achieve excellence, and is conducive to professional growth. A key facet of the SWASSA team is to ensure accountability and to build trust; maintaining and strengthening a healthy team culture is essential to this role.\n• Promote a team culture which values ongoing collaboration, learning and adaptation, integrating an increased Resilience approach to program implementation.\n• Supervise the Senior Leadership Team existing of 6 team members from Mercy Corps and partners. Clearly establish and communicate performance expectations and regularly provide constructive feedback via performance reviews with direct supervisees.\n• Strengthen the ownership of the Senior Leadership Team, empowering them to make decisions individually, contribute to strategic discussions and invest in continuous growth.\n• Promote a team culture that values diversity, equity and inclusion and work closely with HR and the Senior Leadership Team to actively promote diversity, equity and inclusion within the SWASSA team composition and leadership structure\n• Contribute to country team-building efforts, help team members identify problem solving options and ensure the integration of all team members into relevant decision-making processes.\n• Work with the Director of Program Controls to implement a workforce development plan, actively managing and promoting professional development and ongoing training of staff to ensure they are of the quality and technical capacity necessary to ensure the successful implementation of activities.\n\nPROGRAM MANAGEMENT\n• Work closely with the Director of Program Controls to ensure oversight and implementation of the highest standard of program management tools. This includes risk management, updated and timely workplans and accurate budgeting.\n• Lead Consortium Management, with the two critical international program partnerships to ensure sound coordination in the context of an overall program strategic and resilience-building framework\n• Provide oversight of all component implementation, including ensuring that each component has a detailed implementation plan aligned and coordinated with others.\n• Supervise and manage all program staff to ensure day-to-day activities are implemented in a coordinated fashion according to schedule, budget and quality.\n• Set direction by prioritizing and organizing actions and resources to achieve objectives.\n• Act as program lead on relevant incident management responses, in coordination with country level leadership, as they arise.\n\nOPERATIONS, FINANCE AND COMPLIANCE MANAGEMENT\n• Ensure Positive coordination with operations, finance and other support departments, ensuring open and transparent communication and coordination between both parties and knowledge and adherence to processes and policies.\n• Ensure effective systems and structures (including finance, logistics, procurement, security, administration and human resources) are implemented to maximize support to field activities whilst ensuring compliance with regulations and policies.\n• Hold ultimate accountability for budgetary oversight and management, whilst building the team’s capacity to understand budgeting and financial management.\n• Promote compliance with USAID regulations, Mercy Corps policies and procedures and ensure all activities are implemented accordingly.\n• Confirm that programs are designed and implemented with a clear analysis and understanding of security management priorities.\n\nCOORDINATION AND REPRESENTATION\n• Primary program representative for USAID and other cooperating sponsors, donors and high-level international stakeholders, including private sector entities, NGOs, public utilities, etc. Responsible for building strong relationships in the sector and ensuring proactive and continuous engagement to promote the program and maintain abreast of sector specific news and events.\n• Support the DCoP – Stakeholder Engagement, in engaging regularly with local government and civil society, Community and Water Sector based partners building a strong reputation for the program and creating support.\n• When required, act as the media spokesperson on behalf of the program, giving interviews, delivering speeches and hosting press conferences under the strict guidance of the Communication team.\n\nSupervisory Responsibility\n\nDeputy Chief of Party – Stakeholder Relationships & Governance; Director – Program Controls; Director – Monitoring, Evaluation, Research and Learning; Environment, Sanitation & Infrastructure Delivery Manager; Market Systems Development Lead (Tetratech), Water Infrastructure Manager (Tetratech).\n\nReports Directly To: Director of Programs\n\nWorks Directly With: Country Director, DRC Program Directors, Deputy Chief of Party, Program Delivery Managers (M&E, Market Service Delivery, Governance, Infrastructure), Heads of Offices, Operations Director, HR/Admin Director, Finance Director and associated Managers.\n\nAccountability to Participants and Stakeholders\n\nMercy Corps team members are expected to support all efforts toward accountability, specifically to our program participants, community partners, other stakeholders, and to international standards guiding international relief and development work. We are committed to actively engaging communities as equal partners in the design, monitoring and evaluation of our field projects.\n\nMinimum Qualification & Transferable Skills\n• MA/MSc in business, program management, financial administration or equivalent.\n• 10 years or more of management experience in increasingly responsible positions – preferably as the lead for a comparable water and sanitation project or senior leadership/management position on a larger project.\n• Experience working with water or electricity utilities, either public or private.\n• Demonstrated ability to build and maintain relationships with host governments, private sector entities, donors, other donor-funded projects and stakeholders, local organizations, and partners.\n• Demonstrated knowledge of and experience with USAID policies, procedures and approaches with regards to design, implementation, budgeting, monitoring and evaluation for projects of a similar size.\n• Exceptional relationship building skills, with demonstrated experience in management of large and cross cultural teams. Must be committed to promoting equality and inclusion throughout their management style.\n• Strong preference will be given to applicants with private sector experience, business acumen and interest in public-private partnerships and contractual agreements (involving interlinked infrastructure and service delivery).\n• Certified in program management or commitment to achieve certification within first 3 months of position.\n• Fluency in oral/written English and French at high intermediate level is required.\n• Previous experience leading programs in a similar context to DRC is strongly desired.\n\nSuccess Factors\n\nThe successful Chief of Party will embody a collaborative and values driven leadership approach, combining exceptional program management and technical skills in commercial market sectors and business model development. S/he should bring experience of building and maintaining robust donor, private sector, government and partner relationships in a challenging context. The successful candidate will have an outstanding ability to ensure technical excellence, whilst holding team members accountable to the highest standards of program management and pushing for continuous adaptation and innovative improvements. S/he will also have proven experience with cross-cultural team and capacity building, individual staff development and strong mentoring skills.\n\nThe CoP must have demonstrated experience managing market sector development in a water or electricity utility (public or private). S/he will have demonstrated skills in managing large scale and challenging programs in volatile and insecure environments. Multi-tasking, prioritizing, problem-solving and simultaneous attention to detail whilst maintaining strategic vision are essential. The most successful Mercy Corps staff members have a strong commitment to teamwork and accountability, thrive in evolving and changing environments and make effective written and verbal communication a priority in all situations.\n\nDue to the nature of this program, and the operating environment, the successful candidate must have a high level of internal resilience.\n\nLiving Conditions / Environmental Conditions\n\nThis position is an accompanied position in Goma (DRC) (based in Gisenyi, Rwanda if accompanied with spouse and/or children). Individual accommodation will be provided according to Mercy Corps DRC housing policy. Goma is a provincial capital of over 900,000 inhabitants. Living in Goma is mostly comfortable, although water and electricity can be unstable. Outside Goma, travel can be dangerous and unpredictable due to armed forces and rebel activity.\n\nMercy Corps’ sub-offices experience variable levels of insecurity, with the situation closely monitored by UN peacekeepers. Air travel is necessary to get from one end of the country to the other. Mobile phones and cellular service are widely available. Internet is available in all Mercy Corps offices. Travel to field sites will be required where living conditions are clean and secure, but basic. There are a number of health services available with evacuation options for serious illnesses. There’s reasonable access to most consumer goods, although they can be expensive.\n\nMercy Corps Team members represent the agency both during and outside of work hours when deployed in a field posting or on a visit/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC’s policies, procedures, and values at all times and in all in-country venues.\n\nFostering a diverse and open workplace is an important part of Mercy Corps’ vision. Mercy Corps is an Equal Opportunity Employer regardless of background. We are committed to creating an inclusive environment.\n\nOngoing Learning\n\nIn support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and/or professional growth and development\n\nDiversity, Equity & Inclusion\n\nAchieving our mission begins with how we build our team and work together. Through our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world’s most complex challenges. We strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.\n\nWe recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.\n\nEqual Employment Opportunity\n\nMercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis. We actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.\n\nWe are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all. We do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.\n\nSafeguarding & Ethics\n\nMercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity. We are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASC and have signed on to the Interagency Misconduct Disclosure Scheme. We will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members. As part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to Mercy Corps Code of Conduct Policies and values at all times. Team members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis.\n\nHow to apply\n\nApply here: https://jobs.jobvite.com/mercycorps/job/oo9nkfwY"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.mercykit.org/",
        "text": "mercykit.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=cg&q=Mercy+Corps&sa=X&ved=0ahUKEwiun_jz7vCCAxUTmokEHbOMCEAQmJACCLIH",
        "text": "Voir les résultats Web pour Mercy Corps"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTa3AfieDDaKpRwXwlPE6a8Cgix5vyPTam1OBhu&s=0",
    "extensions": [
      "À plein temps"
    ],
    "detected_extensions": {
      "schedule_type": "À plein temps"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJDaGllZiBvZiBQYXJ0eSDigJMgVVNBSUTigJlzIFN1c3RhaW5hYmxlIFdhdGVyIGFuZCBTYW5pdGF0aW9uIFN5c3RlbXMgQWN0aXZpdHkiLCJodGlkb2NpZCI6IndTTzFVNXRxR0p6NmpZRGhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJjZyIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVV4UGJuQlpXRGRCU1ZsQlgzVnFkMEZZWlRCMlkxOHRZMjVxY3pkaWVVUnNlbUZJU2xnNE9XeHRkemRaVkhaWmRYbFRlblpqTFdsWVMwc3pZa0pqVFRkVFIyOU9aazFpTjBRemVGRjFNVU4yTkdvNVZWcFNhRTVvVFhkcGRGSkxUbWRNVG5JdGRXcGZkVll5UW1WRWVUaHhXa0pqWVV0TmEwSm1iVXBZZEVwbU9FVXlTbG94ZW5OVldFOFNGMHg2U25KYVpUZE1RVnBQTUhCMFVWQnpOVzFwWjBGUkdpSkJTbmRyTFRoamMwazBSamt3ZDJFeVZWaERhR041WjNoUGNVcG9VVTR0T0hwUiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiUG9zdHVsZXIgc3VyIE1FTkEgSm9icyIsImxpbmsiOiJodHRwczovL21lbmEtam9icy5jb20vam9iL2NoaWVmLW9mLXBhcnR5LXVzYWlkcy1zdXN0YWluYWJsZS13YXRlci1hbmQtc2FuaXRhdGlvbi1zeXN0ZW1zLWFjdGl2aXR5Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  }
]