[
  {
    "title": "Regional Sales Manager - Water treatment - H/F",
    "company_name": "MICHAEL PAGE",
    "location": "  Abidjan   ",
    "via": "via Cadremploi",
    "description": "Quelles sont les missions ?\n\nReporting to the Managing Director, you will be required to carry out the below responsibilities:\n• Develop and implement effective sales strategies to meet and exceed revenue targets in West Africa specifically with (Calcium Hypochlorite, Sodium & Potassium Permanganate)\n• Identify and cultivate new business opportunities, including prospecting potential clients, partners, and emerging markets\n• Prepare and present compelling sales proposals, negotiate contracts, and close deals\n• Stay informed about market trends, competition, and customer needs to drive continuous product improvement and innovation\n• Collaborate closely with cross-functional teams to ensure successful project delivery and implementation\n• Provide accurate sales forecasts and reports to support effective decision-making\n• Willingness to travel within the West African region as required\n\nQuel est le profil idéal ?\n\nYou bring 15 years of working experience as a Regional Sales Manager... within the water treatment industry\nExperience selling Calcium Hypochlorite, Sodium & Potassium Permanganate across West African countries is mandatory\nBachelors degree in Chemical Engineering or a related field is an asset\nStrong knowledge of water treatment technologies with an exposure to selling between 100-500 metric tonnes per month\nExcellent communication in English & French is mandatory\nExperience selling water treatment solutions within the public & private sector is an asset\nFlexibility and willingness to travel within West Africa\n\nQui a publié cette offre ?\n\nOur client is a leading manufacture and distributor of cutting-edge water treatment solutions, dedicated to ensuring access to clean and safe water across West Africa. With a strong commitment to sustainability and innovation, we serve a diverse range of industries in the region. To further our mission and expand our presence, we are seeking a motivated and results-oriented Regional Sales Manager to join our team to cover West Africa",
    "job_highlights": [
      {
        "items": [
          "Quelles sont les missions ?\n\nReporting to the Managing Director, you will be required to carry out the below responsibilities:\n• Develop and implement effective sales strategies to meet and exceed revenue targets in West Africa specifically with (Calcium Hypochlorite, Sodium & Potassium Permanganate)\n• Identify and cultivate new business opportunities, including prospecting potential clients, partners, and emerging markets\n• Prepare and present compelling sales proposals, negotiate contracts, and close deals\n• Stay informed about market trends, competition, and customer needs to drive continuous product improvement and innovation\n• Collaborate closely with cross-functional teams to ensure successful project delivery and implementation\n• Provide accurate sales forecasts and reports to support effective decision-making\n• Willingness to travel within the West African region as required\n\nQuel est le profil idéal ?\n\nYou bring 15 years of working experience as a Regional Sales Manager... within the water treatment industry\nExperience selling Calcium Hypochlorite, Sodium & Potassium Permanganate across West African countries is mandatory\nBachelors degree in Chemical Engineering or a related field is an asset\nStrong knowledge of water treatment technologies with an exposure to selling between 100-500 metric tonnes per month\nExcellent communication in English & French is mandatory\nExperience selling water treatment solutions within the public & private sector is an asset\nFlexibility and willingness to travel within West Africa\n\nQui a publié cette offre ?\n\nOur client is a leading manufacture and distributor of cutting-edge water treatment solutions, dedicated to ensuring access to clean and safe water across West Africa. With a strong commitment to sustainability and innovation, we serve a diverse range of industries in the region. To further our mission and expand our presence, we are seeking a motivated and results-oriented Regional Sales Manager to join our team to cover West Africa"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=ci&q=MICHAEL+PAGE&sa=X&ved=0ahUKEwiq2d6V7_CCAxW7L1kFHX1OAr8QmJACCNMF",
        "text": "See web results for MICHAEL PAGE"
      }
    ],
    "extensions": [
      "4 days ago",
      "€50K a year",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "4 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJSZWdpb25hbCBTYWxlcyBNYW5hZ2VyIC0gV2F0ZXIgdHJlYXRtZW50IC0gSC9GIiwiaHRpZG9jaWQiOiIydndCYUJ1U3BjcVFPYjY4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiY2kiLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6Ii5uRmcyZWJ7Zm9udC13ZWlnaHQ6NTAwfS5CaTZEZGN7Zm9udC13ZWlnaHQ6NTAwfUFwcGx5IGRpcmVjdGx5IG9uIENhZHJlbXBsb2kiLCJsaW5rIjoiaHR0cHM6Ly93d3cuY2FkcmVtcGxvaS5mci9lbXBsb2kvZGV0YWlsX29mZnJlP29mZnJlSWQ9MTU2MzY0MjExMTY0OTU3MDg5XHUwMDI2dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "EVENTS AND MARKETING MANAGER",
    "company_name": "African Water Association (AfWA)",
    "location": "  Abidjan   ",
    "via": "via MENA Jobs",
    "description": "Job title: EVENTS AND MARKETING MANAGER\n\nSupervisor: Director of Membership Services (DMS)\n\nLocation: Abidjan, Cote d’Ivoire\n\nPeriod: Two-year, renewable contract with a three-month probation period\n\n1 HISTORY OF THE AFRICAN WATER ASSOCIATION\n\nThe African Water Association was created in 1980 as a professional membership Institution and was first called the Union of African Water Suppliers (UAWS).\n\nIn 2004, in order to take into account sanitation utilities, as well as regulatory and asset holding companies emerging from institutional reforms of the 90’s in many African countries and the strong will for these new entities to join the Institution, the Union of African Water Suppliers changed name and became the African Water Association (AfWA). The African Water Association covers the whole African Continent and is the unique African Water and Sanitation Organization bringing together water and sanitation operators as well as various sector’s stakeholders.\n\n2 VISION, MISSION AND... STRATEGIC OBJECTIVES\n\nVision\n\nBeing the acknowledged leader in strengthening water utility management practices to support the goals of African Water Vision 2025.\n\nMission\n• Undertake programs and support knowledge sharing in sustainable water management – its science, practice and policy – through professional development, networking and advocacy.\n• Support the members in their efforts to achieve the Millennium Development Goals (MDG) and other near-term targets that have been established for Africa (SDG’s).\n• Advocate for a balanced approach to utility management, based on corporate governance that is commercially sound, financially self-sustaining and environmentally compliant.\n\nMain Strategic Objectives\n• Strengthening the governance and management bodies of the Association\n• Building the capacity of water and sanitation operators in Africa\n• Diversifying partnerships and strengthening synergies\n• Strengthening the visibility of the Association\n\nThe African Water Association (AfWA) is a continental platform that brings together corporates of drinking water production and distribution, corporates managing sanitation services, as well as those that regulate water and sanitation sectorial policies in African countries. Originally, AfWA was created only by and for these actors known as “Active Members”. In 2019, about 39 years after its creation, AfWA is composed of 115 corporate members from 45 African countries.\n\nWhile the AfWA’s Active Members mission vis-à-vis of their customers is to provide quality products and services, they need the expertise and input from the hydraulic equipment and materials from manufacturers and highly qualified consultants, which themselves, also need the Active Members to buy their goods and services so to expand their businesses. A “win-win” exchange platform between the water and sanitation operators and the equipment manufacturers/vendors is hence created and, both parties understood that one cannot prosper without the other. In this scope, AfWA integrated another class of members, known as “Affiliate Members”, and mainly constituted of individuals or group of individuals from all continents, operating in the industry, technology and consultancy in the water, sanitation and hygiene sector. Today, there are 80 Members in this category, mainly from Europe.\n\nAfWA main activities are related to building the capacity of water utilities through seminars, master classes, workshops, technical sessions during its congresses as well as continent-wide, grant-supported programs and projects. Since 2009, AfWA has been entrusted by the UN to develop the Water Operators’ Partnership Concept in the African Continent. This has been done by supporting more than 25 partnerships between utilities under the grants awarded by UNHABITAT, USAID Washington and AfDB/AWF. In parallel to the development of these partnerships, through another USAID Washington grant within FABRI – the “Further Advancing the Blue Revolution Initiative” – AfWA has organized a major capacity building project called “Reducing Non-Revenue Water in sub-Saharan Africa”, involving 21 utilities in 19 African countries. Currently, AfWA is implementing three programs respectively funded by USAID-west Africa office, the Bill and Melinda Gates foundation, and the European Union through the Horizon 2020 initiative. The total budget for these programs is about five (05) millions USD.\n\nFor more information, please visit http://www.afwa-hq.org/index.php/en/\n\nUnder the implementation of its new vision of opening the organization to a broad portfolio of members, AfWA has started the process for a transformational change with particular emphasis on:\n• Mobilizing and attracting new members for AfWA,\n• Mastery the various categories of potential and actual members,\n• Knowledge of the specific needs of members, interested parties and supporters,\n• Follow-up of members and the satisfaction of their needs by offering various services and products,\n• Retaining current members.\n\nThis new dynamic imposes on AfWA a good use of the data on members and other stakeholders in the sector in Africa. With that in mind, the Association is looking to enhance the Membership Services Department with a qualified staff in charge of developing and managing AfWA members and organizing AfWA‘s various events.\n\nThis position is key to sustainably meet the set goals.\n\nScope of work of the Events & Marketing Manager\n\nThe mission of this position is to generate (through digital tools) value propositions for AfWA products and services, taking advantage of values derived from activities to strengthen relationships between the Association and her members and mobilize resources from the products and services offered using appropriate strategies and methodologies.\n\nDetailed tasks:\n\nMission 1: Contribute to developing the new Membership Development Strategy\n\nAs such, the incumbent will:\n• Contribute to developing the Terms of Reference,\n• Identify marketing actions to get onboard new members and strengthen the retention of current members,\n• Ensure that AfWA’s value proposition with related products and services is taken into account in all AfWA actions.\n\nMission 2: With the support of AfWA’s IT Department, design and develop a digital platform to promote exchanges between members\n\nAs such, the incumbent will:\n• Develop Terms of Reference for establishing the platform,\n• Invite members to register on the platform and support them to create a profile,\n• Manage the platform daily through fostering exchanges between various members via the platform,\n• Monitor visits and exchanges on the platform,\n• Produce short reports on the platform use by members and their satisfaction with this service as well.\n\nMission 3: Mobilize commercial resources\n\nAs such, the incumbent will:\n• Identify, follow and get new prospects onboard the Association,\n• Develop in collaboration with the Seniors Coordinators and Director of AfWA Programs, an action plan aiming to attract onboard new members from the base of stakeholders involved in the projects and programs.\n• Support the organization of events, including exhibitions, and leverage them to promote among participants, products and services for members\n• Identify other products as the Organization’s portfolio and actions evolve.\n\nIn addition, the incumbent will support the Exhibitions Manager in:\n• Mobilizing advertising inserts in 03 AfWA NEWS magazines per year,\n• Mobilizing advertising inserts for AfWA Directory and Share Water,\n• Generating funds from AfWA NEWSLETTERS and AfWA Knowledge Management Platform,\n• Mobilizing advertising inserts for the “STC SUMMARY” book.\n\nMission 4: Organize marketing exhibitions around the world and manage AfWA booth during the various international exhibitions\n\nAs such, the incumbent will support the Exhibitions Manager in:\n• Organizing exhibitions, including implementing and monitoring related activities,\n• Coordinating the actions of all partners and service providers involved, including communication and contract management,\n• Communicating with members/exhibitors involved,\n• Developing tools, as well as presentation and information materials.\n\nMission 5: Organize conferences, workshops, and meetings, in line with the activities of the Scientific and Technical Council, the Executive Board and the Executive Office.\n\nAs such, the incumbent will:\n• Coordinate and communicate with all partners and providers involved, including managing contracts for service location, technicians, caterers, graphic designers, hotels etc.,\n• Support, manage and communicate with moderators, speakers, and participants.\n• Ensure the coordination and monitoring of the available budget for the event,\n• Design presentations and information material about the event (event agenda, etc.)\n• Coordinate the program prior to the various event (presentations, workshops, B2B meetings, appointments with institutions, embassies, and government officials)\n\nMission 6: Support Regional Implementing Partners of AfWA activities\n\nAs such, the incumbent will:\n• Provide support to Regional Implementing Partners of AfWA activities in Africa in terms of organizing meetings and events.\n\nMission 7: Database\n\nAs such, the incumbent will work closely with the Database Manager to:\n• Obtain reliable data which can be used for commercial actions\n• Define key aspects to assess a specific work plan to achieve the set objectives and periodically monitor the growth of the membership base.\n\nMission 8: Collection of unpaid advertising inserts, membership fees, and participation fees in exhibitions.\n\nAs such, the incumbent will perform the following as the need arises:\n• Carry out collection operations on inserts in publications (AfWA NEWS, Share Water, AfWA Directory, KMP, etc.) and on membership fees in collaboration with the Accounting Manager,\n• Carry out collection operations on events in collaboration with the Accounting Manager.\n\nMission 9: Manage new memberships\n\nAs such, the incumbent will:\n• Encourage, mobilize, and manage new memberships,\n• Get old members renew their membership,\n• Support the production of AfWA Directory in collaboration with the Communication Department to ensure compliance with AfWA branding.\n\nREQUIRED PROFILE\n\nQualifications\n\nHold a university degree (BAC+4) in Communication, marketing, Information Technology or Statistics, with a minimum of 5 years’ experience in implementing digital marketing activities, managing communities, organizations, and customer relationships.\n\nExperience\n• Sound experience in designing and managing digital platforms for exchanges\n• Monitoring, social media, design, marketing, customer loyalty,\n• Sound experience in database design and administration,\n• Sound experience in web content writing, designing web, mobile and/or client-server applications,\n• Sound experience in events management.\n\nSkills:\n• Perfect ability to work in French and English with a perfect command of one of these two languages,\n• Ability to travel to the field as required by the organization,\n• Ability to work under time pressure and results with initiative, dynamism, and proactivity,\n• Good written and oral expression skills and the ability to formulate ideas clearly and concisely,\n• Open-mindedness and willingness to be adaptable and flexible in dealing with colleagues,\n• Ability to manage complex (internal and external) relationships.\n\nKey competences:\n• Reporting skills\n• Written and oral communication\n• Problem solving\n• Work and time management\n• Organizing and managing knowledge\n• Integrity\n• Internet and computing skills\n• Adaptability and flexibility\n• Teamwork and collaboration\n\nHow to apply\n\nRequired documentation\n• Cover letter\n• Detailed Curriculum vitae in English and/or French\n• Names and contact information of three reference persons.\n\nWhile AfWA is working towards a gender equitable workforce, hence so female candidates are strongly encouraged to apply.\n\nSend your application before 27th November, 2022\n\nto: recrutement@afwa-hq.org\n\nSpecify in the subject line: events and Marketing Manager\n\nOnly shortlisted candidates will be contacted.\n\nAFRICAN WATER ASSOCIATION\n\nRiviera Palmeraie, Rond-point de la Renaissance, Immeuble de la SODECI ; 2e étage – 25 BP 1174 ABIDJAN 25\n\nPhone: (225) 27 22 49 96 11 / (225) 27 22 49 96 13 – Fax (225) 27 22 49 23 30",
    "job_highlights": [
      {
        "items": [
          "Job title: EVENTS AND MARKETING MANAGER\n\nSupervisor: Director of Membership Services (DMS)\n\nLocation: Abidjan, Cote d’Ivoire\n\nPeriod: Two-year, renewable contract with a three-month probation period\n\n1 HISTORY OF THE AFRICAN WATER ASSOCIATION\n\nThe African Water Association was created in 1980 as a professional membership Institution and was first called the Union of African Water Suppliers (UAWS).\n\nIn 2004, in order to take into account sanitation utilities, as well as regulatory and asset holding companies emerging from institutional reforms of the 90’s in many African countries and the strong will for these new entities to join the Institution, the Union of African Water Suppliers changed name and became the African Water Association (AfWA). The African Water Association covers the whole African Continent and is the unique African Water and Sanitation Organization bringing together water and sanitation operators as well as various sector’s stakeholders.\n\n2 VISION, MISSION AND... STRATEGIC OBJECTIVES\n\nVision\n\nBeing the acknowledged leader in strengthening water utility management practices to support the goals of African Water Vision 2025.\n\nMission\n• Undertake programs and support knowledge sharing in sustainable water management – its science, practice and policy – through professional development, networking and advocacy.\n• Support the members in their efforts to achieve the Millennium Development Goals (MDG) and other near-term targets that have been established for Africa (SDG’s).\n• Advocate for a balanced approach to utility management, based on corporate governance that is commercially sound, financially self-sustaining and environmentally compliant.\n\nMain Strategic Objectives\n• Strengthening the governance and management bodies of the Association\n• Building the capacity of water and sanitation operators in Africa\n• Diversifying partnerships and strengthening synergies\n• Strengthening the visibility of the Association\n\nThe African Water Association (AfWA) is a continental platform that brings together corporates of drinking water production and distribution, corporates managing sanitation services, as well as those that regulate water and sanitation sectorial policies in African countries. Originally, AfWA was created only by and for these actors known as “Active Members”. In 2019, about 39 years after its creation, AfWA is composed of 115 corporate members from 45 African countries.\n\nWhile the AfWA’s Active Members mission vis-à-vis of their customers is to provide quality products and services, they need the expertise and input from the hydraulic equipment and materials from manufacturers and highly qualified consultants, which themselves, also need the Active Members to buy their goods and services so to expand their businesses. A “win-win” exchange platform between the water and sanitation operators and the equipment manufacturers/vendors is hence created and, both parties understood that one cannot prosper without the other. In this scope, AfWA integrated another class of members, known as “Affiliate Members”, and mainly constituted of individuals or group of individuals from all continents, operating in the industry, technology and consultancy in the water, sanitation and hygiene sector. Today, there are 80 Members in this category, mainly from Europe.\n\nAfWA main activities are related to building the capacity of water utilities through seminars, master classes, workshops, technical sessions during its congresses as well as continent-wide, grant-supported programs and projects. Since 2009, AfWA has been entrusted by the UN to develop the Water Operators’ Partnership Concept in the African Continent. This has been done by supporting more than 25 partnerships between utilities under the grants awarded by UNHABITAT, USAID Washington and AfDB/AWF. In parallel to the development of these partnerships, through another USAID Washington grant within FABRI – the “Further Advancing the Blue Revolution Initiative” – AfWA has organized a major capacity building project called “Reducing Non-Revenue Water in sub-Saharan Africa”, involving 21 utilities in 19 African countries. Currently, AfWA is implementing three programs respectively funded by USAID-west Africa office, the Bill and Melinda Gates foundation, and the European Union through the Horizon 2020 initiative. The total budget for these programs is about five (05) millions USD.\n\nFor more information, please visit http://www.afwa-hq.org/index.php/en/\n\nUnder the implementation of its new vision of opening the organization to a broad portfolio of members, AfWA has started the process for a transformational change with particular emphasis on:\n• Mobilizing and attracting new members for AfWA,\n• Mastery the various categories of potential and actual members,\n• Knowledge of the specific needs of members, interested parties and supporters,\n• Follow-up of members and the satisfaction of their needs by offering various services and products,\n• Retaining current members.\n\nThis new dynamic imposes on AfWA a good use of the data on members and other stakeholders in the sector in Africa. With that in mind, the Association is looking to enhance the Membership Services Department with a qualified staff in charge of developing and managing AfWA members and organizing AfWA‘s various events.\n\nThis position is key to sustainably meet the set goals.\n\nScope of work of the Events & Marketing Manager\n\nThe mission of this position is to generate (through digital tools) value propositions for AfWA products and services, taking advantage of values derived from activities to strengthen relationships between the Association and her members and mobilize resources from the products and services offered using appropriate strategies and methodologies.\n\nDetailed tasks:\n\nMission 1: Contribute to developing the new Membership Development Strategy\n\nAs such, the incumbent will:\n• Contribute to developing the Terms of Reference,\n• Identify marketing actions to get onboard new members and strengthen the retention of current members,\n• Ensure that AfWA’s value proposition with related products and services is taken into account in all AfWA actions.\n\nMission 2: With the support of AfWA’s IT Department, design and develop a digital platform to promote exchanges between members\n\nAs such, the incumbent will:\n• Develop Terms of Reference for establishing the platform,\n• Invite members to register on the platform and support them to create a profile,\n• Manage the platform daily through fostering exchanges between various members via the platform,\n• Monitor visits and exchanges on the platform,\n• Produce short reports on the platform use by members and their satisfaction with this service as well.\n\nMission 3: Mobilize commercial resources\n\nAs such, the incumbent will:\n• Identify, follow and get new prospects onboard the Association,\n• Develop in collaboration with the Seniors Coordinators and Director of AfWA Programs, an action plan aiming to attract onboard new members from the base of stakeholders involved in the projects and programs.\n• Support the organization of events, including exhibitions, and leverage them to promote among participants, products and services for members\n• Identify other products as the Organization’s portfolio and actions evolve.\n\nIn addition, the incumbent will support the Exhibitions Manager in:\n• Mobilizing advertising inserts in 03 AfWA NEWS magazines per year,\n• Mobilizing advertising inserts for AfWA Directory and Share Water,\n• Generating funds from AfWA NEWSLETTERS and AfWA Knowledge Management Platform,\n• Mobilizing advertising inserts for the “STC SUMMARY” book.\n\nMission 4: Organize marketing exhibitions around the world and manage AfWA booth during the various international exhibitions\n\nAs such, the incumbent will support the Exhibitions Manager in:\n• Organizing exhibitions, including implementing and monitoring related activities,\n• Coordinating the actions of all partners and service providers involved, including communication and contract management,\n• Communicating with members/exhibitors involved,\n• Developing tools, as well as presentation and information materials.\n\nMission 5: Organize conferences, workshops, and meetings, in line with the activities of the Scientific and Technical Council, the Executive Board and the Executive Office.\n\nAs such, the incumbent will:\n• Coordinate and communicate with all partners and providers involved, including managing contracts for service location, technicians, caterers, graphic designers, hotels etc.,\n• Support, manage and communicate with moderators, speakers, and participants.\n• Ensure the coordination and monitoring of the available budget for the event,\n• Design presentations and information material about the event (event agenda, etc.)\n• Coordinate the program prior to the various event (presentations, workshops, B2B meetings, appointments with institutions, embassies, and government officials)\n\nMission 6: Support Regional Implementing Partners of AfWA activities\n\nAs such, the incumbent will:\n• Provide support to Regional Implementing Partners of AfWA activities in Africa in terms of organizing meetings and events.\n\nMission 7: Database\n\nAs such, the incumbent will work closely with the Database Manager to:\n• Obtain reliable data which can be used for commercial actions\n• Define key aspects to assess a specific work plan to achieve the set objectives and periodically monitor the growth of the membership base.\n\nMission 8: Collection of unpaid advertising inserts, membership fees, and participation fees in exhibitions.\n\nAs such, the incumbent will perform the following as the need arises:\n• Carry out collection operations on inserts in publications (AfWA NEWS, Share Water, AfWA Directory, KMP, etc.) and on membership fees in collaboration with the Accounting Manager,\n• Carry out collection operations on events in collaboration with the Accounting Manager.\n\nMission 9: Manage new memberships\n\nAs such, the incumbent will:\n• Encourage, mobilize, and manage new memberships,\n• Get old members renew their membership,\n• Support the production of AfWA Directory in collaboration with the Communication Department to ensure compliance with AfWA branding.\n\nREQUIRED PROFILE\n\nQualifications\n\nHold a university degree (BAC+4) in Communication, marketing, Information Technology or Statistics, with a minimum of 5 years’ experience in implementing digital marketing activities, managing communities, organizations, and customer relationships.\n\nExperience\n• Sound experience in designing and managing digital platforms for exchanges\n• Monitoring, social media, design, marketing, customer loyalty,\n• Sound experience in database design and administration,\n• Sound experience in web content writing, designing web, mobile and/or client-server applications,\n• Sound experience in events management.\n\nSkills:\n• Perfect ability to work in French and English with a perfect command of one of these two languages,\n• Ability to travel to the field as required by the organization,\n• Ability to work under time pressure and results with initiative, dynamism, and proactivity,\n• Good written and oral expression skills and the ability to formulate ideas clearly and concisely,\n• Open-mindedness and willingness to be adaptable and flexible in dealing with colleagues,\n• Ability to manage complex (internal and external) relationships.\n\nKey competences:\n• Reporting skills\n• Written and oral communication\n• Problem solving\n• Work and time management\n• Organizing and managing knowledge\n• Integrity\n• Internet and computing skills\n• Adaptability and flexibility\n• Teamwork and collaboration\n\nHow to apply\n\nRequired documentation\n• Cover letter\n• Detailed Curriculum vitae in English and/or French\n• Names and contact information of three reference persons.\n\nWhile AfWA is working towards a gender equitable workforce, hence so female candidates are strongly encouraged to apply.\n\nSend your application before 27th November, 2022\n\nto: recrutement@afwa-hq.org\n\nSpecify in the subject line: events and Marketing Manager\n\nOnly shortlisted candidates will be contacted.\n\nAFRICAN WATER ASSOCIATION\n\nRiviera Palmeraie, Rond-point de la Renaissance, Immeuble de la SODECI ; 2e étage – 25 BP 1174 ABIDJAN 25\n\nPhone: (225) 27 22 49 96 11 / (225) 27 22 49 96 13 – Fax (225) 27 22 49 23 30"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.afwa-hq.org/index.php/en/",
        "text": "afwa-hq.org/index.php/en"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=ci&q=African+Water+Association+(AfWA)&sa=X&ved=0ahUKEwiq2d6V7_CCAxW7L1kFHX1OAr8QmJACCIUG",
        "text": "See web results for African Water Association (AfWA)"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRFDARDjF5NJwNub8MEQsak8y3DinE2-apbQZp7&s=0",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJFVkVOVFMgQU5EIE1BUktFVElORyBNQU5BR0VSIiwiaHRpZG9jaWQiOiJIU2l6VzBxU3A2YjBUU1pNQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiY2kiLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVeFBibkJaVm05UFpuRkZWMlJ0TUROT1RtNUtVRko2YjFSemNrazBaVlJyVTBwMlFWbElZMFZQTkVRM1VUWlBSM2xVYlU5UlowcEZTSGxTUzE5MVVVMWFTM2hvV1dKa1EwVjRSV0pRTlZCWVVWSkJVV0ZrYTFadFRsVnZSMFZDUVVWbldqWnlka0pLVWpKUmFqTlhaek40U1hsaGEzSlFaM1phU1hOMlEyeDNNMjFCVlY5TlRtZzRUbWhtZG1wMGJXdERSWGRRZDI1WGVWSnlSa2t5ZEROSmNITkVkSEJIV21KdU56Z3pZVU42Y1VWTU0yMXRaVUo1Wkc1aVlqWnFNM2syYW05VFJWRkZhVGt3YVhGdVMzUTFYMmRaYnpCNU1YZFlWVzVsTm1SRFVSSVhaRlJLY2xwbGNrdE9OM1ptTlU1dlVGOWFlVW90UVhNYUlrRktkMnN0T0dWM2VuSlNOMUJZU1RsaFJsZDJaM1JGUWtwS2FIVm1TbXd6Y1ZFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBNRU5BIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly9tZW5hLWpvYnMuY29tL2pvYi9ldmVudHMtYW5kLW1hcmtldGluZy1tYW5hZ2VyLTIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  }
]