[
  {
    "title": "ROWPU Operator",
    "company_name": "KBR",
    "location": "  Djibouti   ",
    "via": "via KBR Careers",
    "description": "Title:\nROWPU Operator\n\nIn compliance with the U.S. federal government’s vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position.\n\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\nROWPU Operater\n\nControls treatment plant machines and equipment to purify and clarify water for human consumption and for industrial use. Operates and controls electric motors, pumps and valves to regulate flow of water into treating plant. Dumps specified amounts of chemicals into water or adjust automatic devices that admit specified amounts of chemicals into tanks to... disinfect, deodorize, and clarify water. Turns valves to regulate water through filter beds to remove impurities. Pumps purified water into water mains. Monitors panel board and adjusts controls to regulate flow rates and distribution of water. Cleans tanks and filter beds. Repairs and lubricates machines and equipment. Tests water samples. Records data such as residual content of chemicals and water pressure",
    "job_highlights": [
      {
        "items": [
          "Title:\nROWPU Operator\n\nIn compliance with the U.S. federal government’s vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position.\n\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\nROWPU Operater\n\nControls treatment plant machines and equipment to purify and clarify water for human consumption and for industrial use. Operates and controls electric motors, pumps and valves to regulate flow of water into treating plant. Dumps specified amounts of chemicals into water or adjust automatic devices that admit specified amounts of chemicals into tanks to... disinfect, deodorize, and clarify water. Turns valves to regulate water through filter beds to remove impurities. Pumps purified water into water mains. Monitors panel board and adjusts controls to regulate flow rates and distribution of water. Cleans tanks and filter beds. Repairs and lubricates machines and equipment. Tests water samples. Records data such as residual content of chemicals and water pressure"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.kbr.com/",
        "text": "kbr.com"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=dj&q=KBR&sa=X&ved=0ahUKEwiM_ciX7_CCAxUREkQIHdGABr0QmJACCPcG",
        "text": "See web results for KBR"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ1X47VULhutVMDESqfKjJ6BNz_gQDusTKjpHD3&s=0",
    "extensions": [
      "4 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "4 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJST1dQVSBPcGVyYXRvciIsImh0aWRvY2lkIjoiNG0xcXdUMFJwdC1mWnV1VEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6ImRqIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVXhQYm5CWlZXVkVNVEZrWWsxak5rczRUVGR1WjNKTUxVa3dhRFpOTld4SU1WVjBkWGxVZDBGMWFGUk5TV2hoUVdSNmIxQllhbDl4VDFaQlgzWTBPVFpDYVhGWFNYUkZjSGxGYkRoaldFNXBha3BuYzBwWkxVZGZjVjlFYlZabWNsbHVZMXBmU0VkRmJYSkdaSFJKTkVoRlZHWkxVM2h6YWtoNFRuRkRWWGN6ZDBKdVIyUnZlRXRFTTFFU0YyVlVTbkphWTNwalRGcEhhMnRRU1ZBd1dVZGhOa0Z6R2lKQlNuZHJMVGhqVmxCTVJXNDJXamRxYjJjdGVEVnBiMVJ1YUd4d1UxTkZhbEIzIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiIubkZnMmVie2ZvbnQtd2VpZ2h0OjUwMH0uQmk2RGRje2ZvbnQtd2VpZ2h0OjUwMH1BcHBseSBvbiBLQlIgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2NhcmVlcnMua2JyLmNvbS91cy9lbi9qb2IvUjIwNjk1ODkvUk9XUFUtT3BlcmF0b3I/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "DJBOSS:  ROWPU Supervisor",
    "company_name": "KBR",
    "location": "  Djibouti   ",
    "via": "via KBR Careers",
    "description": "Title:\nDJBOSS: ROWPU Supervisor\n\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\nROWPU Supervisor\n\nResponsible for Supervising Water Plant and/or Water Purification group(s). Assists in leading the creation of organization structure and processes required to fully execute the requirements of services and has responsibility for the execution of Water Purification services, quality performance, equipment operation and cost. Responsible for the execution and compliance of water standard testing, water sampling, maintaining logs and equipment reading(s). Advises the Manager on issues, impacts, risks.\n\nAdditional requirements:\n• A water purification certificate of at... the minimum Class 2 certification and preferably Class 3 for production from a recognized authority (State, Government or Independent testing facility such as ABC).\n• A water purification certificate of at the minimum Class 1 certification and preferably Class 2 for distribution from a recognized authority (State, Government or Independent testing facility such as ABC)\n• Able to show past experience in submitting written reports to Management as they will be the lead on site and have a reporting requirement to KBR and the Government.\n• Documented Mechanical and Electrical experience in trouble shooting ROWPU systems.\n• Responsible for ensuring that all ROWPU laboratory personnel have demonstrated proficiency for their assigned functions and that all data reported by the laboratory meet the required QA criteria and regulatory requirements.\n• Experience With Microsoft Outlook, Excel, Power point, Word\n• 10 + years of experience with Water Production\n• Must be fluent in English.\n• Must possess passport book (not passport card) with at least 12 months of remaining validity AND with at least 4 blank visa/stamp pages remaining.\n• Must possess driver’s license with at least 6 months of remaining validity.\n\nIn compliance with the U.S. federal government’s vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position",
    "job_highlights": [
      {
        "items": [
          "Title:\nDJBOSS: ROWPU Supervisor\n\nKBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.\n\nROWPU Supervisor\n\nResponsible for Supervising Water Plant and/or Water Purification group(s). Assists in leading the creation of organization structure and processes required to fully execute the requirements of services and has responsibility for the execution of Water Purification services, quality performance, equipment operation and cost. Responsible for the execution and compliance of water standard testing, water sampling, maintaining logs and equipment reading(s). Advises the Manager on issues, impacts, risks.\n\nAdditional requirements:\n• A water purification certificate of at... the minimum Class 2 certification and preferably Class 3 for production from a recognized authority (State, Government or Independent testing facility such as ABC).\n• A water purification certificate of at the minimum Class 1 certification and preferably Class 2 for distribution from a recognized authority (State, Government or Independent testing facility such as ABC)\n• Able to show past experience in submitting written reports to Management as they will be the lead on site and have a reporting requirement to KBR and the Government.\n• Documented Mechanical and Electrical experience in trouble shooting ROWPU systems.\n• Responsible for ensuring that all ROWPU laboratory personnel have demonstrated proficiency for their assigned functions and that all data reported by the laboratory meet the required QA criteria and regulatory requirements.\n• Experience With Microsoft Outlook, Excel, Power point, Word\n• 10 + years of experience with Water Production\n• Must be fluent in English.\n• Must possess passport book (not passport card) with at least 12 months of remaining validity AND with at least 4 blank visa/stamp pages remaining.\n• Must possess driver’s license with at least 6 months of remaining validity.\n\nIn compliance with the U.S. federal government’s vaccine mandate, only candidates who are fully vaccinated for COVID-19 or have a reasonable accommodation or approved medical exception will be considered for this position"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.kbr.com/",
        "text": "kbr.com"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=dj&q=KBR&sa=X&ved=0ahUKEwiM_ciX7_CCAxUREkQIHdGABr0QmJACCKsH",
        "text": "See web results for KBR"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ1X47VULhutVMDESqfKjJ6BNz_gQDusTKjpHD3&s=0",
    "extensions": [
      "4 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "4 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJESkJPU1M6ICBST1dQVSBTdXBlcnZpc29yIiwiaHRpZG9jaWQiOiIxSEhwelV4Z3VYZVY0LUFuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiZGoiLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVeFBibkJaV0VwRFIwWTJMV2xLZUVodmJFcDRhbXBSV2pWWVNWaFhia294YTI1VWIyaEdkMk5yY0ZjMWVFVjNhRnBITXpaaGVXOUdVRmhrVEhrNWFtaHVaVEJTVm0wNE1GSXpURkJuYmswMGQzbEtkbGRuWm5wNVlsRTJPR2hST1d0NVMyMVJaRTEwWVRoQ1pIWklXVEZTWjNZd2RXOXVkRmMyTUMwM2JsTm9YMUpzWVdGMFNuUkZRMFVTRjJWVVNuSmFZM3BqVEZwSGEydFFTVkF3V1VkaE5rRnpHaUpCU25kckxUaG1lV2xTWm1KUWJqTnBiakJCWlc5NE56azFkMHBvWm1wTVVEaEIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEtCUiBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5rYnIuY29tL3VzL2VuL2pvYi9SMjA3OTI1Ny9ESkJPU1MtUk9XUFUtU3VwZXJ2aXNvcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "National Consultant – Technical Expert to support the development...",
    "company_name": "United Nations Development Programme (UNDP)",
    "location": "  Djibouti   ",
    "via": "via Best Jobs In Djibouti",
    "description": "Background\n\nBACKGROUND AND PROJECT DESCRIPTION\n\nClimate model predictions indicate that the Horn of Africa will experience increased rainfall variability and extreme events threatening the population residing in the region and leading to the destruction of hydraulic infrastructure, roads, and property in rural areas including agro-pastoral land.\n\nThis is particularly visible in the country of Djibouti where highly variable precipitation and dry periods are predicted to be less prolonged but more frequent than those that have marked Djibouti over the past decade.\n\nWithout adequate and rapid interventions to reduce the vulnerability of the country to climate change, the water resources and agriculture sectors will be exposed to substantial adverse biophysical and socio-economic impacts.\n\nClimate change is expected to significantly contribute to increasing food insecurity in the country. Djibouti’s rural population, which includes a large pastoralist population, is particularly at risk... from increasing aridification and water shortages as they mainly reside in deserts or marginal lands, often with highly erodible soils and limited water supply. In remote areas in the northwest and central parts of the country, increasingly recurrent droughts in the winter season have already led to reduced pasture areas.\n\nIn response to a government request for assistance, and in line with Djibouti’s priorities outlined in the INDC, the United Nations Development Programme (UNDP) is supporting the Government of Djibouti in the formulation of an integrated programme titled “Djibouti Climate Resilience and Livelihoods Programme”, expected to be financed through multiple sources including, Global Environment Facility (GEF), Green Climate Fund (GCF), bilateral donors, International Finance Institutions (IFIs), philanthropic organisations and private sector investment.\n\nThe programme aims to build the country’s resilience to the impacts of climate change targeting key thematic areas: Energy and Water.\n\nWorking on Climate-Water-Energy nexus will help to address complex and interlinked challenges. Adaptation in these thematic areas will be further supported through the availability, provision and strengthening of relevant climate and environmental information both for early warning and adaptation.\n\nThe energy component that aims to close the remaining energy access gap in the country, links closely to the agriculture and water management component that focuses on strengthening food security through food innovation, adaptive agriculture and sustainable irrigation.\n\nThe final component on Climate Information aims at bridging the different components with reliable and forward-looking data by strengthening the forecasting information system and early warning systems for climate change adaptation.\n\nDuties and Responsibilities\n\nGENERAL OBJECTIVES\n\nThe objective of this consultancy is to work with the team leaders of the Programme, Government of Djibouti and other stakeholders, to support the development of a Project Identification Form (PIF) and a concept note that would be eligible for funding by the Global Environment Facility and Green Climate Fund (GCF) that targets the Water Management component of the Djibouti Climate Resilience and Livelihoods Programme.\n\nKeeping in line with the integrated programmatic framework of UNDP the consultant will work in close collaboration with the teams leading the other components of the Programme.\n\nThe UNDP Country Office (CO) and the Regional Technical Advisors (RTA) will provide guidance and oversight to the overall process.\n\nSPECIFIC OBJECTIVES AND METHOLOGY\n\nIn the context of the overall integrated “Djibouti Climate Resilience and Livelihoods Programme”, the consultant, working under the guidance and oversight of UNDP staff, will support the development of Project Identification Forms (PIF) and concept note for projects focusing on strengthening Djibouti’s food security through (i) food innovation, adaptative agriculture and (ii) sustainable irrigation (exploring solar pumps systems).\n\nThe consultant will be expected to undertake the following:\n\nConduct a desk review\n\nWith support from UNDP and other stakeholders for the gathering of relevant documentations, s/he will:\n• Align with the vision used in materials developed for other projects in the programme (Pre-investment screening Committee (PISC) documents, PIF/Concept Notes, Baseline Reports, etc.).\n• Review other assessments (National plans, relevant National legislations, evaluations and reports from past projects (including from other UN Agencies and other multilateral and bilateral donors etc) and prepare a synopsis of the key and relevant findings and brief the International expert when the documentation is only available in French.\n\nCoordinate with relevant teams and ensure an integrated approach\n• Together with the lead consultant in charge of drafting the PIF, coordinate with the teams working on other components of the Djibouti Climate Resilience and Livelihoods Programme to ensure the approach adopted is integrated and coherent approach. This will include the sharing of information gathered during previous missions, outcomes of the discussions with partners or other stakeholders.\n\nConduct consultations\n• Contribute to the identification and support liaising with key stakeholders (relevant government agencies at the national and regional levels, UN agencies, NGOs, CSOs, private sector, etc.) to be involved in the formulation and implementation of the project or build up on existing initiatives.\n• Develop a 4W (who, what, where and when) Stakeholder Map\n• Support the identification of potential co-financing options, to be confirmed during the in-depth design phase.\n• Prepare a consultation report, with a preliminary outline of the project focus, including proposed objectives, scope and strategies.\n\nSpecific support to consultant with the development of UNDP Project Documents (for a GCF and GEF FSP Approval Process)\n• Support the definition of the situational analysis including the baseline scenario of and barriers to the projects;\n• Support the development of the problem and sketching of the intervention strategy;\n• Support the identification of several possible scenarios for intervention and identification of the most cost-effective approach within the GCF and GEF strategic objective;\n• Provide help in addressing comments from the different stakeholders (Government, UNDP, GEF);\n• Contribute to the initial Social and Environmental Safeguards prescreening.\n• The deliverables should be in French and English, the consultant should provide support to the International expert for French translation.\n\nFINAL RODUCTS\n\nThe consultant is expected to support the International expert to produce the following:\n• Situation Analysis and Baseline Report to establish baseline, identify indicators and set the target for each indicator\n• 4W Stakeholder Map, including the existing and pipeline projects/programs which can be potential sources of co-financing for the UNDP project\n• Detailed methodology and work plan\n• Draft logical framework of the project in collaboration with the international consultant\n• Draft PIF document in collaboration with international consultant\n\nPROVISION OF MONITORING AND PROCESS CONTROLS\n\nThe consultant will be supervised by UNDP Country Office.\n\nThe Consultant will be responsible for providing her/his own working station (i.e., laptop, internet, phone, scanner/printer, etc.) and must have access to a reliable internet connection, during the assignment (the cost of these facilities should be included in the financial proposals, if required);\n\nPayment will be made upon satisfactory achieved deliverables under each assignment and submission of time sheet in accordance with number of days worked. All payments are subject to the clearance and approval of the supervisor. Final payment shall require a signed performance evaluation of the consultant.\n\nDURATION OF ASSIGNEMENT AND DUTY STATION\n\nContract duration: the contract will be signed for a duration of 30 days\n\nCompetencies\n\nCorporate Competencies:\n• Demonstrates integrity by modelling the UN’s values and ethical standards;\n• Promotes the vision, mission, and strategic goals of UNDP;\n• Displays cultural, gender, religion, race, nationality and age sensitivity and adaptability;\n• Treats all people fairly without favoritism;\n• Fulfils all obligations to gender sensitivity and zero tolerance for sexual harassment.\n\nLanguage:\n\nFluency in English and French both written and oral.\n\nRequired Skills and Experience\n\nEXPERT PROFILE\n\nEducation:\n\nMaster’s Degree in the fields of Engineering, Environmental Science, Climate Change, Agriculture or Water Resources Management or any other relevant disciplines.\n\nExperience:\n• At least 5 years of professional experience, of which at least 1 years are in supporting/drafting UNDP/GEF project documents;\n• Extensive conceptual and practical knowledge of UNDP/GEF operating and strategic principles, especially as related to Land Degradation and Climate Change Adaptation;\n• Proven working experience on projects related to water management and agriculture, ideally in Least Developed Countries and/or African states contexts;\n• Proven experience of conducting similar nature of assignment in the past preferably for International Organizations /UN organizations;\n• Experience of working and collaborating with stakeholders including governments; civil society; private sector; local communities;\n• Good inter-personal communication skills, flexibility;\n• Excellent report writing skills; and\n• Proven capability to meet short deadlines and work under pressure.\n\nEVALUATION\n\nIndividual consultants will be evaluated based on a cumulative analysis:\n\nWhen using this weighted scoring method, contract award shall be made to the individual consultant whose bid has been superseded and may be made as:\n\na. Compliant/acceptable,\n\nb. having received the highest score among a characterized set of weighted technical and financial criteria specific to the solicitation.\n• Weight of technical criteria: 70\n• Weight of financial criteria: 30\n\nOnly applicants with a minimum of 50 points will be considered for financial evaluation.\n\nCriteria\n\nPoints\n\nMax. Point\n\nTechnique\n• Years of Experience and specific experience in drafting UNDP/GEF project documents;\n• Conceptual and practical knowledge of UNDP/GEF operating and strategic principles;\n• Proven working experience in the field of water management and agriculture experience collaborating with stakeholders including governments, civil society and communities.\n\nPlease click on the button below to Apply",
    "job_highlights": [
      {
        "items": [
          "Background\n\nBACKGROUND AND PROJECT DESCRIPTION\n\nClimate model predictions indicate that the Horn of Africa will experience increased rainfall variability and extreme events threatening the population residing in the region and leading to the destruction of hydraulic infrastructure, roads, and property in rural areas including agro-pastoral land.\n\nThis is particularly visible in the country of Djibouti where highly variable precipitation and dry periods are predicted to be less prolonged but more frequent than those that have marked Djibouti over the past decade.\n\nWithout adequate and rapid interventions to reduce the vulnerability of the country to climate change, the water resources and agriculture sectors will be exposed to substantial adverse biophysical and socio-economic impacts.\n\nClimate change is expected to significantly contribute to increasing food insecurity in the country. Djibouti’s rural population, which includes a large pastoralist population, is particularly at risk... from increasing aridification and water shortages as they mainly reside in deserts or marginal lands, often with highly erodible soils and limited water supply. In remote areas in the northwest and central parts of the country, increasingly recurrent droughts in the winter season have already led to reduced pasture areas.\n\nIn response to a government request for assistance, and in line with Djibouti’s priorities outlined in the INDC, the United Nations Development Programme (UNDP) is supporting the Government of Djibouti in the formulation of an integrated programme titled “Djibouti Climate Resilience and Livelihoods Programme”, expected to be financed through multiple sources including, Global Environment Facility (GEF), Green Climate Fund (GCF), bilateral donors, International Finance Institutions (IFIs), philanthropic organisations and private sector investment.\n\nThe programme aims to build the country’s resilience to the impacts of climate change targeting key thematic areas: Energy and Water.\n\nWorking on Climate-Water-Energy nexus will help to address complex and interlinked challenges. Adaptation in these thematic areas will be further supported through the availability, provision and strengthening of relevant climate and environmental information both for early warning and adaptation.\n\nThe energy component that aims to close the remaining energy access gap in the country, links closely to the agriculture and water management component that focuses on strengthening food security through food innovation, adaptive agriculture and sustainable irrigation.\n\nThe final component on Climate Information aims at bridging the different components with reliable and forward-looking data by strengthening the forecasting information system and early warning systems for climate change adaptation.\n\nDuties and Responsibilities\n\nGENERAL OBJECTIVES\n\nThe objective of this consultancy is to work with the team leaders of the Programme, Government of Djibouti and other stakeholders, to support the development of a Project Identification Form (PIF) and a concept note that would be eligible for funding by the Global Environment Facility and Green Climate Fund (GCF) that targets the Water Management component of the Djibouti Climate Resilience and Livelihoods Programme.\n\nKeeping in line with the integrated programmatic framework of UNDP the consultant will work in close collaboration with the teams leading the other components of the Programme.\n\nThe UNDP Country Office (CO) and the Regional Technical Advisors (RTA) will provide guidance and oversight to the overall process.\n\nSPECIFIC OBJECTIVES AND METHOLOGY\n\nIn the context of the overall integrated “Djibouti Climate Resilience and Livelihoods Programme”, the consultant, working under the guidance and oversight of UNDP staff, will support the development of Project Identification Forms (PIF) and concept note for projects focusing on strengthening Djibouti’s food security through (i) food innovation, adaptative agriculture and (ii) sustainable irrigation (exploring solar pumps systems).\n\nThe consultant will be expected to undertake the following:\n\nConduct a desk review\n\nWith support from UNDP and other stakeholders for the gathering of relevant documentations, s/he will:\n• Align with the vision used in materials developed for other projects in the programme (Pre-investment screening Committee (PISC) documents, PIF/Concept Notes, Baseline Reports, etc.).\n• Review other assessments (National plans, relevant National legislations, evaluations and reports from past projects (including from other UN Agencies and other multilateral and bilateral donors etc) and prepare a synopsis of the key and relevant findings and brief the International expert when the documentation is only available in French.\n\nCoordinate with relevant teams and ensure an integrated approach\n• Together with the lead consultant in charge of drafting the PIF, coordinate with the teams working on other components of the Djibouti Climate Resilience and Livelihoods Programme to ensure the approach adopted is integrated and coherent approach. This will include the sharing of information gathered during previous missions, outcomes of the discussions with partners or other stakeholders.\n\nConduct consultations\n• Contribute to the identification and support liaising with key stakeholders (relevant government agencies at the national and regional levels, UN agencies, NGOs, CSOs, private sector, etc.) to be involved in the formulation and implementation of the project or build up on existing initiatives.\n• Develop a 4W (who, what, where and when) Stakeholder Map\n• Support the identification of potential co-financing options, to be confirmed during the in-depth design phase.\n• Prepare a consultation report, with a preliminary outline of the project focus, including proposed objectives, scope and strategies.\n\nSpecific support to consultant with the development of UNDP Project Documents (for a GCF and GEF FSP Approval Process)\n• Support the definition of the situational analysis including the baseline scenario of and barriers to the projects;\n• Support the development of the problem and sketching of the intervention strategy;\n• Support the identification of several possible scenarios for intervention and identification of the most cost-effective approach within the GCF and GEF strategic objective;\n• Provide help in addressing comments from the different stakeholders (Government, UNDP, GEF);\n• Contribute to the initial Social and Environmental Safeguards prescreening.\n• The deliverables should be in French and English, the consultant should provide support to the International expert for French translation.\n\nFINAL RODUCTS\n\nThe consultant is expected to support the International expert to produce the following:\n• Situation Analysis and Baseline Report to establish baseline, identify indicators and set the target for each indicator\n• 4W Stakeholder Map, including the existing and pipeline projects/programs which can be potential sources of co-financing for the UNDP project\n• Detailed methodology and work plan\n• Draft logical framework of the project in collaboration with the international consultant\n• Draft PIF document in collaboration with international consultant\n\nPROVISION OF MONITORING AND PROCESS CONTROLS\n\nThe consultant will be supervised by UNDP Country Office.\n\nThe Consultant will be responsible for providing her/his own working station (i.e., laptop, internet, phone, scanner/printer, etc.) and must have access to a reliable internet connection, during the assignment (the cost of these facilities should be included in the financial proposals, if required);\n\nPayment will be made upon satisfactory achieved deliverables under each assignment and submission of time sheet in accordance with number of days worked. All payments are subject to the clearance and approval of the supervisor. Final payment shall require a signed performance evaluation of the consultant.\n\nDURATION OF ASSIGNEMENT AND DUTY STATION\n\nContract duration: the contract will be signed for a duration of 30 days\n\nCompetencies\n\nCorporate Competencies:\n• Demonstrates integrity by modelling the UN’s values and ethical standards;\n• Promotes the vision, mission, and strategic goals of UNDP;\n• Displays cultural, gender, religion, race, nationality and age sensitivity and adaptability;\n• Treats all people fairly without favoritism;\n• Fulfils all obligations to gender sensitivity and zero tolerance for sexual harassment.\n\nLanguage:\n\nFluency in English and French both written and oral.\n\nRequired Skills and Experience\n\nEXPERT PROFILE\n\nEducation:\n\nMaster’s Degree in the fields of Engineering, Environmental Science, Climate Change, Agriculture or Water Resources Management or any other relevant disciplines.\n\nExperience:\n• At least 5 years of professional experience, of which at least 1 years are in supporting/drafting UNDP/GEF project documents;\n• Extensive conceptual and practical knowledge of UNDP/GEF operating and strategic principles, especially as related to Land Degradation and Climate Change Adaptation;\n• Proven working experience on projects related to water management and agriculture, ideally in Least Developed Countries and/or African states contexts;\n• Proven experience of conducting similar nature of assignment in the past preferably for International Organizations /UN organizations;\n• Experience of working and collaborating with stakeholders including governments; civil society; private sector; local communities;\n• Good inter-personal communication skills, flexibility;\n• Excellent report writing skills; and\n• Proven capability to meet short deadlines and work under pressure.\n\nEVALUATION\n\nIndividual consultants will be evaluated based on a cumulative analysis:\n\nWhen using this weighted scoring method, contract award shall be made to the individual consultant whose bid has been superseded and may be made as:\n\na. Compliant/acceptable,\n\nb. having received the highest score among a characterized set of weighted technical and financial criteria specific to the solicitation.\n• Weight of technical criteria: 70\n• Weight of financial criteria: 30\n\nOnly applicants with a minimum of 50 points will be considered for financial evaluation.\n\nCriteria\n\nPoints\n\nMax. Point\n\nTechnique\n• Years of Experience and specific experience in drafting UNDP/GEF project documents;\n• Conceptual and practical knowledge of UNDP/GEF operating and strategic principles;\n• Proven working experience in the field of water management and agriculture experience collaborating with stakeholders including governments, civil society and communities.\n\nPlease click on the button below to Apply"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.undp.org/",
        "text": "undp.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=dj&q=United+Nations+Development+Programme+(UNDP)&sa=X&ved=0ahUKEwiM_ciX7_CCAxUREkQIHdGABr0QmJACCNsH",
        "text": "See web results for United Nations Development Programme (UNDP)"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJOYXRpb25hbCBDb25zdWx0YW50IOKAkyBUZWNobmljYWwgRXhwZXJ0IHRvIHN1cHBvcnQgdGhlIGRldmVsb3BtZW50IG9mIGNvbmNlcHQgbm90ZXMgb24gV2F0ZXIgbWFuYWdlbWVudCBWYWNhbmN5IOKAkyBKb2IgUmVmOiBWQUNVTkRQLzM3NjAvMTEiLCJodGlkb2NpZCI6IjhnMFhJZWFJeGZZbGJIQ0FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJkaiIsImhsIjoiZW4iLCJmYyI6IkVyY0NDdmNCUVV4UGJuQlpWVFJCUTB4UFpFaHpPVlZMVVhwWmIxQlROa1prZVVjdFVtc3dSblJPZUVaQmVEWnhXVTEzTWpjemFXcGhVV3c0VFhGdk1tZEZNVXhPYkZsWWJXTklPVUY1TVZsS1FVSjBjVUpCVDJrdGFGcDJiVzF6UkdSNVRYUXRTVzluVW5oQmVUVnhOMWh1Ym5wdmFGazVNV055UWtOQk1GRmpNbHBuVFhFM1JWUnVZVTAyTTNJNFJVTjFlRGR1YkVWUE5HMVZkRGhrTW5GTFRGZDNjSFE1WWtGd1ZUVjJablpPZUc5VmVtdHBlVkJpT1VkS2EyeFFRek53YzFjelUyRlFhWFpWYXkxMExTMXdibVJJZEdWeFpqSkpOV1JuUlhVMFRYQm1kRkIyYW5WR2VHOTZhbGxFYzFSZmFYbG9kbHA0ZG5KSFZSSVhaVlJLY2xwamVtTk1Xa2RyYTFCSlVEQlpSMkUyUVhNYUlrRktkMnN0T0dWb1pHSm1RMjQ1UXpWUVgyb3hZMnBmVmxCTk1XUmFiV0pXV25jIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBCZXN0IEpvYnMgSW4gRGppYm91dGkiLCJsaW5rIjoiaHR0cHM6Ly9kai5qb2JzYWppcmEuY29tL2pvYi9uYXRpb25hbC1jb25zdWx0YW50LXRlY2huaWNhbC1leHBlcnQtdG8tc3VwcG9ydC10aGUtZGV2ZWxvcG1lbnQtb2YtY29uY2VwdC1ub3Rlcy1vbi13YXRlci1tYW5hZ2VtZW50LXZhY2FuY3ktam9iLXJlZi12YWN1bmRwLTM3NjAtMTAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  }
]