[
  {
    "title": "WASH Specialist",
    "company_name": "Living Water International (LWI)",
    "location": "  Freetown   ",
    "via": "via Find Jobs Sierra Leone",
    "description": "Living Water International (LWI) is a global non-governmental organization that exists to demonstrate the love of God by helping communities acquire desperately needed clean water, and to experience “living water” the Gospel of Jesus Christ which alone satisfies the deepest thirst. Living Water in Africa is providing safe drinking water, Christian Witness sanitation and health education to communities, across Africa. Living Water International, Sierra leone based in lungi for the time being but will be in Freetown January 2014, has a vacancy tor an experienced and qualified Sierra Leonean to apply for the position ‘WASH Specialist.’This will report to the Operations Director.\n\nWash Specialist\n\nResponsibilities\n\nProvide support to the country director and operations director in the area of WASH (Water Sanitation Hygiene).\n\nProvide technical adviseto implementers of project/programs.\n\nOversee training of community members in proper health, sanitation, hygiene practices with emphasis on... positive behaviour change.Conduct base-line surveys.\n\nPresent an action plan to correct past projects to the Operation Director and for review and planning to achieve desired outcome.\n\nAdapt current training materials/manuals and develop new-to be used within the local context.\n\nQualifications/Skill & Ability\n\nDegree/diploma in WASH related field/engineering/health/international development or equivalent\n\nMust be SLTA/CLTS certified\n\nAt least 4 vears experience in water, sanitation, health and hygiene\n\nProficiency in monitoring, evaluation and research of WASH programs\n\nProficient in reading writing and speaking English\n\nCommunicating orally’\n\nPresentation skills\n\nProficiency in Microsoft Office skills\n\nProven report writing skills\n\nValid driver’s license\n\nApplication Process\n\nApplicants should submit a 1 page cover letter and CV (no more than 4 pages) with details of qualifications (do not includes at this stage) and work experience including 3 references- professional, spiritual and general.\n\nAll offers of employment are made contingent upon the successful completion of all applicable background checks, including a clear police background check.\n\nApplications should be forwarded to the Human Resource Officer at Sumbuya, Destiny Junction Lungi or email address Iwisleone@gmail.com\n\nThe deadline for applications is Fridav 21 June 2013\n\nOnly shortlisted candidates will be contacted Living Water International, Sierra Leone is an equal opportunity employer",
    "job_highlights": [
      {
        "items": [
          "Living Water International (LWI) is a global non-governmental organization that exists to demonstrate the love of God by helping communities acquire desperately needed clean water, and to experience “living water” the Gospel of Jesus Christ which alone satisfies the deepest thirst. Living Water in Africa is providing safe drinking water, Christian Witness sanitation and health education to communities, across Africa. Living Water International, Sierra leone based in lungi for the time being but will be in Freetown January 2014, has a vacancy tor an experienced and qualified Sierra Leonean to apply for the position ‘WASH Specialist.’This will report to the Operations Director.\n\nWash Specialist\n\nResponsibilities\n\nProvide support to the country director and operations director in the area of WASH (Water Sanitation Hygiene).\n\nProvide technical adviseto implementers of project/programs.\n\nOversee training of community members in proper health, sanitation, hygiene practices with emphasis on... positive behaviour change.Conduct base-line surveys.\n\nPresent an action plan to correct past projects to the Operation Director and for review and planning to achieve desired outcome.\n\nAdapt current training materials/manuals and develop new-to be used within the local context.\n\nQualifications/Skill & Ability\n\nDegree/diploma in WASH related field/engineering/health/international development or equivalent\n\nMust be SLTA/CLTS certified\n\nAt least 4 vears experience in water, sanitation, health and hygiene\n\nProficiency in monitoring, evaluation and research of WASH programs\n\nProficient in reading writing and speaking English\n\nCommunicating orally’\n\nPresentation skills\n\nProficiency in Microsoft Office skills\n\nProven report writing skills\n\nValid driver’s license\n\nApplication Process\n\nApplicants should submit a 1 page cover letter and CV (no more than 4 pages) with details of qualifications (do not includes at this stage) and work experience including 3 references- professional, spiritual and general.\n\nAll offers of employment are made contingent upon the successful completion of all applicable background checks, including a clear police background check.\n\nApplications should be forwarded to the Human Resource Officer at Sumbuya, Destiny Junction Lungi or email address Iwisleone@gmail.com\n\nThe deadline for applications is Fridav 21 June 2013\n\nOnly shortlisted candidates will be contacted Living Water International, Sierra Leone is an equal opportunity employer"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://water.cc/flourish/",
        "text": "water.cc/flourish"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=Living+Water+International+(LWI)&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCJUI",
        "text": "See web results for Living Water International (LWI)"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXQVNIIFNwZWNpYWxpc3QiLCJodGlkb2NpZCI6Ik8wTjY0R0hRaTZxZEpkQnJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJzbCIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVV4UGJuQlpWVnAzU0ZsWVpFOUNhSEEzTVhONkxWUXdZazlJUVc1aVpsRXRObEF4Y1c1SU1uSXhXVWRHYzBSTmVsZDJXRUZCU2psVVUxQnliakJyV1ZaWE0yOU1VVkpDYVdWTlVqUlRaRWR0UjFBdFVESnlWSFpRWkRWT1EwcERZMnBaUW5wQlgwTm5RbmR4TjBkSmFsOUdPRE5rVnpsMFJHRk9OaloyVWpod1UwVk5iWEZrT0hKTGJrSlllSEl6Ulcxa1JuQXRhbmxpTkRGaU1ESm5lRVpFT0dWWk9VTjVTeTFqY2xveU9FRnhiVkpRWm1oNWRHdDVYM0pDTUhodWVVdHJkSFZxWlcxWFFuSklNVGh1ZWtKcFVIRk5VR3M1TnpSdlpDMXJiblExVVJJWE4xUktjbHBtZFRGQmRsaFdOVTV2VUdsaVMxUnpVV01hSWtGS2Qyc3RPR1ZuZWtkelgyVlROVkUxVVY5cmJtTlRlRWRTTTBGQk1UVm5hbWMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6Ii5uRmcyZWJ7Zm9udC13ZWlnaHQ6NTAwfS5CaTZEZGN7Zm9udC13ZWlnaHQ6NTAwfUFwcGx5IGRpcmVjdGx5IG9uIEZpbmQgSm9icyBTaWVycmEgTGVvbmUiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzaWVycmFsZW9uZS5zdGFsdmEuY29tL2pvYi93YXNoLXNwZWNpYWxpc3QvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Consultant to develop a WASH Strategy for IRC Sierra Leone",
    "company_name": "IRC - The International Rescue Committee",
    "location": "  Sierra Leone  (+1 other)    ",
    "via": "via UN Talent",
    "description": "**Job Description**\n\nBACKGROUND\nThe International Rescue Committee responds to the world’s worst humanitarian crises and helps people to survive and rebuild their lives. Founded in 1933 at the request of Albert Einstein, IRC offers life-saving care and life-changing assistance to refugees forced to flee from war or disaster. At work today in more than 40 countries and 22 U.S. cities, IRC restores safety, dignity and hope to millions of people uprooted by conflict or disaster. IRC leads the way from harm to home.\nThe IRC began emergency operations in Sierra Leone in 1998 during the civil war. In the post-conflict reconstruction period, the IRC consolidated its operations into three core programmatic areas: health, education, and women’s protection and empowerment. In addition, the IRC leads consortia in education and health working with 8 partners at national scale. The IRC has offices in Freetown, Bo, Kenema, Kailahun, and Kono Districts but implements programs in many other districts... through partners and one of its consortium projects is implemented in all the sixteen districts in the country. The IRC is implementing projects in Health, Education and Women and Girls Protection and Empowerment (WPGE) across the country and is planning to introduce Water, sanitation, and hygiene (WASH) programming to its portfolio.\nIntroduction\nWater, sanitation, and hygiene are essential environmental determinants of health and well-being. Providing safe WASH services and adequate waste management is essential to ensuring the delivery of high-quality health care, community well-being and preventing infections. The WASH sector is also among the sectors that employ many people and creates new livelihood opportunities for vulnerable groups.\nSierra Leone’s health system has not yet fully recovered from the effects of the decade-long civil war, the Ebola epidemic, the COVID-19 pandemic; and other outbreaks such as measles, and cholera, among others. Despite investments in WASH during previous and current epidemics, the country still struggles with WASH infrastructure. The disease burden, due to poor hygiene practices, is extremely high. The country’s economic growth fluctuated from 4.6% in 2014 to 2.1% in 2015, and to 4.7% in 2020, and the country is still one of the poorest in the world. Poverty has a negative impact on the already weak health system and remote rural areas and marginalized communities are particularly prone to related shocks. The climate patterns in Sierra Leone have changed: average temperatures have increased by 0.8°C, and annual rainfall has varied. Between 2011 and 2018, Sierra Leone lost 151,873 hectares of tree cover and this has increased the levels of flooding across the country. It also led to increased soil erosion which not only affects the local population, but also downstream populations where soil deposits are built up.\nThe International Rescue Committee (IRC) conducted a WASH assessment in five districts including Bo, Kenema, Kailahun, Kono and Pujehun. The assessment covered the policy and strategy document review for WASH and provided an overview of WASH at the country level, in addition to specific findings for each of the five districts assessed.\nAlthough the country reports an increase in access to basic (safely managed and basic) water sources from 59 per cent (2015) to 64 per cent (JMP, 2020), the disparities in rural and urban water are still high, estimated at 53 per cent and 79 per cent respectively. There is also high inequality in water supply in planned and unplanned settlements and poor quantile in urban areas. Many existing water systems are not functional. Out of the existing improved water sources, an estimated 28 - 30 per cent are not functional due breakdowns. Water contamination is also a serious concern where 85% of drinking water from improved water sources is contaminated with E. coli. Big cities like Freetown records high water rationing due to increase of the population of Freetown that is not proportional to the capacity of the dam. At the time of construction of the dam (1950s-60s) it was designed to serve around 500,000 and now the population is more than 1.2 million people. Freetown’s water distribution network has also significant leakages, resulting unacceptably in high rates of Non-Revenue Water (NRW) estimated at 56.5% during dry weather and 57.8% during wet weather periods.\nEven though Sierra Leone‘s open defecation rate reduced from 26% in 2000 to 16% in 2020 it is still high. The portion of the population using unimproved sanitation is also still high (29%). Moreover, only 16% of Sierra Leone‘s population have access to at least safely managed and basic sanitation and 38% have limited sanitation. The majority (48%) of those with access to sanitation uses latrines while a limited number of the population use septic tank (6%) and only 1% in the cities have access to the sewer system. In Freetown, an estimated 336,440 m3 of faecal sludge is generated annually by households in planned and unplanned dwellings, public toilets and businesses and institutions. Only 21% of generated sludge reaches and is treated at a faecal sludge treatment plant located at Kingtom which is the only one in Sierra Leone. The remaining 78% is disposed of by being buried onsite following manual emptying without transport to a designated treatment facility or discharged in waterways or the ocean without further treatment. Limited road accessibility deprives over half of Freetown‘s population of access to mechanized emptying technologies.\nAccording to a study in 2019 by UNICEF, there is a massive need for WASH support in healthcare facilities. Despite the efforts of many actors, including the government, many wells in healthcare facilities are not functional. The same assessment revealed that only 36% have functional water supply systems and 49% have hand washing facilities with water and soap at all points of care. While the need to increase access to water, sanitation and hygiene in communities, schools, and healthcare facilities, across the five district remains necessary, the issue of water point efficiency is very urgent for schools and healthcare facilities. For the majority of schools and all HCFs, the water point efficiency was below the minimum standard of at least 15 liters per student per day (UNICEF) and 5 liters per out-patient and 40-60 liters per in-patient/day (WHO). It was also evidenced that the functionality of sanitation was very low. There is evidence that social behavior change programs focus on increasing access to sanitation facilities, but little emphasis is made on monitoring the use of attained facilities. Many HCFs do not have a reticulation system which is a disincentive to improving hand hygiene. Health facilities and schools do not have disability-friendly WASH facilities.\nPURPOSE\nThe purpose of this assignment is to develop an IRC WASH Strategy that will guide the organization’s approach to WASH programming for the next five years. This is part of the IRC’s strategic action plan and is related to the organization’s WASH objective namely “People have access to water, sanitation and hygiene and live enhanced environment”.\nOBJECTIVE\nThe overall objective of this assignment is to develop the IRC WASH strategy that will guide the development and implementation of WASH interventions for IRC in Sierra Leone for the next five years. The assignment will have the following specific objectives:\nIdentify key WASH constraints and challenges preventing different categories of people in Sierra Leone to have access to clean water, improved sanitation, and hygiene.\nPropose strategies to address key WASH challenges while focusing on addressing localization, girls’ and women’s needs, social inclusion.\nDevelop a strategic implementation plan and a detailed monitoring, evaluation and learning framework with milestones.\n\nPROPOSED METHODOLOGY AND APPROACH\nThis assignment will involve a literature search and review, consultative meetings, and validation meeting. No active data collection is expected. The assignment will be done in three phases:\nPhase one: The inception phase will involve meetings with IRC to discuss and agree on methodology and approach, the strategy structure and components, preliminary presentation of the issues to be addressed from the WASH assessment and other relevant documents, workplan/timeline. The deliverable for phase one will be an approved inception report.\nPhase two: After the inception phase, the next step will involve a thorough review of literature, context analysis, strategy development, presentation of different scenarios to the IRC, consultative meeting with the IRC, etc. The deliverable for this phased will be a draft strategy document with proposed strategic alternatives, goals and strategic objectives, success statements, and milestones/scenarios.\nPhase three: Upon approval of the draft strategy document, phase three will involve development of an implementation plan and a clear MEAL framework building on Strategic Goals and Objectives. This will also involve consultative meetings with the IRC as needed.\nEXPECTED DELIVERABLES\nThe consultant will be responsible for the following deliverables:\nApproved InceptionReport.\nDraft WASH Strategy for IRC Sierra Leone.\nImplementation plan and MEAL Framework.\nIRC ROLES\nThe IRC will be responsible for the following:\nProviding background documentation on the IRC’s vision, mission, and values, and specifically for WASH.\nProviding final report on IRC’s global WASH assessment. the approved for the completed WASH assessment\nProviding technical guidance and support during the assignment\n\nCALL FOR PROPOSALS\nThe IRC invites interested individuals or consultancy firms to submit proposals to conduct this assignment. The proposals should include a technical proposal (with the consultant’s profile, their understanding of the assignment; a detailed description of the methodology they intend to use; the draft structure of the final document, and any other relevant sections). The Consultant should also submit a financial proposal, with daily rates.\n• *Qualifications**\n\nREQUIREMENTS\nThe successful consultant will be expected to demonstrate:\nAdvanced degree in Environmental Health or related field.\nExperience in WASH programming in Sierra Leone\nExperience in strategy planning and development, particularly for WASH.\nDetailed knowledge of, and experience in, WASH issues with a focus on sustainability and integration of WASH into health systems specifically in low- and middle-income communities.\nStrong analytical and communication skills.\nAbility to mobilize in-country WASH sector partners and stakeholders in Sierra Leone.\n\nIMPORTANT NOTES\n\nTreatment of Information and Confidentiality\nAll data and information received for the purpose of this assignment is to be treated confidentially and is only to be used in connection with the execution of these terms of reference. All intellectual property rights arising from the execution of these terms of reference are assigned to the IRC. The contents of written material obtained and used in this assignment may not be disclosed to any third parties without the expressed advance written authorization of the IRC.\n\nKey Working Relationships\nThe Consultant will liaise directly with, and get support from, the Senior Health Coordinator based in Freetown and/or the IPC/WASH Specialist based in Bo District.\nCode of Conduct and Ethics\nThe Consultant is expected to abide by the IRC code of conduct for suppliers, as well as evaluation principles of independence, transparency, quality, utility including IRC Way principles. The consultant is also expected to follow national rules and regulations on research and ethics in Sierra Leone.\nDuty of Care\nThe Consultant is responsible for the safety and well-being of their Personnel and Third Parties affected by the activities under this contract, including appropriate security arrangements. The IRC will share available information with the Consultant on security status of the country, as needed, but is not responsible for the safety and well-being of the consultant and their personnel.\n\nThe IRC is an Equal Opportunities Employer and considers all applicants based on merit without regard to race, sex, color, national origin, religion, sexual orientation, age, marital status, veteran status, or disability",
    "job_highlights": [
      {
        "items": [
          "**Job Description**\n\nBACKGROUND\nThe International Rescue Committee responds to the world’s worst humanitarian crises and helps people to survive and rebuild their lives. Founded in 1933 at the request of Albert Einstein, IRC offers life-saving care and life-changing assistance to refugees forced to flee from war or disaster. At work today in more than 40 countries and 22 U.S. cities, IRC restores safety, dignity and hope to millions of people uprooted by conflict or disaster. IRC leads the way from harm to home.\nThe IRC began emergency operations in Sierra Leone in 1998 during the civil war. In the post-conflict reconstruction period, the IRC consolidated its operations into three core programmatic areas: health, education, and women’s protection and empowerment. In addition, the IRC leads consortia in education and health working with 8 partners at national scale. The IRC has offices in Freetown, Bo, Kenema, Kailahun, and Kono Districts but implements programs in many other districts... through partners and one of its consortium projects is implemented in all the sixteen districts in the country. The IRC is implementing projects in Health, Education and Women and Girls Protection and Empowerment (WPGE) across the country and is planning to introduce Water, sanitation, and hygiene (WASH) programming to its portfolio.\nIntroduction\nWater, sanitation, and hygiene are essential environmental determinants of health and well-being. Providing safe WASH services and adequate waste management is essential to ensuring the delivery of high-quality health care, community well-being and preventing infections. The WASH sector is also among the sectors that employ many people and creates new livelihood opportunities for vulnerable groups.\nSierra Leone’s health system has not yet fully recovered from the effects of the decade-long civil war, the Ebola epidemic, the COVID-19 pandemic; and other outbreaks such as measles, and cholera, among others. Despite investments in WASH during previous and current epidemics, the country still struggles with WASH infrastructure. The disease burden, due to poor hygiene practices, is extremely high. The country’s economic growth fluctuated from 4.6% in 2014 to 2.1% in 2015, and to 4.7% in 2020, and the country is still one of the poorest in the world. Poverty has a negative impact on the already weak health system and remote rural areas and marginalized communities are particularly prone to related shocks. The climate patterns in Sierra Leone have changed: average temperatures have increased by 0.8°C, and annual rainfall has varied. Between 2011 and 2018, Sierra Leone lost 151,873 hectares of tree cover and this has increased the levels of flooding across the country. It also led to increased soil erosion which not only affects the local population, but also downstream populations where soil deposits are built up.\nThe International Rescue Committee (IRC) conducted a WASH assessment in five districts including Bo, Kenema, Kailahun, Kono and Pujehun. The assessment covered the policy and strategy document review for WASH and provided an overview of WASH at the country level, in addition to specific findings for each of the five districts assessed.\nAlthough the country reports an increase in access to basic (safely managed and basic) water sources from 59 per cent (2015) to 64 per cent (JMP, 2020), the disparities in rural and urban water are still high, estimated at 53 per cent and 79 per cent respectively. There is also high inequality in water supply in planned and unplanned settlements and poor quantile in urban areas. Many existing water systems are not functional. Out of the existing improved water sources, an estimated 28 - 30 per cent are not functional due breakdowns. Water contamination is also a serious concern where 85% of drinking water from improved water sources is contaminated with E. coli. Big cities like Freetown records high water rationing due to increase of the population of Freetown that is not proportional to the capacity of the dam. At the time of construction of the dam (1950s-60s) it was designed to serve around 500,000 and now the population is more than 1.2 million people. Freetown’s water distribution network has also significant leakages, resulting unacceptably in high rates of Non-Revenue Water (NRW) estimated at 56.5% during dry weather and 57.8% during wet weather periods.\nEven though Sierra Leone‘s open defecation rate reduced from 26% in 2000 to 16% in 2020 it is still high. The portion of the population using unimproved sanitation is also still high (29%). Moreover, only 16% of Sierra Leone‘s population have access to at least safely managed and basic sanitation and 38% have limited sanitation. The majority (48%) of those with access to sanitation uses latrines while a limited number of the population use septic tank (6%) and only 1% in the cities have access to the sewer system. In Freetown, an estimated 336,440 m3 of faecal sludge is generated annually by households in planned and unplanned dwellings, public toilets and businesses and institutions. Only 21% of generated sludge reaches and is treated at a faecal sludge treatment plant located at Kingtom which is the only one in Sierra Leone. The remaining 78% is disposed of by being buried onsite following manual emptying without transport to a designated treatment facility or discharged in waterways or the ocean without further treatment. Limited road accessibility deprives over half of Freetown‘s population of access to mechanized emptying technologies.\nAccording to a study in 2019 by UNICEF, there is a massive need for WASH support in healthcare facilities. Despite the efforts of many actors, including the government, many wells in healthcare facilities are not functional. The same assessment revealed that only 36% have functional water supply systems and 49% have hand washing facilities with water and soap at all points of care. While the need to increase access to water, sanitation and hygiene in communities, schools, and healthcare facilities, across the five district remains necessary, the issue of water point efficiency is very urgent for schools and healthcare facilities. For the majority of schools and all HCFs, the water point efficiency was below the minimum standard of at least 15 liters per student per day (UNICEF) and 5 liters per out-patient and 40-60 liters per in-patient/day (WHO). It was also evidenced that the functionality of sanitation was very low. There is evidence that social behavior change programs focus on increasing access to sanitation facilities, but little emphasis is made on monitoring the use of attained facilities. Many HCFs do not have a reticulation system which is a disincentive to improving hand hygiene. Health facilities and schools do not have disability-friendly WASH facilities.\nPURPOSE\nThe purpose of this assignment is to develop an IRC WASH Strategy that will guide the organization’s approach to WASH programming for the next five years. This is part of the IRC’s strategic action plan and is related to the organization’s WASH objective namely “People have access to water, sanitation and hygiene and live enhanced environment”.\nOBJECTIVE\nThe overall objective of this assignment is to develop the IRC WASH strategy that will guide the development and implementation of WASH interventions for IRC in Sierra Leone for the next five years. The assignment will have the following specific objectives:\nIdentify key WASH constraints and challenges preventing different categories of people in Sierra Leone to have access to clean water, improved sanitation, and hygiene.\nPropose strategies to address key WASH challenges while focusing on addressing localization, girls’ and women’s needs, social inclusion.\nDevelop a strategic implementation plan and a detailed monitoring, evaluation and learning framework with milestones.\n\nPROPOSED METHODOLOGY AND APPROACH\nThis assignment will involve a literature search and review, consultative meetings, and validation meeting. No active data collection is expected. The assignment will be done in three phases:\nPhase one: The inception phase will involve meetings with IRC to discuss and agree on methodology and approach, the strategy structure and components, preliminary presentation of the issues to be addressed from the WASH assessment and other relevant documents, workplan/timeline. The deliverable for phase one will be an approved inception report.\nPhase two: After the inception phase, the next step will involve a thorough review of literature, context analysis, strategy development, presentation of different scenarios to the IRC, consultative meeting with the IRC, etc. The deliverable for this phased will be a draft strategy document with proposed strategic alternatives, goals and strategic objectives, success statements, and milestones/scenarios.\nPhase three: Upon approval of the draft strategy document, phase three will involve development of an implementation plan and a clear MEAL framework building on Strategic Goals and Objectives. This will also involve consultative meetings with the IRC as needed.\nEXPECTED DELIVERABLES\nThe consultant will be responsible for the following deliverables:\nApproved InceptionReport.\nDraft WASH Strategy for IRC Sierra Leone.\nImplementation plan and MEAL Framework.\nIRC ROLES\nThe IRC will be responsible for the following:\nProviding background documentation on the IRC’s vision, mission, and values, and specifically for WASH.\nProviding final report on IRC’s global WASH assessment. the approved for the completed WASH assessment\nProviding technical guidance and support during the assignment\n\nCALL FOR PROPOSALS\nThe IRC invites interested individuals or consultancy firms to submit proposals to conduct this assignment. The proposals should include a technical proposal (with the consultant’s profile, their understanding of the assignment; a detailed description of the methodology they intend to use; the draft structure of the final document, and any other relevant sections). The Consultant should also submit a financial proposal, with daily rates.\n• *Qualifications**\n\nREQUIREMENTS\nThe successful consultant will be expected to demonstrate:\nAdvanced degree in Environmental Health or related field.\nExperience in WASH programming in Sierra Leone\nExperience in strategy planning and development, particularly for WASH.\nDetailed knowledge of, and experience in, WASH issues with a focus on sustainability and integration of WASH into health systems specifically in low- and middle-income communities.\nStrong analytical and communication skills.\nAbility to mobilize in-country WASH sector partners and stakeholders in Sierra Leone.\n\nIMPORTANT NOTES\n\nTreatment of Information and Confidentiality\nAll data and information received for the purpose of this assignment is to be treated confidentially and is only to be used in connection with the execution of these terms of reference. All intellectual property rights arising from the execution of these terms of reference are assigned to the IRC. The contents of written material obtained and used in this assignment may not be disclosed to any third parties without the expressed advance written authorization of the IRC.\n\nKey Working Relationships\nThe Consultant will liaise directly with, and get support from, the Senior Health Coordinator based in Freetown and/or the IPC/WASH Specialist based in Bo District.\nCode of Conduct and Ethics\nThe Consultant is expected to abide by the IRC code of conduct for suppliers, as well as evaluation principles of independence, transparency, quality, utility including IRC Way principles. The consultant is also expected to follow national rules and regulations on research and ethics in Sierra Leone.\nDuty of Care\nThe Consultant is responsible for the safety and well-being of their Personnel and Third Parties affected by the activities under this contract, including appropriate security arrangements. The IRC will share available information with the Consultant on security status of the country, as needed, but is not responsible for the safety and well-being of the consultant and their personnel.\n\nThe IRC is an Equal Opportunities Employer and considers all applicants based on merit without regard to race, sex, color, national origin, religion, sexual orientation, age, marital status, veteran status, or disability"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.theirc.org/",
        "text": "theirc.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=IRC+-+The+International+Rescue+Committee&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCMQI",
        "text": "See web results for IRC - The International Rescue Committee"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGSOu9pO5t1uS-k2Z4hrK4xg296z2G_ddn8m2gIYE&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IHRvIGRldmVsb3AgYSBXQVNIIFN0cmF0ZWd5IGZvciBJUkMgU2llcnJhIExlb25lIiwiaHRpZG9jaWQiOiJjV25Oenhpa3pyUXR1YWxuQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoic2wiLCJobCI6ImVuIiwiZmMiOiJFcmNDQ3ZjQlFVeFBibkJaVlVWTlh6RlViMGs0WlRSbGJIbEtMVXh6WXpVMmVFRm9kSGRmT0dKNFMyNWxaRnBpYW1Kd1gxWlhhazVUZW5wYVVrZHNWMGRKUXpRNVVXUjZWa0ZNVUdFeWMwSXRXVEZUVUdaTFNGSXdRMmxNWlhKaFNYSm9YMmxJZFhsSFVYUXhWMmhrWDJWdVdWTTRSamxDUm5sa2NHeExlblE0Um5GaGVXdzJTVlpRUkRKV2FtdFBVa2ROTm1kNFJFeGpXREF6T1dGdE1Va3phM3B5Y0dSWU0yWm9UMWN6VmxaMFkxaEhka0oxV1dkNmJUZHBkVVF6Ym5RNFgyVkpiSFl4UlRCUE5rdDNabTVIY25OdE1rUklibWxoYWtsaWEzaFhYMDVpY0Rka1NEZzRTRWRVTFhkT2EwMW5VbUpyWjB3dGVWcGpWUklYTjFSS2NscG1kVEZCZGxoV05VNXZVR2xpUzFSelVXTWFJa0ZLZDJzdE9HUkpRV1JmUkVKZlJtOXRVRTluWmxGbmJWRkVhamxuWlRSeGIxRSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVU4gVGFsZW50IiwibGluayI6Imh0dHBzOi8vdW50YWxlbnQub3JnL2pvYnMvY29uc3VsdGFudC10by1kZXZlbG9wLWEtd2FzaC1zdHJhdGVneS1mb3ItaXJjLXNpZXJyYS1sZW9uZS0xP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Gender and Social Development Expert",
    "company_name": "Sierra Leone Water Company (SALWACO)",
    "location": "  Freetown   ",
    "via": "via Find Jobs Sierra Leone",
    "description": "PROJECT IMPLEMENTATION UNIT(PIU)\n\nTHREE TOWNS WATER SUPPLY AND SANITATION PROJECT (TTWSSP)\n\nM BAG 42, TOWER HILL, FREETOWN\n\nEMail: joebendavies@hotmail.com jbndavies@gmail.com Tel: +232 78 571 933/+232 33 605 707\n\nBackground:\n\nThe Government of Sierra Leone through the Ministry of Finance and Economic Development has received grants and loans from the African Dvelopment Bank (ADB) under the Three Town Water Supply and Sanitation Project (TTWSSP)ji implemented by SALWACO.\n\nThe aim of this project is to provide improved access to adequate, safe and reliable water supply and public sanitation services for the three cities and to enhance the institutional, operational and management capabilities of the Sierra Leone Water Company (SALWACO) the main service provider for Water and Sanitation Services. It consists of three components namely: Infrastructure, Institutional capacity building, and Project Management. Its main outputs include: (i) rehabilitate and reconstruct water supply and... sanitation systems, (ii) improve sanitation facilities for schools, health centres and public places and (iii) institutional reforms and capacity building for SALWACO, a revolving social connection fund, and public education on proper sanitation and hygiene. To effectively implement this project, SALWACO invites suitable and competent Sierra Leoneans to submit applications for the following vacancy:\n\nGender and Social Development Expert\n\nJob Location: Freetown, Sierra Leone\n\nReporting to: Project Coordinator\n\nJob Tenure: Two years contract; renewable based on performance\n\nAge Limit: 25-45 year\n\nRemuneration: Attractive\n\nStart Date: 1st July, 2013\n\nJob Purpose:\n\nTo promote gender integration and parity, social inclusion and development in the management of TTWSSP and urban water supply and sanitation service delivery.\n\nMain Duties and Responsibilities.\n\nThe overall task of the Gender and Social Development Expert is to:\n\nLead the implementation of the gender and social development component of the\n\nTTWSSP.\n\nFormulate and implement an integrated gender and social development startegy for\n\nTTWSSP and SALWACO.\n\nEnsure that gender analysis supports SALWACO’s plans forTTWSSP integration with local government and long-term transition as a service delivery institution.\n\nSupport project teams to include specific actions to address gender and social issues as well as broad gender awareness in their work, and provide capacity building support as needed.\n\nLead both the evaluation and in-depth analysis/research on specific gender-related issues encountered during project implementation.\n\nDisseminate good practices and key results coming out of the project, with relevant stakeholders and counterparts in country, and beyond.\n\nPerson Specification\n\nEssential\n\nAt least 3 years experience in gender roles relevant to social development, community development or other development program delivery.\n\nDemonstrated track record of providing gender and social development-focused advice and support which has responded to program needs and which has assisted in bringing about better gender and social development outcomes for large programs.\n\nA degree in gender studies, development studies, sociology, anthropology or other social development-relevant field.\n\nExperience working in delivering gender-sensitive program outcomes in developing country, especially in urban and peri-urban areas.\n\nProven abilities to develop and implement gender and social development related activities, designed through a process of deep stakeholder engagement\n\nExcellent communication ability.\n\nDesired\n\nExperience in usage of computers and internet will be preferred. If not computer literate, the Incumbent shall upgrade the skill within one month of joining.\n\nAbility to work in a team and train staff on the job and assist in day to day issues relating to social concerns.\n\nExperience of having dealt with Government agencies and familiarity with government procedures of financing, implementation, etc.\n\nCan work under pressure, honest with a high level of interaction and interpersonal skills.\n\nMode of Application\n\nInterested persons are to submit a cover letter including the names and contact details of three (3) referees, C V and relevant documents in a sealed envelope to:\n\nThe Acting Director-General Sierra Leone Water Company (SALWACO) pmb 42 Tower Hill Freetown Closing date: 21st June, 2013 @ 4:30 pm",
    "job_highlights": [
      {
        "items": [
          "PROJECT IMPLEMENTATION UNIT(PIU)\n\nTHREE TOWNS WATER SUPPLY AND SANITATION PROJECT (TTWSSP)\n\nM BAG 42, TOWER HILL, FREETOWN\n\nEMail: joebendavies@hotmail.com jbndavies@gmail.com Tel: +232 78 571 933/+232 33 605 707\n\nBackground:\n\nThe Government of Sierra Leone through the Ministry of Finance and Economic Development has received grants and loans from the African Dvelopment Bank (ADB) under the Three Town Water Supply and Sanitation Project (TTWSSP)ji implemented by SALWACO.\n\nThe aim of this project is to provide improved access to adequate, safe and reliable water supply and public sanitation services for the three cities and to enhance the institutional, operational and management capabilities of the Sierra Leone Water Company (SALWACO) the main service provider for Water and Sanitation Services. It consists of three components namely: Infrastructure, Institutional capacity building, and Project Management. Its main outputs include: (i) rehabilitate and reconstruct water supply and... sanitation systems, (ii) improve sanitation facilities for schools, health centres and public places and (iii) institutional reforms and capacity building for SALWACO, a revolving social connection fund, and public education on proper sanitation and hygiene. To effectively implement this project, SALWACO invites suitable and competent Sierra Leoneans to submit applications for the following vacancy:\n\nGender and Social Development Expert\n\nJob Location: Freetown, Sierra Leone\n\nReporting to: Project Coordinator\n\nJob Tenure: Two years contract; renewable based on performance\n\nAge Limit: 25-45 year\n\nRemuneration: Attractive\n\nStart Date: 1st July, 2013\n\nJob Purpose:\n\nTo promote gender integration and parity, social inclusion and development in the management of TTWSSP and urban water supply and sanitation service delivery.\n\nMain Duties and Responsibilities.\n\nThe overall task of the Gender and Social Development Expert is to:\n\nLead the implementation of the gender and social development component of the\n\nTTWSSP.\n\nFormulate and implement an integrated gender and social development startegy for\n\nTTWSSP and SALWACO.\n\nEnsure that gender analysis supports SALWACO’s plans forTTWSSP integration with local government and long-term transition as a service delivery institution.\n\nSupport project teams to include specific actions to address gender and social issues as well as broad gender awareness in their work, and provide capacity building support as needed.\n\nLead both the evaluation and in-depth analysis/research on specific gender-related issues encountered during project implementation.\n\nDisseminate good practices and key results coming out of the project, with relevant stakeholders and counterparts in country, and beyond.\n\nPerson Specification\n\nEssential\n\nAt least 3 years experience in gender roles relevant to social development, community development or other development program delivery.\n\nDemonstrated track record of providing gender and social development-focused advice and support which has responded to program needs and which has assisted in bringing about better gender and social development outcomes for large programs.\n\nA degree in gender studies, development studies, sociology, anthropology or other social development-relevant field.\n\nExperience working in delivering gender-sensitive program outcomes in developing country, especially in urban and peri-urban areas.\n\nProven abilities to develop and implement gender and social development related activities, designed through a process of deep stakeholder engagement\n\nExcellent communication ability.\n\nDesired\n\nExperience in usage of computers and internet will be preferred. If not computer literate, the Incumbent shall upgrade the skill within one month of joining.\n\nAbility to work in a team and train staff on the job and assist in day to day issues relating to social concerns.\n\nExperience of having dealt with Government agencies and familiarity with government procedures of financing, implementation, etc.\n\nCan work under pressure, honest with a high level of interaction and interpersonal skills.\n\nMode of Application\n\nInterested persons are to submit a cover letter including the names and contact details of three (3) referees, C V and relevant documents in a sealed envelope to:\n\nThe Acting Director-General Sierra Leone Water Company (SALWACO) pmb 42 Tower Hill Freetown Closing date: 21st June, 2013 @ 4:30 pm"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=Sierra+Leone+Water+Company+(SALWACO)&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCPEI",
        "text": "See web results for Sierra Leone Water Company (SALWACO)"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJHZW5kZXIgYW5kIFNvY2lhbCBEZXZlbG9wbWVudCBFeHBlcnQiLCJodGlkb2NpZCI6Iklra1VHRlowc05QV19lSUVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJzbCIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gRmluZCBKb2JzIFNpZXJyYSBMZW9uZSIsImxpbmsiOiJodHRwczovL2pvYnNpZXJyYWxlb25lLnN0YWx2YS5jb20vam9iL2dlbmRlci1hbmQtc29jaWFsLWRldmVsb3BtZW50LWV4cGVydC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Water Mapping Assistant",
    "company_name": "Ministry of Water Resources",
    "location": "  Freetown   ",
    "via": "via Find Jobs Sierra Leone",
    "description": "The Public Service Commission of Sierra Leone as part of its ongoing effort to reforming and implementing government strategies and programmes for national development, intends to recruit suitably qualified and talented Sierra Leoneans to fill in the following vacancies:\n\nMinistry of Water Resource\n\nWater Mapping Assistant\n\nThe Public Service Commission wishes to reiterate that its Recruitment and Selection Processes are based on a set of Guiding Principles among which is that of DIVERSITY and COMPETITIVENESS; enjoining the Commission to be committed in its quest to select and recruit the best candidates using as a yardstick the principles of value, competence and skills evenly mixed with cultural, regional and gender balance. Closing date for the receipts of all applications is at 3:00pm on Friday 14th March, 2014",
    "job_highlights": [
      {
        "items": [
          "The Public Service Commission of Sierra Leone as part of its ongoing effort to reforming and implementing government strategies and programmes for national development, intends to recruit suitably qualified and talented Sierra Leoneans to fill in the following vacancies:\n\nMinistry of Water Resource\n\nWater Mapping Assistant\n\nThe Public Service Commission wishes to reiterate that its Recruitment and Selection Processes are based on a set of Guiding Principles among which is that of DIVERSITY and COMPETITIVENESS; enjoining the Commission to be committed in its quest to select and recruit the best candidates using as a yardstick the principles of value, competence and skills evenly mixed with cultural, regional and gender balance. Closing date for the receipts of all applications is at 3:00pm on Friday 14th March, 2014"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=Ministry+of+Water+Resources&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCJwJ",
        "text": "See web results for Ministry of Water Resources"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBNYXBwaW5nIEFzc2lzdGFudCIsImh0aWRvY2lkIjoiTjFDWUNMZ0VEb1lPVDFtbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InNsIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBGaW5kIEpvYnMgU2llcnJhIExlb25lIiwibGluayI6Imh0dHBzOi8vam9ic2llcnJhbGVvbmUuc3RhbHZhLmNvbS9qb2Ivd2F0ZXItbWFwcGluZy1hc3Npc3RhbnQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "COUNTRY REPRESENTATIVE",
    "company_name": "Inter Aide",
    "location": "  Makeni   ",
    "via": "via MENA Jobs",
    "description": "BACKGROUND\n\nCreated in 1980, Inter Aide is an association specialized in the realization of rural development programmes, which aims to strengthen the capacities of the most vulnerable populations so that they can improve their living conditions. Inter Aide currently runs 50 programs in seven countries: Haiti, Ethiopia, Madagascar, Sierra Leone, Guinea, Malawi and Mozambique. We focus on 4 key sectors – community health, WASH (water, sanitation and hygiene) and maintenance services, agriculture, and education. In 2021, more than 193,000 beneficiary families were supported to meet their most vital needs.\n\nInter Aide has been working on rural development programmes in Sierra Leone since 2007. The programmes aims at improving access to drinking water, the functionality of water points and food security in four districts of the country.\n\nInter Aide began its operations in the North and North-West of Sierra Leone in 2007 and has developed through the years a strong field expertise that... directly involves and helps empowering local beneficiaries and actors in the following key areas:\n• Water, Sanitation and Hygiene (WASH) and maintenance services: The WASH team is in charge of building and rehabilitating about 30 water points per year and improving latrine coverage. Another specific team also works on preventive maintenance that currently covers more than 2,500 water points via a network of independent water pump technicians.\n• Family farming and food producing agriculture: The agricultural team works on the improvement of production techniques and on new cropping systems (especially horticulture).\n\nIn addition, there is a “log/admin” support department that provides transversal support to the programmes.\n\nIn total, Inter Aide’s team in Sierra Leone is composed of about 85 people.\n\nIn this context, Inter Aide is looking for a Country Representative that will be in charge of administrative, financial and logistical coordination, relations with development partners, in particular with local authorities in the capital and in the districts, communication with the head office and with the Programme Managers.\n\nHe/she will be based in the city of Makeni, Inter Aide’s headquarters in SL, with frequent travels in the field in the intervention areas and more occasionally in the capital.\n\nMISSIONS\n\nThe Country Representative works in close collaboration with the Area Managers and the Administrative and Financial Managers based at HQ in France and the Thematic Coordinators and Programme Managers in the field. Through regular missions in the field, his/her main functions are to:\n\n1) Represent Inter Aide and strengthening partner relations\n• Facilitate the link with institutional partners (different ministries and their decentralized entities, local authorities, etc.) and technical partners;\n• Support the head office and the Programme Managers in the negotiation, implementation and follow-up of the memoranda of understanding with institutional partners;\n• Obtaining or renewing, with the support of HQ, approvals from the authorities;\n• Facilitate and sometimes accompany field visits from HQ or partners;\n• Monitor political orientations and ensure that the actions correlate with the Sierra Leonean policy and guidelines;\n• Participate in meetings and gatherings of other actors operating in similar areas or zones in Ethiopia;\n• Participate in the preparation of activity reports for Sierra Leonean institutions in line with the established deadlines;\n• Participate in sectoral meetings organized by the government and its decentralized services (in Freetown and in the district’s capitals), as well as local authorities;\n• Participate in the promotion of Inter Aide’s models in order to influence the development of new national and local policies, in collaboration with the program managers;\n• Explore new sources of funding.\n\n2) Administrative and financial monitoring and control\n• Ensure the application of Inter Aide’s internal rules, procedures and Charter, and ensure the respect of the Sierra Leonean regulations;\n• Follow up the fund transfers from the various projects and ensure the quality of services provided by the Sierra Leonean bank;\n• Make regular visits to support the teams: ongoing training, proper filing of contracts, administrative documents, and inventory management procedures, etc.;\n• The employee is responsible for the quality of budget monitoring and accounting and financial reports;\n• In coordination with Inter Aide’s HQ, he/she compiles the administrative and financial elements required by the donors and ensures that the budget monitoring indicators are respected and controlled;\n• He/she will be responsible for the monitoring, control and consolidation of the accounts. He/she will be responsible for the accounting reports produced in the field and communicated to donors (EU, AFD, Charity Water).\n• He/she will ensure the proper preparation of internal and external audits;\n• He/she will ensure compliance with procurement procedures and the conformity of supporting documents (signing certain contracts as head of the logistics department, conducting calls for tender, drafting procurement reports and summary notes);\n• He/she is responsible for the budget allocated to common expenses (logistic and administrative);\n• He/she prepares the monthly budget forecast;\n• He/she is responsible for common purchases;\n• He/she is responsible for the monthly financial report;\n• He/she supports and trains the local administrative/logistical team so that they acquire more autonomy and rigor;\n• * He/she develops, with the teams, tools to improve the management and the logistic and administrative follow-up.\n\n3) Management of the logistics and administrative team\n\nThis project support team is composed of 26 people (including guards and drivers), spread over 3 bases (Makeni, Kamakwie, Port Loko).\n\nIn close collaboration with the Administrative and Financial Manager based at HQ, you will be responsible for supervising this team in its mission to support the projects:\n• Adapt job descriptions, set objectives and results, evaluate each team member to help them progress and improve their skills;\n• Propose salary increases, sign contracts and salary slips;\n• Coordinate the smooth operation of logistical and administrative activities;\n• Carry out regular inventories of the various stocks;\n• Ensure that the inventory tracking database is kept up to date.\n\n4) Key link between the field and HQ, as well as between the different programmes\n• Maintain regular communication with the Programme Managers as well as with HQ;\n• Develop formal and informal exchange mechanisms between programs (weekly management meetings, logistic meetings, thematic meetings, etc.)\n\n5) In close collaboration with HQ, manage the human resources of field teams\n• Manage and sign contracts for program managers and the logistic/admin team;\n• Disseminate and sign internal rules and salary scales;\n• Provide line management supervision from an administrative point of view;\n• Ensure the application of administrative and security measures taken jointly with the headquarters.\n\nPROFILE\n• Master’s degree in project management, communication, agronomy, water and sanitation\n• Skills in human resources, accounting and financial management, logistics, and administrative and legal management (short training in finance, Bioforce International Solidarity Administrator training or other relevant training)\n• At least 4 years of professional experience in a similar position or context\n• Experience working with local authorities in a similar context\n• Experience in developing countries is a plus, experience in an NGO is preferred\n• Ability to interact with different partners\n• Fluency in written and spoken English\n• Mastery of Pack Office essential\n• Methodical rigor\n• Diplomacy, humility, flexibility, dynamism, patience and tenacity\n• Resistance to cultural and linguistic isolation\n• Driving license, knowing how to drive a 125 motorcycle is a plus\n\nHow to apply\n\nSTATUS\n\n– VSI (Voluntary Service International) French status preferred – 24 months’ renewable\n\n– Allowances between 1400€ and 1650€ (depending on experience) + field allowance\n\n– Full social coverage (CFE + mutual insurance) and repatriation insurance\n\n– One return air ticket at the beginning and end of the mission + one annual return air ticket\n\n– Possibility to leave as a couple / family",
    "job_highlights": [
      {
        "items": [
          "BACKGROUND\n\nCreated in 1980, Inter Aide is an association specialized in the realization of rural development programmes, which aims to strengthen the capacities of the most vulnerable populations so that they can improve their living conditions. Inter Aide currently runs 50 programs in seven countries: Haiti, Ethiopia, Madagascar, Sierra Leone, Guinea, Malawi and Mozambique. We focus on 4 key sectors – community health, WASH (water, sanitation and hygiene) and maintenance services, agriculture, and education. In 2021, more than 193,000 beneficiary families were supported to meet their most vital needs.\n\nInter Aide has been working on rural development programmes in Sierra Leone since 2007. The programmes aims at improving access to drinking water, the functionality of water points and food security in four districts of the country.\n\nInter Aide began its operations in the North and North-West of Sierra Leone in 2007 and has developed through the years a strong field expertise that... directly involves and helps empowering local beneficiaries and actors in the following key areas:\n• Water, Sanitation and Hygiene (WASH) and maintenance services: The WASH team is in charge of building and rehabilitating about 30 water points per year and improving latrine coverage. Another specific team also works on preventive maintenance that currently covers more than 2,500 water points via a network of independent water pump technicians.\n• Family farming and food producing agriculture: The agricultural team works on the improvement of production techniques and on new cropping systems (especially horticulture).\n\nIn addition, there is a “log/admin” support department that provides transversal support to the programmes.\n\nIn total, Inter Aide’s team in Sierra Leone is composed of about 85 people.\n\nIn this context, Inter Aide is looking for a Country Representative that will be in charge of administrative, financial and logistical coordination, relations with development partners, in particular with local authorities in the capital and in the districts, communication with the head office and with the Programme Managers.\n\nHe/she will be based in the city of Makeni, Inter Aide’s headquarters in SL, with frequent travels in the field in the intervention areas and more occasionally in the capital.\n\nMISSIONS\n\nThe Country Representative works in close collaboration with the Area Managers and the Administrative and Financial Managers based at HQ in France and the Thematic Coordinators and Programme Managers in the field. Through regular missions in the field, his/her main functions are to:\n\n1) Represent Inter Aide and strengthening partner relations\n• Facilitate the link with institutional partners (different ministries and their decentralized entities, local authorities, etc.) and technical partners;\n• Support the head office and the Programme Managers in the negotiation, implementation and follow-up of the memoranda of understanding with institutional partners;\n• Obtaining or renewing, with the support of HQ, approvals from the authorities;\n• Facilitate and sometimes accompany field visits from HQ or partners;\n• Monitor political orientations and ensure that the actions correlate with the Sierra Leonean policy and guidelines;\n• Participate in meetings and gatherings of other actors operating in similar areas or zones in Ethiopia;\n• Participate in the preparation of activity reports for Sierra Leonean institutions in line with the established deadlines;\n• Participate in sectoral meetings organized by the government and its decentralized services (in Freetown and in the district’s capitals), as well as local authorities;\n• Participate in the promotion of Inter Aide’s models in order to influence the development of new national and local policies, in collaboration with the program managers;\n• Explore new sources of funding.\n\n2) Administrative and financial monitoring and control\n• Ensure the application of Inter Aide’s internal rules, procedures and Charter, and ensure the respect of the Sierra Leonean regulations;\n• Follow up the fund transfers from the various projects and ensure the quality of services provided by the Sierra Leonean bank;\n• Make regular visits to support the teams: ongoing training, proper filing of contracts, administrative documents, and inventory management procedures, etc.;\n• The employee is responsible for the quality of budget monitoring and accounting and financial reports;\n• In coordination with Inter Aide’s HQ, he/she compiles the administrative and financial elements required by the donors and ensures that the budget monitoring indicators are respected and controlled;\n• He/she will be responsible for the monitoring, control and consolidation of the accounts. He/she will be responsible for the accounting reports produced in the field and communicated to donors (EU, AFD, Charity Water).\n• He/she will ensure the proper preparation of internal and external audits;\n• He/she will ensure compliance with procurement procedures and the conformity of supporting documents (signing certain contracts as head of the logistics department, conducting calls for tender, drafting procurement reports and summary notes);\n• He/she is responsible for the budget allocated to common expenses (logistic and administrative);\n• He/she prepares the monthly budget forecast;\n• He/she is responsible for common purchases;\n• He/she is responsible for the monthly financial report;\n• He/she supports and trains the local administrative/logistical team so that they acquire more autonomy and rigor;\n• * He/she develops, with the teams, tools to improve the management and the logistic and administrative follow-up.\n\n3) Management of the logistics and administrative team\n\nThis project support team is composed of 26 people (including guards and drivers), spread over 3 bases (Makeni, Kamakwie, Port Loko).\n\nIn close collaboration with the Administrative and Financial Manager based at HQ, you will be responsible for supervising this team in its mission to support the projects:\n• Adapt job descriptions, set objectives and results, evaluate each team member to help them progress and improve their skills;\n• Propose salary increases, sign contracts and salary slips;\n• Coordinate the smooth operation of logistical and administrative activities;\n• Carry out regular inventories of the various stocks;\n• Ensure that the inventory tracking database is kept up to date.\n\n4) Key link between the field and HQ, as well as between the different programmes\n• Maintain regular communication with the Programme Managers as well as with HQ;\n• Develop formal and informal exchange mechanisms between programs (weekly management meetings, logistic meetings, thematic meetings, etc.)\n\n5) In close collaboration with HQ, manage the human resources of field teams\n• Manage and sign contracts for program managers and the logistic/admin team;\n• Disseminate and sign internal rules and salary scales;\n• Provide line management supervision from an administrative point of view;\n• Ensure the application of administrative and security measures taken jointly with the headquarters.\n\nPROFILE\n• Master’s degree in project management, communication, agronomy, water and sanitation\n• Skills in human resources, accounting and financial management, logistics, and administrative and legal management (short training in finance, Bioforce International Solidarity Administrator training or other relevant training)\n• At least 4 years of professional experience in a similar position or context\n• Experience working with local authorities in a similar context\n• Experience in developing countries is a plus, experience in an NGO is preferred\n• Ability to interact with different partners\n• Fluency in written and spoken English\n• Mastery of Pack Office essential\n• Methodical rigor\n• Diplomacy, humility, flexibility, dynamism, patience and tenacity\n• Resistance to cultural and linguistic isolation\n• Driving license, knowing how to drive a 125 motorcycle is a plus\n\nHow to apply\n\nSTATUS\n\n– VSI (Voluntary Service International) French status preferred – 24 months’ renewable\n\n– Allowances between 1400€ and 1650€ (depending on experience) + field allowance\n\n– Full social coverage (CFE + mutual insurance) and repatriation insurance\n\n– One return air ticket at the beginning and end of the mission + one annual return air ticket\n\n– Possibility to leave as a couple / family"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.interaide.org/",
        "text": "interaide.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=Inter+Aide&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCMsJ",
        "text": "See web results for Inter Aide"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNFiUwEneCPTQLBrt4dHkgXzgJH3rRBv6LxIBe&s=0",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJDT1VOVFJZIFJFUFJFU0VOVEFUSVZFIiwiaHRpZG9jaWQiOiJLcVEwam5HWEduRVJxcUREQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoic2wiLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVeFBibkJaVm10SE1FOVVkMU42UzFjNFpYUkdZMGxLVUZKMVJsQmhiVlZqUVV4eVdIcE1lVVpKY1ZWc2VEQnpWRzFyU1RsMlRucFFXRGh2VFVzeU9XZGxSRzUxU0RaVlZuSkRSRTV0YTBORlNIa3hkMkZPTkU1cGNqSnpla05VU2tWcVNFcDNRVVZLZUZGSVdqSldOVGgyUkdWbWJUaDBZMFpqU2xWNWIweDVlSFZDVkVGMmRIUTFZVU5FUnpWYWVIZFFjamcxVmtrNGFFSmpObmgxY1VObkVoYzNWRXB5V21aMU1VRjJXRlkxVG05UWFXSkxWSE5SWXhvaVFVcDNheTA0WkdreWVVdGhMWGwxU1ZKcmJUWTBhRGxCWVhCQ1RXWjFWMmswWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18zIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIE1FTkEgSm9icyIsImxpbmsiOiJodHRwczovL21lbmEtam9icy5jb20vam9iL2NvdW50cnktcmVwcmVzZW50YXRpdmUtOS8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Irrigation Expert",
    "company_name": "Ministry of Agriculture Forestry and Food security",
    "location": "  Freetown   ",
    "via": "via Find Jobs Sierra Leone",
    "description": "The Government of Sierra Leone has received a grant from the Global Agriculture and Food Security Programme (GAFSP) to finance the implementation of the Smallholder Commercialization Programme (SCP) under the supervision of the International Fund for Agriculture Development ( IFAD). The Government intends to apply part of the proceeds of the grant towards the cost of recruiting eligible individual consultants to undertake a mid-term review of the programme’s activities.\n\nThe Programme Management Unit, SCP/GAFSP, Ministry of Agriculture, Forestry and Food Security now invite the following eligible individual consultants to express their interest in providing the services.\n\nIrrigation Expert\n\nLocation: Freetown with extensive travelling in the prov inces\n\nPeriod: 30 days including 18 days on field visit in the 9 Programme Districts, 10 days for desk work in Freetown with the team\n\nmembers for drafting the MTR Aide memoire and working documents 2days for wrap up and finalization of the... Aide memoire and its report including recommendations.\n\nQualification:\n\nFirst Degree from a University with a well recognized School of Agricultural Engineering or Irrigation Technology, and a Masters Degree in Hydrology. Irrigation Economy, Irrigation Science or related fields. The Expert should have at least ten years practical experience Irrigation with emphasis on swamp irrigation and small farmer systems, and in the management of catchments and swamps Of this experience, a minimum of five years. Experience with rice production agronomic requirements would be preferred. Good skilPand experience in international standard reporting\n\nResponsibilities:\n\nThe Irrigation expert Engineer is responsible to the team leader and will report directly to her/him. S/He will assess the internal capacity of the project and the Agricultural Engineering Division Of MAFFS to design, supervise, verify and certify environmentally sustainable, practical, low cost and technically efficient field level practices to maximize the use of swamp improvements and management for rice and other food crop production systems.\n\nSpecific tasks will include, but not limited to:\n\nReviewing the swamp management techniques with a view to improving those already in use by farmers and advice on overall catchment management to enable the maintenance of an optional water cyde and minimum soil and water loss.\n\nReviewing the criteria for the identification of swamp areas for improvement /consolidation, the preparation of plans, technical designs and specifications and cost estimates for implementation.\n\nReviewing the training modules of the Agricultural Engineering Division of MAFFS for field staff in the design, field construction and maintenance of low cost swamp irrigation, flood control and drainage distribution systems.\n\nReviewing the training methodology and modules for farmer training in the techniques for proper operation and maintenance of systems.\n\nReview systems for supervision, verification and certification (if any) by the Agricultural Engineering Division of work done by Service.\n\nReviewing water and catchment management practices giving regard to available local information and previous technical studies maintained by the Agricultural Engineering Services.\n\nDivision of MAFFS and identifying means of improving these practices through field leveling, improved tillage and seed bed preparation, and through minimizing the labor input where the labor market so requires.\n\nReviewing water supply and water use patterns and monitoring data to assist the swamp irrigation users groups or associations.\n\nMake decisions with respect to water use practices and water conservation taking into account labor availability and competing demands for labor.\n\nReviewing the techniques currently used for the management of irrigated crops in different agro-ecologieal zones and devising means of improving on these in a manner that would contribute positively to the fanner welfare.\n\nThese practices will take into account labor scarcity, group/participatory management of the irrigation systems and cost recovery systems.\n\nAssessing the capacity of the SPs supported by the project to become sustainable professional entities that contribute to assist farmers in the swam valley development activities.\n\nAny other assignment that the Team Leader may deem necessary. Such additional tasks should be put in writing by the Team Leader.\n\nAt the end of his/her assignment, the Irrigation Engineer will prepare a report reviewing the performance and implementation of the Small Scale Irrigation Development component of the project and based upon his/her experience make recommendations and updated recommendation table with clear assignments, responsibilities and due date, express thoughts for strengthening the general area of activity with which he/she is involved for example the challenges and constraints in swamp development and consolidation and watershedmanagement in Sierra Leone",
    "job_highlights": [
      {
        "items": [
          "The Government of Sierra Leone has received a grant from the Global Agriculture and Food Security Programme (GAFSP) to finance the implementation of the Smallholder Commercialization Programme (SCP) under the supervision of the International Fund for Agriculture Development ( IFAD). The Government intends to apply part of the proceeds of the grant towards the cost of recruiting eligible individual consultants to undertake a mid-term review of the programme’s activities.\n\nThe Programme Management Unit, SCP/GAFSP, Ministry of Agriculture, Forestry and Food Security now invite the following eligible individual consultants to express their interest in providing the services.\n\nIrrigation Expert\n\nLocation: Freetown with extensive travelling in the prov inces\n\nPeriod: 30 days including 18 days on field visit in the 9 Programme Districts, 10 days for desk work in Freetown with the team\n\nmembers for drafting the MTR Aide memoire and working documents 2days for wrap up and finalization of the... Aide memoire and its report including recommendations.\n\nQualification:\n\nFirst Degree from a University with a well recognized School of Agricultural Engineering or Irrigation Technology, and a Masters Degree in Hydrology. Irrigation Economy, Irrigation Science or related fields. The Expert should have at least ten years practical experience Irrigation with emphasis on swamp irrigation and small farmer systems, and in the management of catchments and swamps Of this experience, a minimum of five years. Experience with rice production agronomic requirements would be preferred. Good skilPand experience in international standard reporting\n\nResponsibilities:\n\nThe Irrigation expert Engineer is responsible to the team leader and will report directly to her/him. S/He will assess the internal capacity of the project and the Agricultural Engineering Division Of MAFFS to design, supervise, verify and certify environmentally sustainable, practical, low cost and technically efficient field level practices to maximize the use of swamp improvements and management for rice and other food crop production systems.\n\nSpecific tasks will include, but not limited to:\n\nReviewing the swamp management techniques with a view to improving those already in use by farmers and advice on overall catchment management to enable the maintenance of an optional water cyde and minimum soil and water loss.\n\nReviewing the criteria for the identification of swamp areas for improvement /consolidation, the preparation of plans, technical designs and specifications and cost estimates for implementation.\n\nReviewing the training modules of the Agricultural Engineering Division of MAFFS for field staff in the design, field construction and maintenance of low cost swamp irrigation, flood control and drainage distribution systems.\n\nReviewing the training methodology and modules for farmer training in the techniques for proper operation and maintenance of systems.\n\nReview systems for supervision, verification and certification (if any) by the Agricultural Engineering Division of work done by Service.\n\nReviewing water and catchment management practices giving regard to available local information and previous technical studies maintained by the Agricultural Engineering Services.\n\nDivision of MAFFS and identifying means of improving these practices through field leveling, improved tillage and seed bed preparation, and through minimizing the labor input where the labor market so requires.\n\nReviewing water supply and water use patterns and monitoring data to assist the swamp irrigation users groups or associations.\n\nMake decisions with respect to water use practices and water conservation taking into account labor availability and competing demands for labor.\n\nReviewing the techniques currently used for the management of irrigated crops in different agro-ecologieal zones and devising means of improving on these in a manner that would contribute positively to the fanner welfare.\n\nThese practices will take into account labor scarcity, group/participatory management of the irrigation systems and cost recovery systems.\n\nAssessing the capacity of the SPs supported by the project to become sustainable professional entities that contribute to assist farmers in the swam valley development activities.\n\nAny other assignment that the Team Leader may deem necessary. Such additional tasks should be put in writing by the Team Leader.\n\nAt the end of his/her assignment, the Irrigation Engineer will prepare a report reviewing the performance and implementation of the Small Scale Irrigation Development component of the project and based upon his/her experience make recommendations and updated recommendation table with clear assignments, responsibilities and due date, express thoughts for strengthening the general area of activity with which he/she is involved for example the challenges and constraints in swamp development and consolidation and watershedmanagement in Sierra Leone"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sl&hl=en&q=Ministry+of+Agriculture+Forestry+and+Food+security&sa=X&ved=0ahUKEwi74MXO7_CCAxX1KlkFHQnZJHYQmJACCPgJ",
        "text": "See web results for Ministry of Agriculture Forestry and Food security"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJJcnJpZ2F0aW9uIEV4cGVydCIsImh0aWRvY2lkIjoieFJvc2pDRTNpcjBuaTczNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InNsIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBGaW5kIEpvYnMgU2llcnJhIExlb25lIiwibGluayI6Imh0dHBzOi8vam9ic2llcnJhbGVvbmUuc3RhbHZhLmNvbS9qb2IvaXJyaWdhdGlvbi1leHBlcnQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  }
]