[
  {
    "title": "Directeur administratif et financier West Africa Water",
    "company_name": "Swiss Fresh Water",
    "location": "  Senegal   ",
    "via": "via LinkedIn Senegal",
    "description": "Recherche Directeur Administratif et Financier\n\nDisponibilité Immédiate\n\nDakar - Sénégal\n\nWest Africa Water SA (filiale de Swiss Fresh Water SA) recherche un(e) Responsable Administratif et Financier (H/F).\n\nÀ propos de Swiss Fresh Water et West Africa Water :\n\nRejoignez une aventure entrepreneuriale ambitieuse et socialement responsable ! Swiss Fresh Water, un leader dans la fourniture d'eau de boisson de qualité à prix abordable, est engagé dans un modèle durable et respectueux de l'environnement en Afrique subsaharienne. Apprenez-en plus sur notre vision sur www.swissfreshwater.com.\n\nWest Africa Water, notre dynamique filiale au Sénégal, offre aux populations une eau de qualité supérieure, « DIAM’O », reconnue pour son goût, sa fraîcheur et sa légèreté. Nous produisons et commercialisons cette eau à travers des sites de production décentralisés, ainsi que des services de livraison via des bouteilles réutilisables commercialisées à des tarifs 2 à 5 fois moins chers que l’eau... minérale, offrant une solution écologique, économiquement viable, créatrice d’emplois et socialement engagée.\n\nVotre Mission en tant que Directeur Administratif et Financier :\n\nRattaché(e) au Directeur Général, vous pilotez la gestion financière et administrative de notre filiale, en veillant notamment à la fiabilité de notre comptabilité, à la construction et au suivi de budgets de manière rigoureuse, et à la réalisation de reportings financiers mensuels au service des équipes et de la performance, et des actionnaires. Votre expertise contribuera directement au succès de nos équipes commerciales et après-vente, grâce à un contrôle de gestion opérationnel efficace et orienté business et un contrôle interne de qualité.\n\nPrincipales Responsabilités :\n\nComptabilité fiabilisée dans les délais et reportings financiers mensuels.\n\nTravail avec l’équipe en Suisse pour la production des comptes consolidés.\n\nContrôle de gestion opérationnel et KPIs pour pilotage de la performance et communication aux investisseurs Contrôle interne, définition et contrôle des procédures\n\nGestion des chapitres administratifs notamment sociaux, juridiques et fiscaux Management des équipes comptabilité, achats et service généraux, et des partenaires externes (fiscal, juridique, audit, banques)\n\nProfil Recherché :\n\nFort intérêt pour les aspects opérationnels, orienté(e) business, “hands on”\n\nGestionnaire rigoureux(se) et agile capable d’amener de la structure dans un environnement startup.\n\nLeader énergique à l’aise dans un environnement à évolution rapide.\n\nFortes compétences analytiques et relationnelles.\n\nForce de proposition au sein du comité de direction.\n\nIntérêt pour le développement durable et l’innovation sociale.\n\nIndicateurs de performance :\n\nProduction des indicateurs financiers et analytiques, de manière fiable, et dans les temps.\n\nContrôle des coûts, contrôle interne efficace, et optimisation de la performance financière.\n\nContribution au process de levée de fond.\n\nNous cherchons un(e) candidat(e) enthousiaste, prêt(e) à s'investir dans un projet porteur de sens et d'impact. Si vous êtes motivé(e) par cette opportunité unique de contribuer à notre mission, envoyez votre CV et lettre de motivation à serge.ndao@swissfreshwater.com. Rejoignez-nous pour faire la différence et apporter de l'eau de qualité supérieure à un prix abordable à ceux qui en ont le plus besoin, tout en contribuant à construire un modèle inédit de production et distribution d’eau ",
    "job_highlights": [
      {
        "items": [
          "Recherche Directeur Administratif et Financier\n\nDisponibilité Immédiate\n\nDakar - Sénégal\n\nWest Africa Water SA (filiale de Swiss Fresh Water SA) recherche un(e) Responsable Administratif et Financier (H/F).\n\nÀ propos de Swiss Fresh Water et West Africa Water :\n\nRejoignez une aventure entrepreneuriale ambitieuse et socialement responsable ! Swiss Fresh Water, un leader dans la fourniture d'eau de boisson de qualité à prix abordable, est engagé dans un modèle durable et respectueux de l'environnement en Afrique subsaharienne. Apprenez-en plus sur notre vision sur www.swissfreshwater.com.\n\nWest Africa Water, notre dynamique filiale au Sénégal, offre aux populations une eau de qualité supérieure, « DIAM’O », reconnue pour son goût, sa fraîcheur et sa légèreté. Nous produisons et commercialisons cette eau à travers des sites de production décentralisés, ainsi que des services de livraison via des bouteilles réutilisables commercialisées à des tarifs 2 à 5 fois moins chers que l’eau... minérale, offrant une solution écologique, économiquement viable, créatrice d’emplois et socialement engagée.\n\nVotre Mission en tant que Directeur Administratif et Financier :\n\nRattaché(e) au Directeur Général, vous pilotez la gestion financière et administrative de notre filiale, en veillant notamment à la fiabilité de notre comptabilité, à la construction et au suivi de budgets de manière rigoureuse, et à la réalisation de reportings financiers mensuels au service des équipes et de la performance, et des actionnaires. Votre expertise contribuera directement au succès de nos équipes commerciales et après-vente, grâce à un contrôle de gestion opérationnel efficace et orienté business et un contrôle interne de qualité.\n\nPrincipales Responsabilités :\n\nComptabilité fiabilisée dans les délais et reportings financiers mensuels.\n\nTravail avec l’équipe en Suisse pour la production des comptes consolidés.\n\nContrôle de gestion opérationnel et KPIs pour pilotage de la performance et communication aux investisseurs Contrôle interne, définition et contrôle des procédures\n\nGestion des chapitres administratifs notamment sociaux, juridiques et fiscaux Management des équipes comptabilité, achats et service généraux, et des partenaires externes (fiscal, juridique, audit, banques)\n\nProfil Recherché :\n\nFort intérêt pour les aspects opérationnels, orienté(e) business, “hands on”\n\nGestionnaire rigoureux(se) et agile capable d’amener de la structure dans un environnement startup.\n\nLeader énergique à l’aise dans un environnement à évolution rapide.\n\nFortes compétences analytiques et relationnelles.\n\nForce de proposition au sein du comité de direction.\n\nIntérêt pour le développement durable et l’innovation sociale.\n\nIndicateurs de performance :\n\nProduction des indicateurs financiers et analytiques, de manière fiable, et dans les temps.\n\nContrôle des coûts, contrôle interne efficace, et optimisation de la performance financière.\n\nContribution au process de levée de fond.\n\nNous cherchons un(e) candidat(e) enthousiaste, prêt(e) à s'investir dans un projet porteur de sens et d'impact. Si vous êtes motivé(e) par cette opportunité unique de contribuer à notre mission, envoyez votre CV et lettre de motivation à serge.ndao@swissfreshwater.com. Rejoignez-nous pour faire la différence et apporter de l'eau de qualité supérieure à un prix abordable à ceux qui en ont le plus besoin, tout en contribuant à construire un modèle inédit de production et distribution d’eau "
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.swissfreshwater.com/en",
        "text": "swissfreshwater.com/en"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sn&hl=en&q=Swiss+Fresh+Water&sa=X&ved=0ahUKEwiNoKvM7_CCAxWWlIkEHVMEBuUQmJACCJYI",
        "text": "See web results for Swiss Fresh Water"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTKHoNItmqj7qfpEo30q5r5pGuLOrsV9sNbZkasE2U&s",
    "extensions": [
      "16 hours ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "16 hours ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJEaXJlY3RldXIgYWRtaW5pc3RyYXRpZiBldCBmaW5hbmNpZXIgV2VzdCBBZnJpY2EgV2F0ZXIiLCJodGlkb2NpZCI6IlVHNURpSkp2bjduWk9WSzNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJzbiIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVV4UGJuQlpWbVp0V1RoM2NGUXliazVFYlVZeFNFVnZiVGhWTTI1U2JXWlNUbFZYYTJ0RE5FOUNWbDlDV1c5TE1rRmtPVWc1WkZWdE1VeDZXa294VTFwT2NtUkxka3hCTm1SSWNXbFZiMUZUYzJGSlgyNHlWMnBOVDBkVmMyeE1lVlZYU1VwWFNGWmhOVFYzYlhoNGEzcDRVR1Z5ZFZCdlpFVnFXRXBETXpoTGMwSnRNRGRxZUdJMlNUWjBVSGx1ZVdaVlUxaEtOekJsVlVnMFYyNU9Ra2hGYVRWalNFUXhMVGxKZFhCWkxUZEJZMkV0V21KbkVoYzJSRXB5V2xreVRVZGFZWEJ3ZEZGUU1EUnBXWEZCTkJvaVFVcDNheTA0WTBNMFIyMXdRamRZYXpONWMxcFVaSEpRYTNoeVIyTlVWRFZCZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6Ii5uRmcyZWJ7Zm9udC13ZWlnaHQ6NTAwfS5CaTZEZGN7Zm9udC13ZWlnaHQ6NTAwfUFwcGx5IG9uIExpbmtlZEluIFNlbmVnYWwiLCJsaW5rIjoiaHR0cHM6Ly9zbi5saW5rZWRpbi5jb20vam9icy92aWV3L2RpcmVjdGV1ci1hZG1pbmlzdHJhdGlmLWV0LWZpbmFuY2llci13ZXN0LWFmcmljYS13YXRlci1hdC1zd2lzcy1mcmVzaC13YXRlci0zNzc3MTA0NjQwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Consultant: Water Specialist/Spécialiste en Eau, Senegal",
    "company_name": "EnCompass LLC",
    "location": "  Dakar   ",
    "via": "via LinkedIn Senegal",
    "description": "NOTE: Job description posted in English and French/ La description du poste est affichée en anglais et en français\n\nEnglishPosition Description\n\nEnCompass LLC is seeking a consultant to serve as Water Specialist for a performance evaluation of the NEE (Ndiyam E Ekkolaaji) Activity. We are looking for a consultant with experience with construction or rehabilitation of water and sanitation in in Senegal. The position involves may include travel within Matam region.\n\nEnCompass LLC implements the USAID-funded contract, Monitoring, Evaluation, and Learning in Senegal Platform (the Platform) in partnership with MSI. The purpose of the Platform is to support USAID/Senegal in its performance management and contribute to building a sustainable MEL culture in Senegal through holistic engagement and strengthening of local practitioners and institutions. The Platform will provide evidence-based decision-making to support adaptive management in the Mission, engage USAID partners in their efforts... to continuously improve, and provide capacity-strengthening to local partners and MEL service providers.\n\nPeriod of Performance\n• October 2023 – February 2024\n• Estimate of working days: 18\n\nPosition Duties and Responsibilities\n\nAdministration\n\nEssential functions\n• Submit a weekly progress report during the data collection phase\n\nTechnical\n• Review documents provided by USAID and other stakeholders to develop the evaluation methodology and data collection tools, and present findings from the document review.\n• Contribute to work plan development in coordination with team members, including methodology to address evaluation questions, sampling strategy, stakeholders to be interviewed, and data collection tools (interview and discussion guides)\n• Identify and conduct interviews with stakeholders identified in the workplan\n• Produce detailed interview notes after each interview\n• Contribute to data review and analyze to produce a Report for submission USAID\n• Support the development of the findings and conclusions table\n• Support the presentation of evaluation initial findings to USAID\n• Co-facilitate the workshop for the co-creation of recommendations with relevant stakeholders\n• Contribute to the writing of the evaluation report, integrating comments as needed\n• Contribute to PowerPoint development and presentation of findings for USAID\n• Any other tasks or activities necessary for the successful completion of the evaluation\n\nExpected Deliverables Include The Following\n• Desk review matrix\n• Work Plan\n• Data collection tools for the different stakeholders identified in the work plan\n• Interview notes\n• Weekly progress report during data collection phase\n• Findings and conclusions table\n• Recommendations matrix\n• PowerPoint presentation of results\n• Draft of evaluation report\n• Final evaluation report with abstract\n• All work products to be determined in consultation with the Platform team\n\nPosition Requirements\n\nQualifications\n\nAcademic Qualifications\n• Advanced degree in social sciences or relevant field with 10 years of experience in development, evaluation and/or social science research. Bachelor's degree and additional years of experience may substitute\n\nExperience and Skills?\n• Experience with managing water system in Senegal, familiarity with evaluation methodologies is an asset\n• Strong analytical, writing and synthesis skills are required\n• Advanced proficiency in French is required and fluency in English is an asset\n• Previous experience conducting assessments, evaluations, and/or research and experience with USAID an asset\n• Demonstrated experience with participatory and iterative research methods\n• Familiarity with qualitative and/or quantitative analysis software is an asset\n\nHow to Apply\n\nPlease submit CV to Senegal.recrutement@encompassworld.com with the subject line: Water Specialist by October 27, 2023.\n\nOnly short-listed candidates will be contacted\n\nThe above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.\n\nEnCompass LLC is a progressive Equal Opportunity Employer. We promote, celebrate, and support a diverse and inclusive organizational culture and workforce. We are committed to providing all of our employees with an environment free from discrimination and harassment, where all are treated with dignity and respect. We do not tolerate, and explicitly prohibit, discrimination or harassment of any kind, at any time, in all aspects of employment. This includes recruitment, hiring, promotions, disciplinary measures, terminations, compensation, benefits, social and recreational programs, and training. EnCompass also does not tolerate retaliation against individuals who report discrimination or harassment. Our continuing commitment to the principle of Equal Opportunity Employment for all means all employment decisions are based only on the job requirements, the candidate’s qualifications, and the needs of EnCompass as a business—not on race, color, ethnicity, national origin, religion, belief, sex (including pregnancy and related medical conditions), gender identity or expression, sexual orientation, age, disability status, veteran status, genetic information, HIV status, family/marital/parental status, or any other status protected by the laws and regulations in the jurisdictions where we work.\n\nFor US based positions: The employer will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990.\n\nThe above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.\n\nThe incumbent must be able to work in a fast-paced environment with demonstrated ability to juggle and prioritize multiple, competing tasks and demands and to seek supervisory assistance as appropriate.\n\nIf you require accommodations in line with the Americans with Disabilities Act to complete your application, please call 301-287-8700, provide your contact information and a description of your accessibility issue. We will make a determination on your request for reasonable accommodation on a case-by-case-basis, and we will call you back within approximately 3 business days.\n\nEEO is the Law & EEO is the Law Supplement, Pay Transparency Nondiscrimination Provision\n\nVEVRAA Notice\n\nFRENCH\n\nEnCompass LLC recherche un consultant pour servir de Spécialiste en Eau afin de faire l’évaluation du projet NEE. Nous recherchons un consultant ayant une expérience dans la construction ou la réhabilitation des points d’eau ou d’assainissement au Sénégal.\n\nLe poste peut inclure des déplacements dans la région de Matam.\n\nEnCompass LLC met en œuvre la Plateforme Monitoring, Evaluation, and Learning au Sénégal (la Plateforme), financé par l'USAID en partenariat avec MSI. L'objectif de la Plateforme est de soutenir l'USAID/Sénégal dans sa gestion des performances et de contribuer à l'instauration d'une culture MEL durable au Sénégal, grâce à un engagement holistique et au renforcement des acteurs et des institutions locales. La Plateforme facilitera la prise de décisions fondées sur des données probantes pour soutenir la gestion adaptative de la mission, engagera les partenaires de l'USAID dans leurs efforts d'amélioration continue, et fournira un renforcement des capacités aux partenaires locaux et aux fournisseurs de services MEL.\n\nDélai D'Exécution\n• Octobre 2023 – Février 2024\n• Estimation des jours de travail : 18\n\nRôles et Responsabilités\n\nFonctions essentielles\n\nAdministration\n• Soumettre un rapport hebdomadaire de progression du travail durant la phase de collecte des données sur le terrain\n\nTechnique\n• Effectuer la revue des documents fournis par l’USAID et les autres parties prenantes pour développer la méthodologie d'évaluation et des outils de collecte de données, et présenter les résultats.\n• Contribuer au développement du plan de travail avec les autres membres de l'équipe d’évaluation, notamment la méthodologie, la stratégie d’échantillonnage et l’identification des cibles et développement des outils de collecte de données (guides d'entretien et de discussion)\n• Identifier et conduire des entretiens avec les acteurs identifiés dans le plan de travail\n• Produire des notes d’entretien détaillées après chaque interview\n• Contribuer à l’examen et l’analyse des données afin de produire un rapport à soumettre à l’USAID?\n• Participer au développement de la table des constatations, et conclusions\n• Participer à la présentation des résultats préliminaires de l’évaluation à l’USAID\n• Co-faciliter l’atelier de co-création des recommandations\n• Contribuer à la rédaction du rapport d’évaluation, intégrer des commentaires si nécessaire\n• Contribuer au développement du PowerPoint des résultats finaux et de sa présentation à l'USAID\n• Toute autre tâche ou activité nécessaire pour la réussite de l’évaluation\n\nLes Livrables Attendus Sont Les Suivants\n• Matrice de la revue documentaire\n• Plan de travail\n• Outils de collecte de données pour les différentes parties prenantes identifiées dans le plan de travail\n• Notes des entretiens réalisés\n• Rapport hebdomadaire de progression de la collecte des données sur le terrain\n• Table des constatations et conclusions\n• Matrice des recommandations\n• PowerPoint de présentation des résultats\n• Draft du rapport d’évaluation\n• Version finalisée du rapport\n• Tous produits à déterminer en concertation avec l'équipe de la Plateforme\n\nExigence du Poste\n\nQualifications Académiques\n• Diplôme supérieur en sciences sociales ou dans un domaine pertinent avec 10 ans d’expérience dans le développement, les évaluations et/ou la recherche en sciences sociales. Une licence et des années d'expérience supplémentaires peuvent remplacer le diplôme\n\nExpériences et Compétences\n• Expérience avec le système de gestion de l’eau au Sénégal, familiarité avec les méthodologies d’évaluation est un plus\n• Solides compétences en matière d'analyse, de rédaction et de synthèse sont requises\n• Maîtrise avancée du français est requise, maîtrise de l’anglais est un atout\n• Expérience antérieure dans la conduite d'évaluations et/ou de recherches requise, une expérience avec l'USAID est un atout\n• Expérience avérée des méthodes de recherche participatives et itératives\n• Familiarité avec des logiciels qualitatifs et/ou quantitatifs est un atout.\n\nComment Postuler\n\nMerci de soumettre un CV à Senegal.recrutement@encompassworld.com avec pour objet : Spécialiste en Eau avant le 27 Octobre 2023.\n\nSeuls les candidats présélectionnés seront contactés\n\nLes déclarations ci-dessus ont pour but de décrire la nature générale et le niveau du travail effectué par les personnes affectées à ce poste. Ils ne constituent pas une liste exhaustive de toutes les tâches, responsabilités et compétences requises du personnel concerné",
    "job_highlights": [
      {
        "items": [
          "NOTE: Job description posted in English and French/ La description du poste est affichée en anglais et en français\n\nEnglishPosition Description\n\nEnCompass LLC is seeking a consultant to serve as Water Specialist for a performance evaluation of the NEE (Ndiyam E Ekkolaaji) Activity. We are looking for a consultant with experience with construction or rehabilitation of water and sanitation in in Senegal. The position involves may include travel within Matam region.\n\nEnCompass LLC implements the USAID-funded contract, Monitoring, Evaluation, and Learning in Senegal Platform (the Platform) in partnership with MSI. The purpose of the Platform is to support USAID/Senegal in its performance management and contribute to building a sustainable MEL culture in Senegal through holistic engagement and strengthening of local practitioners and institutions. The Platform will provide evidence-based decision-making to support adaptive management in the Mission, engage USAID partners in their efforts... to continuously improve, and provide capacity-strengthening to local partners and MEL service providers.\n\nPeriod of Performance\n• October 2023 – February 2024\n• Estimate of working days: 18\n\nPosition Duties and Responsibilities\n\nAdministration\n\nEssential functions\n• Submit a weekly progress report during the data collection phase\n\nTechnical\n• Review documents provided by USAID and other stakeholders to develop the evaluation methodology and data collection tools, and present findings from the document review.\n• Contribute to work plan development in coordination with team members, including methodology to address evaluation questions, sampling strategy, stakeholders to be interviewed, and data collection tools (interview and discussion guides)\n• Identify and conduct interviews with stakeholders identified in the workplan\n• Produce detailed interview notes after each interview\n• Contribute to data review and analyze to produce a Report for submission USAID\n• Support the development of the findings and conclusions table\n• Support the presentation of evaluation initial findings to USAID\n• Co-facilitate the workshop for the co-creation of recommendations with relevant stakeholders\n• Contribute to the writing of the evaluation report, integrating comments as needed\n• Contribute to PowerPoint development and presentation of findings for USAID\n• Any other tasks or activities necessary for the successful completion of the evaluation\n\nExpected Deliverables Include The Following\n• Desk review matrix\n• Work Plan\n• Data collection tools for the different stakeholders identified in the work plan\n• Interview notes\n• Weekly progress report during data collection phase\n• Findings and conclusions table\n• Recommendations matrix\n• PowerPoint presentation of results\n• Draft of evaluation report\n• Final evaluation report with abstract\n• All work products to be determined in consultation with the Platform team\n\nPosition Requirements\n\nQualifications\n\nAcademic Qualifications\n• Advanced degree in social sciences or relevant field with 10 years of experience in development, evaluation and/or social science research. Bachelor's degree and additional years of experience may substitute\n\nExperience and Skills?\n• Experience with managing water system in Senegal, familiarity with evaluation methodologies is an asset\n• Strong analytical, writing and synthesis skills are required\n• Advanced proficiency in French is required and fluency in English is an asset\n• Previous experience conducting assessments, evaluations, and/or research and experience with USAID an asset\n• Demonstrated experience with participatory and iterative research methods\n• Familiarity with qualitative and/or quantitative analysis software is an asset\n\nHow to Apply\n\nPlease submit CV to Senegal.recrutement@encompassworld.com with the subject line: Water Specialist by October 27, 2023.\n\nOnly short-listed candidates will be contacted\n\nThe above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.\n\nEnCompass LLC is a progressive Equal Opportunity Employer. We promote, celebrate, and support a diverse and inclusive organizational culture and workforce. We are committed to providing all of our employees with an environment free from discrimination and harassment, where all are treated with dignity and respect. We do not tolerate, and explicitly prohibit, discrimination or harassment of any kind, at any time, in all aspects of employment. This includes recruitment, hiring, promotions, disciplinary measures, terminations, compensation, benefits, social and recreational programs, and training. EnCompass also does not tolerate retaliation against individuals who report discrimination or harassment. Our continuing commitment to the principle of Equal Opportunity Employment for all means all employment decisions are based only on the job requirements, the candidate’s qualifications, and the needs of EnCompass as a business—not on race, color, ethnicity, national origin, religion, belief, sex (including pregnancy and related medical conditions), gender identity or expression, sexual orientation, age, disability status, veteran status, genetic information, HIV status, family/marital/parental status, or any other status protected by the laws and regulations in the jurisdictions where we work.\n\nFor US based positions: The employer will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990.\n\nThe above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified.\n\nThe incumbent must be able to work in a fast-paced environment with demonstrated ability to juggle and prioritize multiple, competing tasks and demands and to seek supervisory assistance as appropriate.\n\nIf you require accommodations in line with the Americans with Disabilities Act to complete your application, please call 301-287-8700, provide your contact information and a description of your accessibility issue. We will make a determination on your request for reasonable accommodation on a case-by-case-basis, and we will call you back within approximately 3 business days.\n\nEEO is the Law & EEO is the Law Supplement, Pay Transparency Nondiscrimination Provision\n\nVEVRAA Notice\n\nFRENCH\n\nEnCompass LLC recherche un consultant pour servir de Spécialiste en Eau afin de faire l’évaluation du projet NEE. Nous recherchons un consultant ayant une expérience dans la construction ou la réhabilitation des points d’eau ou d’assainissement au Sénégal.\n\nLe poste peut inclure des déplacements dans la région de Matam.\n\nEnCompass LLC met en œuvre la Plateforme Monitoring, Evaluation, and Learning au Sénégal (la Plateforme), financé par l'USAID en partenariat avec MSI. L'objectif de la Plateforme est de soutenir l'USAID/Sénégal dans sa gestion des performances et de contribuer à l'instauration d'une culture MEL durable au Sénégal, grâce à un engagement holistique et au renforcement des acteurs et des institutions locales. La Plateforme facilitera la prise de décisions fondées sur des données probantes pour soutenir la gestion adaptative de la mission, engagera les partenaires de l'USAID dans leurs efforts d'amélioration continue, et fournira un renforcement des capacités aux partenaires locaux et aux fournisseurs de services MEL.\n\nDélai D'Exécution\n• Octobre 2023 – Février 2024\n• Estimation des jours de travail : 18\n\nRôles et Responsabilités\n\nFonctions essentielles\n\nAdministration\n• Soumettre un rapport hebdomadaire de progression du travail durant la phase de collecte des données sur le terrain\n\nTechnique\n• Effectuer la revue des documents fournis par l’USAID et les autres parties prenantes pour développer la méthodologie d'évaluation et des outils de collecte de données, et présenter les résultats.\n• Contribuer au développement du plan de travail avec les autres membres de l'équipe d’évaluation, notamment la méthodologie, la stratégie d’échantillonnage et l’identification des cibles et développement des outils de collecte de données (guides d'entretien et de discussion)\n• Identifier et conduire des entretiens avec les acteurs identifiés dans le plan de travail\n• Produire des notes d’entretien détaillées après chaque interview\n• Contribuer à l’examen et l’analyse des données afin de produire un rapport à soumettre à l’USAID?\n• Participer au développement de la table des constatations, et conclusions\n• Participer à la présentation des résultats préliminaires de l’évaluation à l’USAID\n• Co-faciliter l’atelier de co-création des recommandations\n• Contribuer à la rédaction du rapport d’évaluation, intégrer des commentaires si nécessaire\n• Contribuer au développement du PowerPoint des résultats finaux et de sa présentation à l'USAID\n• Toute autre tâche ou activité nécessaire pour la réussite de l’évaluation\n\nLes Livrables Attendus Sont Les Suivants\n• Matrice de la revue documentaire\n• Plan de travail\n• Outils de collecte de données pour les différentes parties prenantes identifiées dans le plan de travail\n• Notes des entretiens réalisés\n• Rapport hebdomadaire de progression de la collecte des données sur le terrain\n• Table des constatations et conclusions\n• Matrice des recommandations\n• PowerPoint de présentation des résultats\n• Draft du rapport d’évaluation\n• Version finalisée du rapport\n• Tous produits à déterminer en concertation avec l'équipe de la Plateforme\n\nExigence du Poste\n\nQualifications Académiques\n• Diplôme supérieur en sciences sociales ou dans un domaine pertinent avec 10 ans d’expérience dans le développement, les évaluations et/ou la recherche en sciences sociales. Une licence et des années d'expérience supplémentaires peuvent remplacer le diplôme\n\nExpériences et Compétences\n• Expérience avec le système de gestion de l’eau au Sénégal, familiarité avec les méthodologies d’évaluation est un plus\n• Solides compétences en matière d'analyse, de rédaction et de synthèse sont requises\n• Maîtrise avancée du français est requise, maîtrise de l’anglais est un atout\n• Expérience antérieure dans la conduite d'évaluations et/ou de recherches requise, une expérience avec l'USAID est un atout\n• Expérience avérée des méthodes de recherche participatives et itératives\n• Familiarité avec des logiciels qualitatifs et/ou quantitatifs est un atout.\n\nComment Postuler\n\nMerci de soumettre un CV à Senegal.recrutement@encompassworld.com avec pour objet : Spécialiste en Eau avant le 27 Octobre 2023.\n\nSeuls les candidats présélectionnés seront contactés\n\nLes déclarations ci-dessus ont pour but de décrire la nature générale et le niveau du travail effectué par les personnes affectées à ce poste. Ils ne constituent pas une liste exhaustive de toutes les tâches, responsabilités et compétences requises du personnel concerné"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sn&hl=en&q=EnCompass+LLC&sa=X&ved=0ahUKEwiNoKvM7_CCAxWWlIkEHVMEBuUQmJACCMUI",
        "text": "See web results for EnCompass LLC"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR3s_DpMzDMADgcvIQF21K-51mjZ2LIQus-JxU3Ryc&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50OiBXYXRlciBTcGVjaWFsaXN0L1Nww6ljaWFsaXN0ZSBlbiBFYXUsIFNlbmVnYWwiLCJodGlkb2NpZCI6InlhUHVvZFRHRzR0UXY5emtBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJzbiIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4gU2VuZWdhbCIsImxpbmsiOiJodHRwczovL3NuLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvY29uc3VsdGFudC13YXRlci1zcGVjaWFsaXN0LXNwJUVGJUJGJUJEJUVGJUJGJUJEY2lhbGlzdGUtZW4tZWF1LXNlbmVnYWwtYXQtZW5jb21wYXNzLWxsYy0zNzQ2ODcxNDU1P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Systems Strengthening Director | Dakar, Senegal | 2023",
    "company_name": "Chemonics",
    "location": "  Dakar   ",
    "via": "via MENA Jobs",
    "description": "Chemonics seeks a systems strengthening director for the anticipated USAID Water, Sanitation and Hygiene activity in Senegal. The purpose of this new activity is to increase sustainable access to improved sanitation and water services while increasing consumer demand The systems strengthening director will deploy a systems approach to develop and lead interventions to strengthen factors (including regulation, service provision, technology, and accountability mechanisms), capacity of actors (including communities, local government, private and public institutions, households, and development agencies), and their relationships to improve the quality and accessibility of WASH services in Senegal. They will work closely with national-level stakeholders and local counterparts to identify, co-develop, and implement sustainable WASH approaches and interventions. This position will be based in Dakar, Senegal, with frequent travel to target activity zones throughout Senegal.\n\nChemonics... International Inc. is a US-based international development consulting company, operating in over 95 countries. We are looking for individuals who have a passion for making a difference in the lives of people around the world.\n\nResponsibilities:\n• Serve as lead for technical component leading all WASH systems strengthening, working closely with counterparts from the Government of Senegal, private sector actors, and the Activity’s implementing partners to develop and manage effective and responsive interventions\n• Determine technical needs and priorities to support activity implementation, such as:\n• Upgrading, rehabilitating, or building low-tech, decentralized wastewater systems and delivery of associated capacity strengthening for system operators\n• Water resource interventions that prevent or mitigate flooding, increase water storage, and strengthen early warning systems\n• Linking/facilitating spare parts and consumables supply chains\n• Management information systems for asset management, water resources data, water resource mapping\n• Work across teams to ensure the perspectives and voices of women, youth, and underrepresented or underserved groups are integral to the activity’s implementation\n\nQualifications:\n• Advanced degree in international affairs, international development, water management, global public health, or another relevant field\n• Minimum of 10 years of relevant professional experience implementing WASH programs or strengthening WASH systems, particularly in the following technical areas: water production, transmission, and distribution; utility services strengthening; adaptation for climate resilient infrastructure; sewered sanitation networks; wastewater treatment; sludge management; water treatment systems; operations and maintenance; asset management; and capital investment planning\n• Demonstrated leadership, versatility, and integrity\n• Fluency in English required, additional language skills preferred\n\nHow to apply\n\nApplication instructions:\n\nPlease send an email with your updated CV, cover letter, and the contact information of three professional references attached and “Systems Strengthening Director Senegal WASH Activity” in the subject line to Mr. Luca DiDomenico at ldidomenico@chemonics.com by March 17, 2023. No telephone inquiries, please. Chemonics will contact finalists.\n\nChemonics is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity, marital status, disability, genetic information, age, membership in an employee organization, or other non-merit factors.\n\nChemonics values the protection of your personal data. If you are in the European Union, please read our EU Recruiting Data Privacy Notice to learn how we process personal data. You may access the notice via the following link: https://chemonics.com/eu-recruiting-data-privacy-notice",
    "job_highlights": [
      {
        "items": [
          "Chemonics seeks a systems strengthening director for the anticipated USAID Water, Sanitation and Hygiene activity in Senegal. The purpose of this new activity is to increase sustainable access to improved sanitation and water services while increasing consumer demand The systems strengthening director will deploy a systems approach to develop and lead interventions to strengthen factors (including regulation, service provision, technology, and accountability mechanisms), capacity of actors (including communities, local government, private and public institutions, households, and development agencies), and their relationships to improve the quality and accessibility of WASH services in Senegal. They will work closely with national-level stakeholders and local counterparts to identify, co-develop, and implement sustainable WASH approaches and interventions. This position will be based in Dakar, Senegal, with frequent travel to target activity zones throughout Senegal.\n\nChemonics... International Inc. is a US-based international development consulting company, operating in over 95 countries. We are looking for individuals who have a passion for making a difference in the lives of people around the world.\n\nResponsibilities:\n• Serve as lead for technical component leading all WASH systems strengthening, working closely with counterparts from the Government of Senegal, private sector actors, and the Activity’s implementing partners to develop and manage effective and responsive interventions\n• Determine technical needs and priorities to support activity implementation, such as:\n• Upgrading, rehabilitating, or building low-tech, decentralized wastewater systems and delivery of associated capacity strengthening for system operators\n• Water resource interventions that prevent or mitigate flooding, increase water storage, and strengthen early warning systems\n• Linking/facilitating spare parts and consumables supply chains\n• Management information systems for asset management, water resources data, water resource mapping\n• Work across teams to ensure the perspectives and voices of women, youth, and underrepresented or underserved groups are integral to the activity’s implementation\n\nQualifications:\n• Advanced degree in international affairs, international development, water management, global public health, or another relevant field\n• Minimum of 10 years of relevant professional experience implementing WASH programs or strengthening WASH systems, particularly in the following technical areas: water production, transmission, and distribution; utility services strengthening; adaptation for climate resilient infrastructure; sewered sanitation networks; wastewater treatment; sludge management; water treatment systems; operations and maintenance; asset management; and capital investment planning\n• Demonstrated leadership, versatility, and integrity\n• Fluency in English required, additional language skills preferred\n\nHow to apply\n\nApplication instructions:\n\nPlease send an email with your updated CV, cover letter, and the contact information of three professional references attached and “Systems Strengthening Director Senegal WASH Activity” in the subject line to Mr. Luca DiDomenico at ldidomenico@chemonics.com by March 17, 2023. No telephone inquiries, please. Chemonics will contact finalists.\n\nChemonics is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity, marital status, disability, genetic information, age, membership in an employee organization, or other non-merit factors.\n\nChemonics values the protection of your personal data. If you are in the European Union, please read our EU Recruiting Data Privacy Notice to learn how we process personal data. You may access the notice via the following link: https://chemonics.com/eu-recruiting-data-privacy-notice"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://chemonics.com/",
        "text": "chemonics.com"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sn&hl=en&q=Chemonics&sa=X&ved=0ahUKEwiNoKvM7_CCAxWWlIkEHVMEBuUQmJACCPQI",
        "text": "See web results for Chemonics"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTaW_kv6gVOScUAdrVkWoKrbcaYWnG11k74rSil&s=0",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTeXN0ZW1zIFN0cmVuZ3RoZW5pbmcgRGlyZWN0b3IgfCBEYWthciwgU2VuZWdhbCB8IDIwMjMiLCJodGlkb2NpZCI6InNWMVB0RXcwWS15bkt1T1RBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJzbiIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVV4UGJuQlpWMDlsWDJGcWVYUXpNMlpvWjA1cWNFTTViRlpvZGpSbE4yZE5hbWxNV0RaWGVtdFBTbFp6Tm5wR2Jta3dhbnB6VlhWTWJrSTBVVTV5YzBsRVRVZE9WMDVxZEU5dFp6VkpNbUpDZFhsRGRucEJhMEk1UVZkSlVIbFdUbmxtV2kwMFVrUmpjbFJWTmtwNVQzSnVaVnB6TURodFZXUlpjbVJ4V21GV2VtUjZRV1ZSZWxkaWJDMXNUVFZxVDE5c1prTXdOamx6WDFScE0zSnNaVk5uRWhjMlJFcHlXbGt5VFVkYVlYQndkRkZRTURScFdYRkJOQm9pUVVwM2F5MDRZMEpQZFRsZlRYWlpNVXd0YkhaTWFFSmxlRFJKTldFdE16bG1VUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTUVOQSBKb2JzIiwibGluayI6Imh0dHBzOi8vbWVuYS1qb2JzLmNvbS9qb2Ivc3lzdGVtcy1zdHJlbmd0aGVuaW5nLWRpcmVjdG9yLWRha2FyLXNlbmVnYWwtMjAyMy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Humanitarian Water, Sanitation and Hygiene Adviso",
    "company_name": "Senjob",
    "location": "  Dakar   ",
    "via": "via Social Media Job Opportunities",
    "description": "Contract length: 1 year renewableChild safeguardingLevel 3: the post holder will have contact with children and/or young people either frequently (e.g. once a week or more) or intensively (e.\n\ng. four days in one month or more or overnight) because they work country programs; or are visiting country programs; or because they are responsible f.....",
    "job_highlights": [
      {
        "items": [
          "Contract length: 1 year renewableChild safeguardingLevel 3: the post holder will have contact with children and/or young people either frequently (e.g. once a week or more) or intensively (e.\n\ng. four days in one month or more or overnight) because they work country programs; or are visiting country programs; or because they are responsible f....."
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sn&hl=en&q=Senjob&sa=X&ved=0ahUKEwiNoKvM7_CCAxWWlIkEHVMEBuUQmJACCKQJ",
        "text": "See web results for Senjob"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-tlk4ekNhQqep5g_kMp1Kxg3-ulO-ft_c884nqHI&s",
    "extensions": [
      "6 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "6 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJIdW1hbml0YXJpYW4gV2F0ZXIsIFNhbml0YXRpb24gYW5kIEh5Z2llbmUgQWR2aXNvIiwiaHRpZG9jaWQiOiJVN3dGSTRWNGJ0R3FjQVM5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoic24iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFNvY2lhbCBNZWRpYSBKb2IgT3Bwb3J0dW5pdGllcyIsImxpbmsiOiJodHRwczovL3NvY2lhbG1lZGlham9ib3Bwb3J0dW5pdGllcy5pbmZvL2pvYi9odW1hbml0YXJpYW4td2F0ZXItc2FuaXRhdGlvbi1hbmQtaHlnaWVuZS1hZHZpc28tZGFrYXItc2Vuam9iLWY5OGVjZjY4ODAvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "ONG ACCESS TO WATER recrute 01 Secrétaire Comptable.",
    "company_name": "ONG ACCESS TO WATER",
    "location": "  Dakar   ",
    "via": "via Talent.com",
    "description": "ONG ACCESS TO WATER recrute 01 Secrétaire Comptable H / F\n\nEntreprise\n\nONG ACCESS TO WATER\n\nDescription de l’entreprise\n\nL’ONG Access To Water mène des programmes d’accès à l’eau gratuite au Sénégal, en installant des systèmes de traitement lire la suite\n\nDétails de l’annonce\n\nPoste proposé : Secrétaire Comptable H / F\n\nMissions : Secrétariat :\n\nSecrétariat :\n• Gestions des échanges entre l’ONG et les partenaires, suivi des contrats de partenariats,\n• Suivi du stock de matériel\n• Suivi des actions de maintenance.\n\nComptabilité :\n• Tenir la comptabilité générale, des débiteurs et des créanciers\n• Tenir du journal de caisse, des frais courants\n• Saisir les décomptes d’heures du personnel et leurs frais\n• Contrôle et saisir les décomptes d’heures du personnel et leurs frais.\n\nProfil recherché pour le poste : Secrétaire Comptable H / F\n\nQualifications :\n• Niveau Bac+2 en Comptabilité\n• Avec 2 ans d’expériences sur le terrain\n• Maîtrise des logiciels de Microsoft : Excel, Word... PowerPoint\n• Bon niveau professionnel en français, écrit et parlé,\n• La compréhension de la langue anglaise est un plus, mais pas obligatoire.\n• Un réel intérêt pour les projets de l’ONG.\n\nCritères de l’annonce pour le poste : Secrétaire Comptable H / F",
    "job_highlights": [
      {
        "items": [
          "ONG ACCESS TO WATER recrute 01 Secrétaire Comptable H / F\n\nEntreprise\n\nONG ACCESS TO WATER\n\nDescription de l’entreprise\n\nL’ONG Access To Water mène des programmes d’accès à l’eau gratuite au Sénégal, en installant des systèmes de traitement lire la suite\n\nDétails de l’annonce\n\nPoste proposé : Secrétaire Comptable H / F\n\nMissions : Secrétariat :\n\nSecrétariat :\n• Gestions des échanges entre l’ONG et les partenaires, suivi des contrats de partenariats,\n• Suivi du stock de matériel\n• Suivi des actions de maintenance.\n\nComptabilité :\n• Tenir la comptabilité générale, des débiteurs et des créanciers\n• Tenir du journal de caisse, des frais courants\n• Saisir les décomptes d’heures du personnel et leurs frais\n• Contrôle et saisir les décomptes d’heures du personnel et leurs frais.\n\nProfil recherché pour le poste : Secrétaire Comptable H / F\n\nQualifications :\n• Niveau Bac+2 en Comptabilité\n• Avec 2 ans d’expériences sur le terrain\n• Maîtrise des logiciels de Microsoft : Excel, Word... PowerPoint\n• Bon niveau professionnel en français, écrit et parlé,\n• La compréhension de la langue anglaise est un plus, mais pas obligatoire.\n• Un réel intérêt pour les projets de l’ONG.\n\nCritères de l’annonce pour le poste : Secrétaire Comptable H / F"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=sn&hl=en&q=ONG+ACCESS+TO+WATER&sa=X&ved=0ahUKEwiNoKvM7_CCAxWWlIkEHVMEBuUQmJACCNIJ",
        "text": "See web results for ONG ACCESS TO WATER"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJPTkcgQUNDRVNTIFRPIFdBVEVSIHJlY3J1dGUgMDEgU2VjcsOpdGFpcmUgQ29tcHRhYmxlLiIsImh0aWRvY2lkIjoiVFU2aGdUbnN0SU5rdHAzRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InNuIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBUYWxlbnQuY29tIiwibGluayI6Imh0dHBzOi8vc24udGFsZW50LmNvbS92aWV3P2lkPWRhNWZmMTYwYjAwYVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  }
]