[
  {
    "title": "Water and Sanitation Technologist",
    "company_name": "Zambia Airports Corporation Limited",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\nZambia Airports Corporation Limited is a reputable aviation organisation with a mission to provide world class Airport and Air Navigation Services at the four major airports namely, Kenneth Kaunda in Lusaka, Simon Mwansa Kapwepwe in Ndola, Harry Mwaanga Nkumbula in Livingstone, and Mfuwe International Airport and Ten (10) Provincial and Strategic Airports. Applications are invited from suitably qualified and experienced Zambian nationals with a vision to excel in the following position:\nVacancies WATER AND SANITATION TECHNOLOGIST\nThis role reports to the Civil Engineer. The job holder will be responsible foroversee the extraction and treatment of groundwater before distribution, and maintenance of the water and wastewater reticulation system.\n\nKey Performance Areas\n• Head of the Water and wastewater Unit.\n• Prepares Water and Sanitation Unit budget as part of the overall Civil Engineering annual Budget;\n• Analyzes and advises on the maintenance of water supply systems... including source development, treatment, storage and distribution.\n• Analyzes and advises on the maintenance of wastewater systems, including collection, treatment and disposal.\n• Coordinates and monitors day to day treatment processes for water and wastewater to ensure compliance;\n• Prepares maintenance plans for water supply systems, water and waste water treatment systems, water storage facilities, pumps, and control panels of equipment.\n• Monitors and ensures adequate stock levels of spare parts for water supply and sewerage works and control panels as well as necessary tools and equipment and provides lists of periodic requirement of the same well in advance for the purpose of raising requisitions.\n• Supervises works related to the installation and maintenance of sanitation facilities such as: ablution units, field toilets, kitchen and laundries\n• Carries out inspections to check boreholes, pumps, storage tanks, motors, filters, chlorinators, distribution networks and sewage systems; monitor and read gauges, meters and other recording instruments to detect equipment malfunctions and ensure plant systems and equipment are operating within prescribed limits;\n• Supervise and guide artisans on particular tasks to ensure adherence to specifications and good workmanship.\n• Estimate and Budget cost of carrying out particular works and services for management to take further action.\n• Design and estimate cost of water networks and structures as required by management through the Civil Engineer.\n• Raises requisitions for the procurement of Water, Environmental and Sanitation goods and services through the Civil Engineer\n• Any other duties assigned.\n\nQUALIFICATION\n• Grade 12 School Certificate with 6 ‘0’ Level passes and Credits in English, Mathematics and Science\n• Diploma – Water Engineering, Civil or Equivalent\n• Computer Literate to include engineering software.\n\nEXPERIENCE\n● At least 3years in the Water Supply Industry\n\nPROFESSIONAL MEMBERSHIP\n• Professional Member of the Engineering Institution of Zambia.\n\nWork Hours: 8\n\nExperience in Months: 36\n\nLevel of Education: Postgraduate Degree",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\nZambia Airports Corporation Limited is a reputable aviation organisation with a mission to provide world class Airport and Air Navigation Services at the four major airports namely, Kenneth Kaunda in Lusaka, Simon Mwansa Kapwepwe in Ndola, Harry Mwaanga Nkumbula in Livingstone, and Mfuwe International Airport and Ten (10) Provincial and Strategic Airports. Applications are invited from suitably qualified and experienced Zambian nationals with a vision to excel in the following position:\nVacancies WATER AND SANITATION TECHNOLOGIST\nThis role reports to the Civil Engineer. The job holder will be responsible foroversee the extraction and treatment of groundwater before distribution, and maintenance of the water and wastewater reticulation system.\n\nKey Performance Areas\n• Head of the Water and wastewater Unit.\n• Prepares Water and Sanitation Unit budget as part of the overall Civil Engineering annual Budget;\n• Analyzes and advises on the maintenance of water supply systems... including source development, treatment, storage and distribution.\n• Analyzes and advises on the maintenance of wastewater systems, including collection, treatment and disposal.\n• Coordinates and monitors day to day treatment processes for water and wastewater to ensure compliance;\n• Prepares maintenance plans for water supply systems, water and waste water treatment systems, water storage facilities, pumps, and control panels of equipment.\n• Monitors and ensures adequate stock levels of spare parts for water supply and sewerage works and control panels as well as necessary tools and equipment and provides lists of periodic requirement of the same well in advance for the purpose of raising requisitions.\n• Supervises works related to the installation and maintenance of sanitation facilities such as: ablution units, field toilets, kitchen and laundries\n• Carries out inspections to check boreholes, pumps, storage tanks, motors, filters, chlorinators, distribution networks and sewage systems; monitor and read gauges, meters and other recording instruments to detect equipment malfunctions and ensure plant systems and equipment are operating within prescribed limits;\n• Supervise and guide artisans on particular tasks to ensure adherence to specifications and good workmanship.\n• Estimate and Budget cost of carrying out particular works and services for management to take further action.\n• Design and estimate cost of water networks and structures as required by management through the Civil Engineer.\n• Raises requisitions for the procurement of Water, Environmental and Sanitation goods and services through the Civil Engineer\n• Any other duties assigned.\n\nQUALIFICATION\n• Grade 12 School Certificate with 6 ‘0’ Level passes and Credits in English, Mathematics and Science\n• Diploma – Water Engineering, Civil or Equivalent\n• Computer Literate to include engineering software.\n\nEXPERIENCE\n● At least 3years in the Water Supply Industry\n\nPROFESSIONAL MEMBERSHIP\n• Professional Member of the Engineering Institution of Zambia.\n\nWork Hours: 8\n\nExperience in Months: 36\n\nLevel of Education: Postgraduate Degree"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Zambia+Airports+Corporation+Limited&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCJUI",
        "text": "See web results for Zambia Airports Corporation Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTopF3LUbujc-rkA5s_2KFA-AN3qL1G6WVW2tvXeR9IfVgzjz3OVJVv5Ho&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBhbmQgU2FuaXRhdGlvbiBUZWNobm9sb2dpc3QiLCJodGlkb2NpZCI6IkpXX1BvMjh4S0ZpMDJ4R0ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVV4UGJuQlpXRE5GZWxjdFNraE9aM0pWWjFoUlEwVjZZMGhTVkU5VmJ6bHBTWGRVWkcxbVJXOTJWMHRpUkhGbFRGcDJTR0pvYVdkalVYaDZVR0ZXZEUxbGEyaGlOVEp4Y1dKU1dVRm5hMjVrUWw5dVMwSnFibkowVUhWcU0yZHNhbUV0YjFKM1VFNVFiWHBHZUhsUE5IWklXWFZSYWxwd1JqaGpYMDFMYlZNMWEyOURURWw0VDJaRmMxOTVZV2xHVW5OTFF6UmhWRFpwV1dWdFMxZHBiaTFUU21VMmVWRjJNekExUVZSTGJEWm9NRTFQU0RFelRFeG9aRGhEV2t4SmRHOUJja1poVFhOR2NYUlhSMko2WnpCNlRVOVpkVTVhUzFSNlUxUnZUREpPWnhJWFJucE9jbHBsVkhkR1NqWnJhVXhOVURKamRXSjFRVzhhSWtGS2Qyc3RPR1l4V0doSldrdzBjbVZ2V1dSSFYyVXdPRzFwZUd0VlV6VlVTRUUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6Ii5uRmcyZWJ7Zm9udC13ZWlnaHQ6NTAwfS5CaTZEZGN7Zm9udC13ZWlnaHQ6NTAwfUFwcGx5IG9uIEdyZWF0IFphbWJpYSBKb2JzIiwibGluayI6Imh0dHBzOi8vd3d3LmdyZWF0emFtYmlham9icy5jb20vam9icy9qb2ItZGV0YWlsL2pvYi1XYXRlci1hbmQtU2FuaXRhdGlvbi1UZWNobm9sb2dpc3Qtam9iLWF0LVphbWJpYS1BaXJwb3J0cy1Db3Jwb3JhdGlvbi1MaW1pdGVkLTQ3MzUzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Water, Sanitation and Hygiene (WASH) Officer",
    "company_name": "UNICEF",
    "location": "  Lusaka   ",
    "via": "via Jobs Mu Zambia",
    "description": "General\n\nDescription of assignment title:\n\nWater, Sanitation and Hygiene (WASH) Officer\n\nAssignment country\n\nZambia\n\nExpected start date\n\n09/01/2023\n\nSustainable Development Goal\n\n6. Clean water and sanitation\n\nVolunteer category\n\nNational UN Volunteer Specialist\n\nDoA reserved for persons with disabilities\n\nNo\n\nHost entity\n\nUNICEF\n\nType\n\nOnsite\n\nDuration\n\n24 months\n\nNumber of assignments\n\n1\n\nDuty stations\n\nLusaka\n\nDetails\n\nMission and objectives\n\nUNICEF helps build a world where the rights of every child are fully realized. It is our conviction that nurturing and caring for children are the cornerstones of human progress. UNICEF was created in 1946 to work with others to overcome the obstacles that poverty, violence, disease and discrimination place in a child’s path. It has global authority to influence decision-makers, and a wide variety of partners at grassroots level to turn the most innovative ideas into reality.\n\nFor 70 years, UNICEF has been working on the ground in 190... countries and territories to promote children’s survival, protection and development. The world’s largest provider of vaccines for developing countries, UNICEF supports child health and nutrition, good water and sanitation, quality basic education for all boys and girls, and the protection of children from violence, exploitation, and AIDS. UNICEF is funded entirely by the voluntary contributions of individuals, businesses, foundations and Governments.\n\nContext\n\nZambia is located in Southern African and has a population of approximately 18 million people . A survey conducted in 2018 indicated that 15% of children under the age of 5 years in Zambia had diarrhoea within the two weeks prior to the survey and 34.6% were stunted. Global evidence shows linkages between consumption of poor-quality water, diarrhoea and waterborne diseases and may contribute to child stunting.\n\nThe UN Volunteer will support the Water, Sanitation and Hygiene (WASH) section focusing on providing water and sanitation support to provincial and district government counterparts, whilst facilitating ground level work for contractors and consultants on WASH activities.\n\nTask description\n\nUnder the overall supervision of the UNICEF WASH Specialist, the UN Volunteer will undertake the following tasks:\n\n• Monitor UNICEF funded end-use, private sector, construction, and behavior change work at the village level;\n\n• Engage district governments counterparts on matters related to UNICEF WASH activities;\n\n• Coordinate field aspects of youth engagement changemaker workshops with UNICEF “YES” team;\n\n• Facilitate village, district, and provincial WASH level work for UNICEF contractors and consultants;\n\n• Act as a Liaison with contractors leading household water quality, handwashing, menstrual hygiene, and sanitation private sector engagement activities;\n\n• Conduct Knowledge management activities, such as: summarizing information in graphic format, map locations of work for donor reports, write monitoring reports, contribute to SharePoint tracking documents/files and draft knowledge management articles;\n\n• Perform other tasks related to service delivery as assigned.\n\nEligibility criteria\n\nAge\n\n27 – 80\n\nNationality\n\nCandidate must be a national or legal resident of the country of assignment.\n\nRequirements\n\nRequired experience\n\n3 years of experience in WASH, community development, private sector development, youth engagement, or behavior change;\n\n• Demonstrated interest/experience in Community Development, Behavior Change, Youth Engagement, Entrepreneurship, Adult Education, Water, Sanitation, Hygiene, and Menstrual Hygiene activities;\n\n• Advanced computer skills (i.e., Word, Excel, PowerPoint, Microsoft Calendar, Social media, and others) is required. Ability to create maps in google earth, mwater, or GIS is an added advantage;\n\n• Demonstrated dedication to rural development, and equity and inclusion;\n\n• Experience with Household water treatment, sanitation business development, WASH in healthcare facilities, WASH linkages to nutrition and local government, WASH and climate change, and commercial water utility experience would be an added asset;\n\n• Professionalism and ability to work with partner organizations including government at the provincial and district levels;\n\n• Motivated to contribute towards peace and development and to serve others;\n\n• Excellent interpersonal, networking and communication (verbal and written) skills;\n\n• Planning and organizing skills;\n\n• Willingness to contribute and work as part of a team;\n\n• Flexible and open to learning and new experiences;\n\n• Ability to gather and analysis data and conduct research;\n\n• Respect for diversity and adaptability to other cultures, environments and living conditions;\n\n• Fluency in spoken and written English language is required;\n\n• Demonstration of high-quality written English, such as published papers is an advantage;\n\n• Previous experience as a volunteer and/or experience of another culture, (i.e., studies, volunteer work, internship) would be highly regarded.\n\nArea(s) of expertise\n\nDevelopment programmes\n\nDriving license\n\n–\n\nLanguages\n\nEnglish, Level: Fluent, Desirable\n\nRequired education level\n\nBachelor degree or equivalent in Public Health, Environmental Health, Community Development, Development Sciences or related fields.\n\nCompetencies and values\n\n• Accountability\n\n• Adaptability and Flexibility\n\n• Commitment and Motivation\n\n• Commitment to Continuous Learning\n\n• Communication\n\n• Ethics and Values\n\n• Integrity\n\n• Knowledge Sharing\n\n• Planning and Organizing\n\n• Professionalism\n\n• Respect for Diversity\n\n• Technological Awareness\n\n• Working in Teams\n\nOther information\n\nLiving conditions and remarks\n\nZambia is a landlocked, middle-income country with a population estimated at 18 million. Lusaka became the capital city of Zambia in May 1935. Lusaka’s central position in Zambia and its pleasant climate were two of the main reasons for its selection as the capital. It is a metropolis, which provides a home to about two and nine million (2.9m) inhabitants of different nationalities. It has grown to become the seat of the Government of the Republic of Zambia and as such all diplomatic missions, international organizations, industrial and commercial entities are based there. Its political, social, economic, and cultural significance has also increased through the years. Public transport is provided by private operators using minibuses and taxis. The bus routes are not mapped, and roads are less congested. Good modern housing for rent is available on the open market. The official language is English, which is widely spoken. The country is generally food secure, with sufficient local fresh fruits and vegetables available in the markets, as well as various dairy, poultry, and meat products. There are several international schools using the Cambridge GCSE or IGCSE syllabi, from key stage one through to A levels. Health conditions are generally good, although malaria is prevalent. Zambia is generally a safe place to live in, although not free of crime. Some prudence is required. For more info, visit: http://www.zambiatourism.com; https://www.unv.org/.\n\nInclusivity statement\n\nUnited Nations Volunteers is an equal opportunity programme that welcomes applications from qualified professionals. We are committed to achieving diversity in terms of gender, care protected characteristics. As part of their adherence to the values of UNV, all UN Volunteers commit themselves to combat any form of discrimination, and to promoting respect for human rights and individual dignity, without distinction of a person’s race, sex, gender identity, religion, nationality, ethnic origin, sexual orientation, disability, pregnancy, age, language, social origin or other status.\n\nReasonable accommodation\n\nUNICEF offers reasonable accommodation for UN Volunteers with disabilities. This may include, for example, accessible software, travel assistance for missions or personal attendants. We encourage you to disclose your disability during your application in case you need reasonable accommodation during the recruitment process and afterwards in your assignment.\n\nNote on Covid-19 vaccination requirements\n\nIn addition to duty station-specific vaccine requirements, appointments are subject to confirmation of fully-vaccinated status against SARS-CoV-2 (Covid-19) with a World Health Organization (WHO)-endorsed vaccine, which must be met prior to taking up the appointment. It does not apply to UN Volunteers who will work remotely and are not expected to work on or visit UNICEF premises, programme delivery locations or directly interact with communities UNICEF works with, nor to travel to perform functions for UNICEF for the duration of their contracts",
    "job_highlights": [
      {
        "items": [
          "General\n\nDescription of assignment title:\n\nWater, Sanitation and Hygiene (WASH) Officer\n\nAssignment country\n\nZambia\n\nExpected start date\n\n09/01/2023\n\nSustainable Development Goal\n\n6. Clean water and sanitation\n\nVolunteer category\n\nNational UN Volunteer Specialist\n\nDoA reserved for persons with disabilities\n\nNo\n\nHost entity\n\nUNICEF\n\nType\n\nOnsite\n\nDuration\n\n24 months\n\nNumber of assignments\n\n1\n\nDuty stations\n\nLusaka\n\nDetails\n\nMission and objectives\n\nUNICEF helps build a world where the rights of every child are fully realized. It is our conviction that nurturing and caring for children are the cornerstones of human progress. UNICEF was created in 1946 to work with others to overcome the obstacles that poverty, violence, disease and discrimination place in a child’s path. It has global authority to influence decision-makers, and a wide variety of partners at grassroots level to turn the most innovative ideas into reality.\n\nFor 70 years, UNICEF has been working on the ground in 190... countries and territories to promote children’s survival, protection and development. The world’s largest provider of vaccines for developing countries, UNICEF supports child health and nutrition, good water and sanitation, quality basic education for all boys and girls, and the protection of children from violence, exploitation, and AIDS. UNICEF is funded entirely by the voluntary contributions of individuals, businesses, foundations and Governments.\n\nContext\n\nZambia is located in Southern African and has a population of approximately 18 million people . A survey conducted in 2018 indicated that 15% of children under the age of 5 years in Zambia had diarrhoea within the two weeks prior to the survey and 34.6% were stunted. Global evidence shows linkages between consumption of poor-quality water, diarrhoea and waterborne diseases and may contribute to child stunting.\n\nThe UN Volunteer will support the Water, Sanitation and Hygiene (WASH) section focusing on providing water and sanitation support to provincial and district government counterparts, whilst facilitating ground level work for contractors and consultants on WASH activities.\n\nTask description\n\nUnder the overall supervision of the UNICEF WASH Specialist, the UN Volunteer will undertake the following tasks:\n\n• Monitor UNICEF funded end-use, private sector, construction, and behavior change work at the village level;\n\n• Engage district governments counterparts on matters related to UNICEF WASH activities;\n\n• Coordinate field aspects of youth engagement changemaker workshops with UNICEF “YES” team;\n\n• Facilitate village, district, and provincial WASH level work for UNICEF contractors and consultants;\n\n• Act as a Liaison with contractors leading household water quality, handwashing, menstrual hygiene, and sanitation private sector engagement activities;\n\n• Conduct Knowledge management activities, such as: summarizing information in graphic format, map locations of work for donor reports, write monitoring reports, contribute to SharePoint tracking documents/files and draft knowledge management articles;\n\n• Perform other tasks related to service delivery as assigned.\n\nEligibility criteria\n\nAge\n\n27 – 80\n\nNationality\n\nCandidate must be a national or legal resident of the country of assignment.\n\nRequirements\n\nRequired experience\n\n3 years of experience in WASH, community development, private sector development, youth engagement, or behavior change;\n\n• Demonstrated interest/experience in Community Development, Behavior Change, Youth Engagement, Entrepreneurship, Adult Education, Water, Sanitation, Hygiene, and Menstrual Hygiene activities;\n\n• Advanced computer skills (i.e., Word, Excel, PowerPoint, Microsoft Calendar, Social media, and others) is required. Ability to create maps in google earth, mwater, or GIS is an added advantage;\n\n• Demonstrated dedication to rural development, and equity and inclusion;\n\n• Experience with Household water treatment, sanitation business development, WASH in healthcare facilities, WASH linkages to nutrition and local government, WASH and climate change, and commercial water utility experience would be an added asset;\n\n• Professionalism and ability to work with partner organizations including government at the provincial and district levels;\n\n• Motivated to contribute towards peace and development and to serve others;\n\n• Excellent interpersonal, networking and communication (verbal and written) skills;\n\n• Planning and organizing skills;\n\n• Willingness to contribute and work as part of a team;\n\n• Flexible and open to learning and new experiences;\n\n• Ability to gather and analysis data and conduct research;\n\n• Respect for diversity and adaptability to other cultures, environments and living conditions;\n\n• Fluency in spoken and written English language is required;\n\n• Demonstration of high-quality written English, such as published papers is an advantage;\n\n• Previous experience as a volunteer and/or experience of another culture, (i.e., studies, volunteer work, internship) would be highly regarded.\n\nArea(s) of expertise\n\nDevelopment programmes\n\nDriving license\n\n–\n\nLanguages\n\nEnglish, Level: Fluent, Desirable\n\nRequired education level\n\nBachelor degree or equivalent in Public Health, Environmental Health, Community Development, Development Sciences or related fields.\n\nCompetencies and values\n\n• Accountability\n\n• Adaptability and Flexibility\n\n• Commitment and Motivation\n\n• Commitment to Continuous Learning\n\n• Communication\n\n• Ethics and Values\n\n• Integrity\n\n• Knowledge Sharing\n\n• Planning and Organizing\n\n• Professionalism\n\n• Respect for Diversity\n\n• Technological Awareness\n\n• Working in Teams\n\nOther information\n\nLiving conditions and remarks\n\nZambia is a landlocked, middle-income country with a population estimated at 18 million. Lusaka became the capital city of Zambia in May 1935. Lusaka’s central position in Zambia and its pleasant climate were two of the main reasons for its selection as the capital. It is a metropolis, which provides a home to about two and nine million (2.9m) inhabitants of different nationalities. It has grown to become the seat of the Government of the Republic of Zambia and as such all diplomatic missions, international organizations, industrial and commercial entities are based there. Its political, social, economic, and cultural significance has also increased through the years. Public transport is provided by private operators using minibuses and taxis. The bus routes are not mapped, and roads are less congested. Good modern housing for rent is available on the open market. The official language is English, which is widely spoken. The country is generally food secure, with sufficient local fresh fruits and vegetables available in the markets, as well as various dairy, poultry, and meat products. There are several international schools using the Cambridge GCSE or IGCSE syllabi, from key stage one through to A levels. Health conditions are generally good, although malaria is prevalent. Zambia is generally a safe place to live in, although not free of crime. Some prudence is required. For more info, visit: http://www.zambiatourism.com; https://www.unv.org/.\n\nInclusivity statement\n\nUnited Nations Volunteers is an equal opportunity programme that welcomes applications from qualified professionals. We are committed to achieving diversity in terms of gender, care protected characteristics. As part of their adherence to the values of UNV, all UN Volunteers commit themselves to combat any form of discrimination, and to promoting respect for human rights and individual dignity, without distinction of a person’s race, sex, gender identity, religion, nationality, ethnic origin, sexual orientation, disability, pregnancy, age, language, social origin or other status.\n\nReasonable accommodation\n\nUNICEF offers reasonable accommodation for UN Volunteers with disabilities. This may include, for example, accessible software, travel assistance for missions or personal attendants. We encourage you to disclose your disability during your application in case you need reasonable accommodation during the recruitment process and afterwards in your assignment.\n\nNote on Covid-19 vaccination requirements\n\nIn addition to duty station-specific vaccine requirements, appointments are subject to confirmation of fully-vaccinated status against SARS-CoV-2 (Covid-19) with a World Health Organization (WHO)-endorsed vaccine, which must be met prior to taking up the appointment. It does not apply to UN Volunteers who will work remotely and are not expected to work on or visit UNICEF premises, programme delivery locations or directly interact with communities UNICEF works with, nor to travel to perform functions for UNICEF for the duration of their contracts"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.unicef.org/",
        "text": "unicef.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=UNICEF&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCMUI",
        "text": "See web results for UNICEF"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_kurDNP72UzHCPtQeYeOOjZwhVoEfbMDz1g1Q&s=0",
    "extensions": [
      "Temp work"
    ],
    "detected_extensions": {
      "schedule_type": "Temp work"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciwgU2FuaXRhdGlvbiBhbmQgSHlnaWVuZSAoV0FTSCkgT2ZmaWNlciIsImh0aWRvY2lkIjoibVNKSkJib3JIXzh5UjdBMEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVXhQYm5CWlYzTnBORkJpUkRkNVpYWktVakJZYTNOcmQyZDJNRUpHZVcxdFR5MW5TVkZRZFVsbGJtTnhjVkpuZG0xbFVsYzJkVGRXWDFSSVFWUktjbFZhY1VsVVdrMXNORWhFWTFvM2N6QnFVV2xoYUdjNFkxZG1lVkU1VlV4a2FIZzBVMVZNTURSSVdXOW1NSFE1VTJKRVdEbG9Oek41UWt3ek1uUnlRMEV6VVZVelJURlhaa3h5TURVU0YwWjZUbkphWlZSM1JrbzJhMmxNVFZBeVkzVmlkVUZ2R2lKQlNuZHJMVGhqT0RsS1UxbHdVMmMwYmpKMGJHRk1RVkY0T1VKSVptRXplRlZSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBKb2JzIE11IFphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYnNtdXphbWJpYS5jb20vam9iL3dhdGVyLXNhbml0YXRpb24tYW5kLWh5Z2llbmUtd2FzaC1vZmZpY2VyLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Water, Sanitation, and Hygiene (WASH) Volunteer",
    "company_name": "Zango Foundation",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\nAbout Zango Foundation:\nZango Foundation is a non-profit organization dedicated to improving the physical and mental well-being of children and adolescents across the globe. Our mission is to provide assistance to vulnerable and underprivileged children in need through various initiatives, such as education, healthcare, mental health support, and more. We believe in empowering the next generation to create a brighter future for themselves and their communities.\n\nBenefits of Volunteering with Zango Foundation:\n• Meaningful Impact: Working with Zango Foundation allows you to make a meaningful impact on the lives of vulnerable children and adolescents, contributing to their well-being and empowerment.\n• Professional Growth: You’ll have the chance to develop valuable skills and gain practical experience in your chosen field, whether it’s education, healthcare, fundraising, mental health, or any other area.\n• Networking Opportunities: Zango Foundation collaborates with a wide... range of partners, including other non-profits, government agencies, and community organizations. This provides an excellent opportunity to expand your professional network.\n• Training and Mentorship: The organization values the growth of its team members and provides training and mentorship opportunities to help you excel in your role and personal development.\n• Flexible Work Environment: Zango Foundation offers a flexible work environment that encourages creativity and innovation while maintaining a healthy work-life balance.\n• Diverse and Inclusive Culture: The organization is committed to diversity and inclusivity, fostering an environment where individuals from various backgrounds can thrive and contribute their unique perspectives.\n• Opportunity for Full-Time Employment: Zango Foundation often considers Volunteers for full-time positions based on performance and the availability of openings, providing a potential pathway for long-term employment.\n• Professional References: A successful Volunteer at Zango Foundation can serve as a valuable reference when applying for future job opportunities in the non-profit sector or related fields.\n\n• Volunteer Positions:\nWe are currently seeking dedicated volunteers to join our team. These positions are part-time, requiring a commitment of three days a week. As a volunteer with Zango Foundation, you will have the opportunity to contribute your skills and passion to make a meaningful impact on the lives of those in need.\n• Here are the available positions:\n\nEducation Advocate Volunteer:\n• Support our educational programs and initiatives to provide quality education to underprivileged children.\n• Assist in organizing educational events, workshops, and mentorship programs.\n• Collaborate with local communities to enhance access to education.\n\nClimate Change Volunteer:\n• Raise awareness about climate change and its impact on vulnerable communities.\n• Assist in the development and implementation of climate change awareness campaigns.\n• Collaborate with local communities to promote sustainable practices.\n\nSexual and Reproductive Health and Rights (SRHR) Volunteer:\n• Promote SRHR education and access in underserved areas.\n• Engage with communities to reduce stigma and provide support related to SRHR issues.\n• Assist in organizing workshops and awareness programs.\n\nWater, Sanitation, and Hygiene (WASH) Volunteer\n• Support our efforts to improve access to clean water and sanitation in disadvantaged communities.\n• Engage with communities to raise awareness about WASH and promote hygiene practices.\n• Assist in organizing WASH-related workshops and initiatives.\n\nMental Health Volunteer\n• Raise awareness about mental health issues and reduce stigma in communities.\n• Assist in the development and implementation of mental health support programs.\n• Engage with individuals facing mental health challenges to provide essential support.\n\nQualifications\n• Minimum of a diploma in Communication, Social Science, Community Development, Health Science, Public Administration, Non-Profit Management, Education, or a related field.\n• Passion for education and a strong commitment to positively impacting the lives of children and adolescents.\n• Excellent command, written and spoken, of both English and any local language.\n• Proficient in computer software applications MS Word, Excel and Powerpoint.\n• Exceptional organizational skills, able to work independently and collaboratively, displaying initiative and sound judgment.\n• Ability to thrive under short deadlines and effectively balance multiple activities and demands.\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education: Postgraduate Degree",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\nAbout Zango Foundation:\nZango Foundation is a non-profit organization dedicated to improving the physical and mental well-being of children and adolescents across the globe. Our mission is to provide assistance to vulnerable and underprivileged children in need through various initiatives, such as education, healthcare, mental health support, and more. We believe in empowering the next generation to create a brighter future for themselves and their communities.\n\nBenefits of Volunteering with Zango Foundation:\n• Meaningful Impact: Working with Zango Foundation allows you to make a meaningful impact on the lives of vulnerable children and adolescents, contributing to their well-being and empowerment.\n• Professional Growth: You’ll have the chance to develop valuable skills and gain practical experience in your chosen field, whether it’s education, healthcare, fundraising, mental health, or any other area.\n• Networking Opportunities: Zango Foundation collaborates with a wide... range of partners, including other non-profits, government agencies, and community organizations. This provides an excellent opportunity to expand your professional network.\n• Training and Mentorship: The organization values the growth of its team members and provides training and mentorship opportunities to help you excel in your role and personal development.\n• Flexible Work Environment: Zango Foundation offers a flexible work environment that encourages creativity and innovation while maintaining a healthy work-life balance.\n• Diverse and Inclusive Culture: The organization is committed to diversity and inclusivity, fostering an environment where individuals from various backgrounds can thrive and contribute their unique perspectives.\n• Opportunity for Full-Time Employment: Zango Foundation often considers Volunteers for full-time positions based on performance and the availability of openings, providing a potential pathway for long-term employment.\n• Professional References: A successful Volunteer at Zango Foundation can serve as a valuable reference when applying for future job opportunities in the non-profit sector or related fields.\n\n• Volunteer Positions:\nWe are currently seeking dedicated volunteers to join our team. These positions are part-time, requiring a commitment of three days a week. As a volunteer with Zango Foundation, you will have the opportunity to contribute your skills and passion to make a meaningful impact on the lives of those in need.\n• Here are the available positions:\n\nEducation Advocate Volunteer:\n• Support our educational programs and initiatives to provide quality education to underprivileged children.\n• Assist in organizing educational events, workshops, and mentorship programs.\n• Collaborate with local communities to enhance access to education.\n\nClimate Change Volunteer:\n• Raise awareness about climate change and its impact on vulnerable communities.\n• Assist in the development and implementation of climate change awareness campaigns.\n• Collaborate with local communities to promote sustainable practices.\n\nSexual and Reproductive Health and Rights (SRHR) Volunteer:\n• Promote SRHR education and access in underserved areas.\n• Engage with communities to reduce stigma and provide support related to SRHR issues.\n• Assist in organizing workshops and awareness programs.\n\nWater, Sanitation, and Hygiene (WASH) Volunteer\n• Support our efforts to improve access to clean water and sanitation in disadvantaged communities.\n• Engage with communities to raise awareness about WASH and promote hygiene practices.\n• Assist in organizing WASH-related workshops and initiatives.\n\nMental Health Volunteer\n• Raise awareness about mental health issues and reduce stigma in communities.\n• Assist in the development and implementation of mental health support programs.\n• Engage with individuals facing mental health challenges to provide essential support.\n\nQualifications\n• Minimum of a diploma in Communication, Social Science, Community Development, Health Science, Public Administration, Non-Profit Management, Education, or a related field.\n• Passion for education and a strong commitment to positively impacting the lives of children and adolescents.\n• Excellent command, written and spoken, of both English and any local language.\n• Proficient in computer software applications MS Word, Excel and Powerpoint.\n• Exceptional organizational skills, able to work independently and collaboratively, displaying initiative and sound judgment.\n• Ability to thrive under short deadlines and effectively balance multiple activities and demands.\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education: Postgraduate Degree"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Zango+Foundation&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCPII",
        "text": "See web results for Zango Foundation"
      }
    ],
    "extensions": [
      "Full-time, Part-time and Volunteer"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time, Part-time and Volunteer"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciwgU2FuaXRhdGlvbiwgYW5kIEh5Z2llbmUgKFdBU0gpIFZvbHVudGVlciIsImh0aWRvY2lkIjoiZnRkalNQelJlX0EyWW04VEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHcmVhdCBaYW1iaWEgSm9icyIsImxpbmsiOiJodHRwczovL3d3dy5ncmVhdHphbWJpYWpvYnMuY29tL2pvYnMvam9iLWRldGFpbC9qb2ItV2F0ZXIsLVNhbml0YXRpb24sLWFuZC1IeWdpZW5lLVdBU0gtVm9sdW50ZWVyLWpvYi1hdC1aYW5nby1Gb3VuZGF0aW9uLTUwNDcwP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "WASH Specialist",
    "company_name": "UNICEF",
    "location": "  Lusaka   ",
    "via": "via JobZambia",
    "description": "This is an exciting opportunity to join UNICEF Zambia’s Water, Sanitation & Hygiene Programme, focusing on development, preparation, management, implementation, monitoring and evaluation of the WASH programme\n\nUNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential.\n\nAcross 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone.\n\nAnd we never give up.\n\nFor every child,\n\nThe UNICEF Programme of Cooperation with the Government of the Republic of Zambia (GRZ) is designed to address and mitigate the threat of poverty the country’s children face, while responding to the needs with interventions addressing the multiple causative factors.\n\nIn response to the combination these threats involve the Programme supports national efforts to improve service delivery in the key areas of: child health and nutrition... and HIV and AIDS, quality basic education, water, sanitation and hygiene education, child protection and social policy, advocacy and communication.\n\nTo find out more about UNICEF’s work in Zambia, please visit https://www.unicef.org/zambia/ .\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nHow can you make a difference?\n\nThe WASH Specialist reports to the WASH Specialist (Level 3) for guidance and general supervision. The Specialist supports the\n\ndevelopment, preparation, management, implementation, monitoring and evaluation of the WASH programme within the country programme. The Specialist provides technical guidance and management support throughout the programming processes, to facilitate the administration and achievement of the WASH-related output results in the country programme.\n\nKey Function, Accountabilities And Related Duties/Tasks\n• Programme development and planning\n• Draft the WASH inputs for the situation analysis. Provide timely, comprehensive and current data to inform WASH policy and programme development, planning, management and implementation. Keep abreast of WASH sector development trends, for maximum efficiency and effectiveness in programme design, management and implementation.\n• Participate in strategic WASH programme planning discussions. Prepare WASH donor proposals, ensuring alignment with UNICEF’s Strategic Plan, UNICEF’s global WASH strategy and the Country programme, as well as government plans and priorities, and the role of other external support agencies.\n• Assist in the formulation of the WASH outcome and output results, related indicators, baselines, targets and means of verification. Prepare required documentation for programme reviews.\n• Work with colleagues and partners to discuss strategies and methodologies for the achievement of WASH output results in the country programme.\n• Provide technical and operational support throughout all stages of programming processes and ensure integration, coherence and harmonization of WASH with other UNICEF sectors, for the achievement of the WASH output results.\n• Draft assigned sections of the annual work plan, in close cooperation with government and other counterparts.\n\n2 Programme management, monitoring and delivery of results\n• With other external support agencies, strengthen national government WASH sector monitoring systems, with a focus on WASH outcomes (behaviors), using bottleneck analysis tools available in the sector (WASH-BAT, CSOs, SDAs).\n• Participate in monitoring and evaluation exercises, programme reviews and annual sectoral reviews with government and other counterparts and prepare reports on results for required action/interventions at the higher level of programme management.\n• Prepare/assess monitoring and evaluation reports to identify gaps, strengths/weaknesses in programmes and management, identify and document lessons learned.\n• Monitor and report on the use of sectoral programme resources (financial, administrative and other assets), verify compliance with approved allocations, organizational rules, regulations/procedures and donor commitments, standards of accountability and integrity. Report on issues identified to enable timely resolution by management/stakeholders.\n• Prepare sectoral progress reports for management, donors and partners.\n\n3 Technical and operational support for programme implementation\n• Actively monitor UNICEF-supported activities through field visits, surveys and exchange of information with partners, to assess progress, identify bottlenecks and potential problems and take timely decisions to resolve issues and/or refer to relevant officials for timely interventions.\n• Provide technical and operational support to government counterparts, NGO partners, UN system partners and other country office partners/donors on the application and understanding of UNICEF policies, strategies, processes and best practices in WASH, to support programme implementation.\n• Plan for use of technical experts from the Regional Office and HQ, as and where appropriate in the WASH programme, through remote support and on-site visits.\n• Participate in WASH programme meetings, to review progress, with government, other sector agencies and implementation partners, involved at various stages of WASH programme implementation, to provide expert advice and guidance.\n• Draft policy papers, briefs and other strategic materials for use by management, donors, UNICEF regional offices and headquarters.\n\n4 Humanitarian WASH preparedness and response\n• Prepare requisitions for supplies, services, long-term agreements and partnership agreements to ensure UNICEF is prepared to deliver on its commitments for WASH in case of an emergency.\n• Contribute to the coordination arrangement for humanitarian WASH, for instant robust coordination in case of an emergency.\n• Ensure that all UNICEF WASH staff are familiar with UNICEF’s procedures for responding in an emergency.\n• Take up support roles in an emergency response and early recovery, as and when the need arises.\n\n5 Networking and partnership building\n• Build and sustain close working partnerships with government counterparts and national stakeholders through active sharing of information and knowledge to facilitate programme implementation and build capacity of stakeholders to achieve WASH output results.\n• Prepare materials for WASH programme advocacy to promote awareness, establish partnerships and support fund-raising.\n\nParticipate in inter-agency discussions, ensuring that UNICEF’s position, interests and priorities are fully considered and integrated in the UNDAF development planning and agenda setting.\n• Innovation, knowledge management and capacity building\n• Lead the development, implementation, monitoring and documentation of WASH action research and innovation (technical or systems).\n• Prepare learning/knowledge products, covering innovative approaches and good practices, to support overall WASH sector development.\n• Create and deliver learning opportunities for UNICEF WASH staff, to ensure our sector capacity remains up-to-date with latest developments.\n• Contribute to the systematic assessment of WASH sector capacity gap analysis, in collaboration with government and other stakeholders, and support the design of initiative to strengthen capacities systematically.\n• Participate as a resource person in capacity building initiatives to enhance the competencies of clients/stakeholders.\n\nTo qualify as an advocate for every child you will have…\n\nEducation\n\nAn advanced university degree in one of the following fields is required: public health, social sciences, behavior change communication, sanitary engineering, civil engineering, environmental engineering and hydrology or another relevant technical field.\n\nAdditional relevant post-graduate courses that complement/supplement the main degree are a strong asset.\n\nDevelopmental\n\nExperience\n\nA minimum of five years of professional experience in WASH-related programmes for developing countries is required.\n\nOne year of deployment in a developing country is required.\n\nHUMANITARIAN: At least one three-month deployment mission in a humanitarian situation (with UN-Govt-INGO) is required.\n\nLanguage Requirements\n\nFluency in English is required. Knowledge of another official UN language or local language of the duty station is considered as an asset.\n\nFor every Child, you demonstrate…\n\nUNICEF’s core values of Commitment, Diversity and Integrity and core competencies in Communication, Working with People and Drive for Results.\n\nThe competencies required for this post are….\n\nCore Values (Required)\n\nCommitment\n\nDiversity and Inclusion\n\nIntegrity\n\nCore Competencies (Required)\n\nCommunication [II]\n\nWorking with People [II]\n\nDrive for Results [II]\n\nFunctional Competencies (Required)\n\nLeading and Supervising [I]\n\nFormulating Strategies and Concepts [II]\n\nAnalyzing [III]\n\nApplying Technical Expertise [III]\n\nRelating and Networking [II]\n\nDeciding and Initiating Action [II]\n\nView our competency framework at\n\nhttp://www.unicef.org/about/employ/files/UNICEF_Competencies.pdf\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nUNICEF is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious and ethnic backgrounds, including persons living with disabilities, to apply to become a part of the organization.\n\nUNICEF has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and UNICEF, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination. UNICEF also adheres to strict child safeguarding principles. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles.\n\nRemarks\n\nOnly shortlisted candidates will be contacted and advance to the next stage of the selection process.\n• ",
    "job_highlights": [
      {
        "items": [
          "This is an exciting opportunity to join UNICEF Zambia’s Water, Sanitation & Hygiene Programme, focusing on development, preparation, management, implementation, monitoring and evaluation of the WASH programme\n\nUNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential.\n\nAcross 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone.\n\nAnd we never give up.\n\nFor every child,\n\nThe UNICEF Programme of Cooperation with the Government of the Republic of Zambia (GRZ) is designed to address and mitigate the threat of poverty the country’s children face, while responding to the needs with interventions addressing the multiple causative factors.\n\nIn response to the combination these threats involve the Programme supports national efforts to improve service delivery in the key areas of: child health and nutrition... and HIV and AIDS, quality basic education, water, sanitation and hygiene education, child protection and social policy, advocacy and communication.\n\nTo find out more about UNICEF’s work in Zambia, please visit https://www.unicef.org/zambia/ .\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nHow can you make a difference?\n\nThe WASH Specialist reports to the WASH Specialist (Level 3) for guidance and general supervision. The Specialist supports the\n\ndevelopment, preparation, management, implementation, monitoring and evaluation of the WASH programme within the country programme. The Specialist provides technical guidance and management support throughout the programming processes, to facilitate the administration and achievement of the WASH-related output results in the country programme.\n\nKey Function, Accountabilities And Related Duties/Tasks\n• Programme development and planning\n• Draft the WASH inputs for the situation analysis. Provide timely, comprehensive and current data to inform WASH policy and programme development, planning, management and implementation. Keep abreast of WASH sector development trends, for maximum efficiency and effectiveness in programme design, management and implementation.\n• Participate in strategic WASH programme planning discussions. Prepare WASH donor proposals, ensuring alignment with UNICEF’s Strategic Plan, UNICEF’s global WASH strategy and the Country programme, as well as government plans and priorities, and the role of other external support agencies.\n• Assist in the formulation of the WASH outcome and output results, related indicators, baselines, targets and means of verification. Prepare required documentation for programme reviews.\n• Work with colleagues and partners to discuss strategies and methodologies for the achievement of WASH output results in the country programme.\n• Provide technical and operational support throughout all stages of programming processes and ensure integration, coherence and harmonization of WASH with other UNICEF sectors, for the achievement of the WASH output results.\n• Draft assigned sections of the annual work plan, in close cooperation with government and other counterparts.\n\n2 Programme management, monitoring and delivery of results\n• With other external support agencies, strengthen national government WASH sector monitoring systems, with a focus on WASH outcomes (behaviors), using bottleneck analysis tools available in the sector (WASH-BAT, CSOs, SDAs).\n• Participate in monitoring and evaluation exercises, programme reviews and annual sectoral reviews with government and other counterparts and prepare reports on results for required action/interventions at the higher level of programme management.\n• Prepare/assess monitoring and evaluation reports to identify gaps, strengths/weaknesses in programmes and management, identify and document lessons learned.\n• Monitor and report on the use of sectoral programme resources (financial, administrative and other assets), verify compliance with approved allocations, organizational rules, regulations/procedures and donor commitments, standards of accountability and integrity. Report on issues identified to enable timely resolution by management/stakeholders.\n• Prepare sectoral progress reports for management, donors and partners.\n\n3 Technical and operational support for programme implementation\n• Actively monitor UNICEF-supported activities through field visits, surveys and exchange of information with partners, to assess progress, identify bottlenecks and potential problems and take timely decisions to resolve issues and/or refer to relevant officials for timely interventions.\n• Provide technical and operational support to government counterparts, NGO partners, UN system partners and other country office partners/donors on the application and understanding of UNICEF policies, strategies, processes and best practices in WASH, to support programme implementation.\n• Plan for use of technical experts from the Regional Office and HQ, as and where appropriate in the WASH programme, through remote support and on-site visits.\n• Participate in WASH programme meetings, to review progress, with government, other sector agencies and implementation partners, involved at various stages of WASH programme implementation, to provide expert advice and guidance.\n• Draft policy papers, briefs and other strategic materials for use by management, donors, UNICEF regional offices and headquarters.\n\n4 Humanitarian WASH preparedness and response\n• Prepare requisitions for supplies, services, long-term agreements and partnership agreements to ensure UNICEF is prepared to deliver on its commitments for WASH in case of an emergency.\n• Contribute to the coordination arrangement for humanitarian WASH, for instant robust coordination in case of an emergency.\n• Ensure that all UNICEF WASH staff are familiar with UNICEF’s procedures for responding in an emergency.\n• Take up support roles in an emergency response and early recovery, as and when the need arises.\n\n5 Networking and partnership building\n• Build and sustain close working partnerships with government counterparts and national stakeholders through active sharing of information and knowledge to facilitate programme implementation and build capacity of stakeholders to achieve WASH output results.\n• Prepare materials for WASH programme advocacy to promote awareness, establish partnerships and support fund-raising.\n\nParticipate in inter-agency discussions, ensuring that UNICEF’s position, interests and priorities are fully considered and integrated in the UNDAF development planning and agenda setting.\n• Innovation, knowledge management and capacity building\n• Lead the development, implementation, monitoring and documentation of WASH action research and innovation (technical or systems).\n• Prepare learning/knowledge products, covering innovative approaches and good practices, to support overall WASH sector development.\n• Create and deliver learning opportunities for UNICEF WASH staff, to ensure our sector capacity remains up-to-date with latest developments.\n• Contribute to the systematic assessment of WASH sector capacity gap analysis, in collaboration with government and other stakeholders, and support the design of initiative to strengthen capacities systematically.\n• Participate as a resource person in capacity building initiatives to enhance the competencies of clients/stakeholders.\n\nTo qualify as an advocate for every child you will have…\n\nEducation\n\nAn advanced university degree in one of the following fields is required: public health, social sciences, behavior change communication, sanitary engineering, civil engineering, environmental engineering and hydrology or another relevant technical field.\n\nAdditional relevant post-graduate courses that complement/supplement the main degree are a strong asset.\n\nDevelopmental\n\nExperience\n\nA minimum of five years of professional experience in WASH-related programmes for developing countries is required.\n\nOne year of deployment in a developing country is required.\n\nHUMANITARIAN: At least one three-month deployment mission in a humanitarian situation (with UN-Govt-INGO) is required.\n\nLanguage Requirements\n\nFluency in English is required. Knowledge of another official UN language or local language of the duty station is considered as an asset.\n\nFor every Child, you demonstrate…\n\nUNICEF’s core values of Commitment, Diversity and Integrity and core competencies in Communication, Working with People and Drive for Results.\n\nThe competencies required for this post are….\n\nCore Values (Required)\n\nCommitment\n\nDiversity and Inclusion\n\nIntegrity\n\nCore Competencies (Required)\n\nCommunication [II]\n\nWorking with People [II]\n\nDrive for Results [II]\n\nFunctional Competencies (Required)\n\nLeading and Supervising [I]\n\nFormulating Strategies and Concepts [II]\n\nAnalyzing [III]\n\nApplying Technical Expertise [III]\n\nRelating and Networking [II]\n\nDeciding and Initiating Action [II]\n\nView our competency framework at\n\nhttp://www.unicef.org/about/employ/files/UNICEF_Competencies.pdf\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nUNICEF is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious and ethnic backgrounds, including persons living with disabilities, to apply to become a part of the organization.\n\nUNICEF has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and UNICEF, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination. UNICEF also adheres to strict child safeguarding principles. All selected candidates will, therefore, undergo rigorous reference and background checks, and will be expected to adhere to these standards and principles.\n\nRemarks\n\nOnly shortlisted candidates will be contacted and advance to the next stage of the selection process.\n• "
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.unicef.org/",
        "text": "unicef.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=UNICEF&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCKEJ",
        "text": "See web results for UNICEF"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYvR0dLeS19V9v5VukUPls3oRu17MJdn1MNsiJDjtlAsz44bX_5Cotl_Q&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXQVNIIFNwZWNpYWxpc3QiLCJodGlkb2NpZCI6InhQQzIwcVdzTDNlOWlCVktBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVV4UGJuQlpWWGg1YjFNM2RUUlRiamxuWkRnMWRrdzBiWFJCWkhWSFpHWlhiV2hqYkVKZllUSnVibWhuTjFVeVRtVldlR0pSY1Rsa2JVOHpZbE5TVkhsUlFVdHZTbEIxYUZBNU0yazRiM05XUWs1cU9USjNiRXRRYUhWNlJISldObU5PTWpCWlFVZHhUWFJPZUUwMk0xWjZjSGh2VWtrMFpYaEhiWEJqY2xSalRHWldkelY0T0Y5a1UxWVNGMFo2VG5KYVpWUjNSa28yYTJsTVRWQXlZM1ZpZFVGdkdpSkJTbmRyTFRobE5EVlhWM0ZhYldsUFVrTk9lbXA1WmxWR1lYVmZWRlZLVUdKMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gSm9iWmFtYmlhIiwibGluayI6Imh0dHBzOi8vam9iemFtYmlhLmNvbS9qb2Ivd2FzaC1zcGVjaWFsaXN0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Driver/equipment Operator  – Permanent & Pensionable at Mulonga...",
    "company_name": "Mulonga Water Supply & Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via Jobweb Zambia",
    "description": "DRIVER/EQUIPMENT OPERATOR (x1) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo drive a motor vehicle in order to transport the Company’s staff and equipment as directed.\n\nKey Responsibilities\n\nCarries out pre-shift checks on motor vehicle for oil, water, tyre pressure and any visible defects, reports noted faults timely in order to affect repairs.\nEnsures that spare wheel, jack, triangles, first Aid box, wheel spanner or any other accessories are in the vehicle prior to depart and on arrival.\nDrives a motor vehicle to transport staff and equipment to assigned destination and undertakes errands on behalf of the corporation.\nOperates equipment (Tractor, Crane Mounted Vehicle, Vacuum Tanker) as may be assigned from time to time\nDelivers mails documents timely as directed by superior and ensures that all the assignments are met.\nUndertakes minor repairs and maintenance in faults detected on the vehicle and reports major ones to superior.\nReports any accident involving a Company vehicle... immediately reports to the police and makes a sketch of the position of the vehicle, takes the particulars of the other vehicle and Driver, and at the earliest opportunity reports to the supervisor\nEnsures that the motor vehicle is adequately insured and is road worthy to avoid contravening traffic rulesregulation and road.\nMaintains a log book for the motor vehicle detailing mileage covered before and after the trip\nReminds superior when the motor vehicle is due for service or maintenance.\nParks the assigned vehicle in a safe and authorized area in order to guarantee its safety\nClean the motor vehicle and ensure that it is kept clean at all times\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\nClass C Driving Licence\nSADC PSV Driving Licence will be an added advantage\nAbility to operate Crane Mounted Vehicle, Tractor, Vacuum Tanker\nBasic Mechanical knowledge will be an added advantage\n3 – 5 years’ experience",
    "job_highlights": [
      {
        "items": [
          "DRIVER/EQUIPMENT OPERATOR (x1) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo drive a motor vehicle in order to transport the Company’s staff and equipment as directed.\n\nKey Responsibilities\n\nCarries out pre-shift checks on motor vehicle for oil, water, tyre pressure and any visible defects, reports noted faults timely in order to affect repairs.\nEnsures that spare wheel, jack, triangles, first Aid box, wheel spanner or any other accessories are in the vehicle prior to depart and on arrival.\nDrives a motor vehicle to transport staff and equipment to assigned destination and undertakes errands on behalf of the corporation.\nOperates equipment (Tractor, Crane Mounted Vehicle, Vacuum Tanker) as may be assigned from time to time\nDelivers mails documents timely as directed by superior and ensures that all the assignments are met.\nUndertakes minor repairs and maintenance in faults detected on the vehicle and reports major ones to superior.\nReports any accident involving a Company vehicle... immediately reports to the police and makes a sketch of the position of the vehicle, takes the particulars of the other vehicle and Driver, and at the earliest opportunity reports to the supervisor\nEnsures that the motor vehicle is adequately insured and is road worthy to avoid contravening traffic rulesregulation and road.\nMaintains a log book for the motor vehicle detailing mileage covered before and after the trip\nReminds superior when the motor vehicle is due for service or maintenance.\nParks the assigned vehicle in a safe and authorized area in order to guarantee its safety\nClean the motor vehicle and ensure that it is kept clean at all times\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\nClass C Driving Licence\nSADC PSV Driving Licence will be an added advantage\nAbility to operate Crane Mounted Vehicle, Tractor, Vacuum Tanker\nBasic Mechanical knowledge will be an added advantage\n3 – 5 years’ experience"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Mulonga+Water+Supply+%26+Sanitation+Company+Limited&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCNEJ",
        "text": "See web results for Mulonga Water Supply & Sanitation Company Limited"
      }
    ],
    "extensions": [
      "3 days ago",
      "ZMK 1,113–ZMK 11,134 a month",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJEcml2ZXIvZXF1aXBtZW50IE9wZXJhdG9yICDigJMgUGVybWFuZW50IFx1MDAyNiBQZW5zaW9uYWJsZSBhdCBNdWxvbmdhIFdhdGVyIFN1cHBseSBcdTAwMjYgU2FuaXRhdGlvbiBDb21wYW55IExpbWl0ZWQiLCJodGlkb2NpZCI6IkdmbjJScU1ya3FUeERJRjJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9id2ViIFphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYndlYnphbWJpYS5jb20vam9icy9kcml2ZXJlcXVpcG1lbnQtb3BlcmF0b3ItcGVybWFuZW50LXBlbnNpb25hYmxlLW11bG9uZ2Etd2F0ZXItc3VwcGx5LXNhbml0YXRpb24tY29tcGFueS1saW1pdGVkLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Chief of Party- Expanding  Water and Sanitation",
    "company_name": "RTI",
    "location": "  Lusaka   ",
    "via": "via Jobs Mu Zambia",
    "description": "Program Description:\n\nRTI has recently been awarded the USAID-Zambia $20 million Expanding Water and Sanitation Project. The purpose of the USAID Expanding Water and Sanitation Project is to professionalize WASH services, to promote accountability for reliable and high-quality WASH services, and to enhance the enabling environment for private sector engagement (PSE) in service delivery in underserved areas of Zambia (Northern, Western and Muchinga provinces). The period of award is five-years.\n\nPosition Description:\n\nRTI is seeking a Chief of Party for the Expanding Water and Sanitation Project. The Chief of Party will be responsible for leading the overall project implementation, technical strategy, management, and execution of the project ensuring all project deliverables are met or exceeded within budget and in compliance with RTI and USAID rules and regulations. This position will provide project planning, oversight, leadership, and coordination. The COP will build and maintain... strong and favorable client, partner, community, home office, and team relations. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The COP will directly report to RTI’s Home Office.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nResponsible for the overall leadership, strategic guidance, vision, and management of staff for successful implementation of the project within budget and compliance parameters.\n\nLead overall project vision and strategy; manage overall project design and delivery;\n\nEnsure synergy across technical components of the project; ensure good team planning and coordination, deployment of resources and intra-team communication in support of project objectives;\n\nLead technical meetings to ensure adaptive management and inclusion of guiding principles across all objectives.\n\nOversee preparation and delivering high quality reports to USAID, including quarterly and annual reports, annual work plans, technical and financial reports.\n\nEnsure all contractual deliverables and reporting requirements are met and in compliance with contractual requirements and U.S. federal regulations.\n\nProvide overall leadership, strategic guidance, vision, and management to staff for successful implementation of the project, while maintaining financial accountability for all project activities.\n\nBuild strong relationships and lead communication and collaboration with USAID and high-level stakeholders, such as ministries and regulators, other implementers, partners and local counterparts.\n\nOversee performance monitoring and evaluation to ensure all governance project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nBachelor’s Degree and 15 years of experience, Master’s degree and 12 years of experience, PhD and 8 years of experience, or equivalent combination of education and experience.\n\nDemonstrated experience managing diverse, high-performing, multidisciplinary teams\n\nKnowledge of Zambian water sector context.\n\nDemonstrated ability to develop and communicate a common vision among diverse partners.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in locations with difficult terrain/conditions at times.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nProficiency in English is required.\n\nWork experience in Zambia required",
    "job_highlights": [
      {
        "items": [
          "Program Description:\n\nRTI has recently been awarded the USAID-Zambia $20 million Expanding Water and Sanitation Project. The purpose of the USAID Expanding Water and Sanitation Project is to professionalize WASH services, to promote accountability for reliable and high-quality WASH services, and to enhance the enabling environment for private sector engagement (PSE) in service delivery in underserved areas of Zambia (Northern, Western and Muchinga provinces). The period of award is five-years.\n\nPosition Description:\n\nRTI is seeking a Chief of Party for the Expanding Water and Sanitation Project. The Chief of Party will be responsible for leading the overall project implementation, technical strategy, management, and execution of the project ensuring all project deliverables are met or exceeded within budget and in compliance with RTI and USAID rules and regulations. This position will provide project planning, oversight, leadership, and coordination. The COP will build and maintain... strong and favorable client, partner, community, home office, and team relations. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The COP will directly report to RTI’s Home Office.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nResponsible for the overall leadership, strategic guidance, vision, and management of staff for successful implementation of the project within budget and compliance parameters.\n\nLead overall project vision and strategy; manage overall project design and delivery;\n\nEnsure synergy across technical components of the project; ensure good team planning and coordination, deployment of resources and intra-team communication in support of project objectives;\n\nLead technical meetings to ensure adaptive management and inclusion of guiding principles across all objectives.\n\nOversee preparation and delivering high quality reports to USAID, including quarterly and annual reports, annual work plans, technical and financial reports.\n\nEnsure all contractual deliverables and reporting requirements are met and in compliance with contractual requirements and U.S. federal regulations.\n\nProvide overall leadership, strategic guidance, vision, and management to staff for successful implementation of the project, while maintaining financial accountability for all project activities.\n\nBuild strong relationships and lead communication and collaboration with USAID and high-level stakeholders, such as ministries and regulators, other implementers, partners and local counterparts.\n\nOversee performance monitoring and evaluation to ensure all governance project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nBachelor’s Degree and 15 years of experience, Master’s degree and 12 years of experience, PhD and 8 years of experience, or equivalent combination of education and experience.\n\nDemonstrated experience managing diverse, high-performing, multidisciplinary teams\n\nKnowledge of Zambian water sector context.\n\nDemonstrated ability to develop and communicate a common vision among diverse partners.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in locations with difficult terrain/conditions at times.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nProficiency in English is required.\n\nWork experience in Zambia required"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=RTI&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCIEK",
        "text": "See web results for RTI"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJDaGllZiBvZiBQYXJ0eS0gRXhwYW5kaW5nICBXYXRlciBhbmQgU2FuaXRhdGlvbiIsImh0aWRvY2lkIjoiWVZabmY4b3lvS2pfOTJreEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBKb2JzIE11IFphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYnNtdXphbWJpYS5jb20vam9iL2NoaWVmLW9mLXBhcnR5LTIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Water Attendant",
    "company_name": "Zambia Sugar",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\n• The position reports to the Estate Maintenance Supervisor – Water Services. The successful candidate will be responsible for ensuring that consumers are supplied with quality domestic water which conforms to both NWASCO and WHO portable water standards to prevent outbreaks of water borne diseases.\n\nKey Performance Areas\n• Ensuring that the chemicals for water purification are dosed to the incoming raw water before it goes into the settling tank.\nDraining and cleaning the settlers to remove settled flocs in the settling tank to ensure that there are no carryovers into the filters due to high flock bed on a daily basis.\nCleaning the water collection troughs on a daily basis.\nEnsuring that filters are backwashed cleaned and disinfected using chlorine daily.\nEnsuring that correct quantity of disinfectant is dosed to kill germs in the filtered water.\nEnsuring that there are enough tablets in the brominator by physically checking daily.\nTesting residual chlorine levels hourly... and recording the results in the logbook.\nTaking corrective action when the figures are off the set target.\nEnsuring that analytical results are communicated to the laboratory supervisor who logs them on the laboratory daily log sheet.\nPumping treated water into the storage tank and supply to the consumers as per demand.\nEnsuring that water draughts pumps are put off if all the storage tanks are full and supply tanks are switched off when the storage tanks are empty.\nDetermine the optimum levels of the coagulant to be applied to highly turbid water as it comes to the Water Plant.\n\nMinimum Requirements\n• Grade 12 Certificate\nCertificate in Water Supply Technology\nMinimum 1 year experience in similar role\n\nWork Hours: 8\n\nExperience in Months: 12\n\nLevel of Education: Professional Certificate",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\n• The position reports to the Estate Maintenance Supervisor – Water Services. The successful candidate will be responsible for ensuring that consumers are supplied with quality domestic water which conforms to both NWASCO and WHO portable water standards to prevent outbreaks of water borne diseases.\n\nKey Performance Areas\n• Ensuring that the chemicals for water purification are dosed to the incoming raw water before it goes into the settling tank.\nDraining and cleaning the settlers to remove settled flocs in the settling tank to ensure that there are no carryovers into the filters due to high flock bed on a daily basis.\nCleaning the water collection troughs on a daily basis.\nEnsuring that filters are backwashed cleaned and disinfected using chlorine daily.\nEnsuring that correct quantity of disinfectant is dosed to kill germs in the filtered water.\nEnsuring that there are enough tablets in the brominator by physically checking daily.\nTesting residual chlorine levels hourly... and recording the results in the logbook.\nTaking corrective action when the figures are off the set target.\nEnsuring that analytical results are communicated to the laboratory supervisor who logs them on the laboratory daily log sheet.\nPumping treated water into the storage tank and supply to the consumers as per demand.\nEnsuring that water draughts pumps are put off if all the storage tanks are full and supply tanks are switched off when the storage tanks are empty.\nDetermine the optimum levels of the coagulant to be applied to highly turbid water as it comes to the Water Plant.\n\nMinimum Requirements\n• Grade 12 Certificate\nCertificate in Water Supply Technology\nMinimum 1 year experience in similar role\n\nWork Hours: 8\n\nExperience in Months: 12\n\nLevel of Education: Professional Certificate"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.illovosugarafrica.com/About-us/Zambia",
        "text": "illovosugarafrica.com/About-us/Zambia"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Zambia+Sugar&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCLIK",
        "text": "See web results for Zambia Sugar"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQPG_V-aZU14u4qT-3NhvRLzphn8s9VGQLCmhno&s=0",
    "extensions": [
      "4 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "4 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBBdHRlbmRhbnQiLCJodGlkb2NpZCI6IktKWUNwY0RJb1pkLVROQ2NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVV4UGJuQlpWamRvTkZWT1gxaFRNM2h4UmpkblJuTjFiMHc0TVRkVVMwODRaRkl4VEVFeWR6Wmtkak0wZUU5MWVVbFBSbTFQVEZsR2JubG9lWFF3ZWtSS01FcDRjek5vWmxsbE9HdE9WbVpvWWtOTk1rNHRibFZRVUhOTFdEZHNUV2hQUTI1VmMwZExNbmxuVVRGVVZubFVUazlmZVdWMWRWaE5kM0pJUlZaRlZWRlBkRGt3YjFsTloyb3paRFJqVEhGMWFtSlJaSEYyU0ZJNWNYbFdibTlSRWhkR2VrNXlXbVZVZDBaS05tdHBURTFRTW1OMVluVkJieG9pUVVwM2F5MDRabmhETW1Sa2VVNVdOMmhzTW1GeFVrWkxXRGcwWDI5T2JuRk9adyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlYXQgWmFtYmlhIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ3JlYXR6YW1iaWFqb2JzLmNvbS9qb2JzL2pvYi1kZXRhaWwvam9iLVdhdGVyLUF0dGVuZGFudC1qb2ItYXQtWmFtYmlhLVN1Z2FyLTUzNDAzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Water Quality Specialist",
    "company_name": "Innovation Africa",
    "location": "  Chipata   ",
    "via": "via Jobs Mu Zambia",
    "description": "Background\n\nInnovation: Africa (IA) is a non-profit 501(c)(3) organization with a team of dedicated problem solvers with a mission to bring solutions and know-how to those in need living in rural African villages. We use solar energy to pump clean water and provide schools, orphanages and medical clinics with light and refrigeration to store vaccines and medicines. IA has completed over 700 solar and agricultural projects, providing light, clean water, and proper medical care to more than 3,5 million people in Ethiopia, Tanzania, Malawi, South Africa, eSwatini, Uganda, Cameroon, Zambia, Senegal, and the Democratic Republic of Congo.\n\nJob Summary\n\nOur dynamic, growing organization seeks a Water Quality Specialist to join our team based in Chipata, Zambia. The position entails implementing and overseeing a comprehensive water quality monitoring and treatment program for all existing and future water projects, as well as working closely with the Engineering and Africa Programs... departments at headquarters in Israel.\n\nReports To\n\nCountry Manager (Local Office), Head Water Quality Specialist (HQ)\n\nRequirements\n\no B.Sc./M.Sc. in science-related discipline such as Environmental Sciences, Hydrology, (Geo/Bio) Chemistry, Biology, or Microbiology\n\no Advanced knowledge of water quality control and quality assurance principles and practices\n\no Advanced knowledge of environmental regulations, health & safety regulations, water industry and technologies\n\no Knowledge of general principles and procedures of water treatment and distribution\n\no Experience working in or with water testing laboratories\n\no Experience with field laboratory equipment and field sampling\n\no Proficiency in data science and using Microsoft Excel\n\no Driver’s license and off-road driving experience\n\no Ability to commit to flexible working hours\n\no Strong organizational skills – ability to multi-task and keep track of the water quality status and results for dozens of projects at once\n\no Strong communication skills, a team player\n\no High proficiency in English; both writing and speaking is a must and regional dialects in any two or three of such languages in the areas that we serve will be an added advantage.\n\nResponsibilities\n\no Conduct field sampling and analysis; coordinate and participate in the collection, interpretation, and evaluation of water quality data.\n\no Operate and troubleshoot analytical equipment and instrumentation.\n\no Assist in coordinating laboratory services, collecting and processing samples, using equipment, managing supply inventory and on-going maintenance.\n\no Research and implement applicable off-grid water treatment solutions.\n\no Understand trends and patterns and assess compliance with regulatory standards and potential risks to consumers.\n\no Visit sites of concern and carry out training of local staff on how to identify potential sources of pollution or contamination, and sources of complaints about drinking water quality.\n\no Perform administrative duties where necessary for monitoring program managers to ensure timely completion of workloads.\n\nCompensation\n\nCommensurate with experience.\n\nApplication Instructions\n\nPlease send your cover letter and CV as a single PDF attachment to zambia@innoafrica.org . Please make the file name your full name.\n\nAs an international organization, our teams are spread out between the USA, Israel and Africa, and team members are constantly on the move. We strive to use technological solutions to keep our staff in close contact, despite busy travel schedules. To ensure our operations run smoothly, we keep close communication via phone, Zoom, WhatsApp, Slack and more. This position requires the ability to keep up with this fast-paced environment, and to be comfortable working with colleagues across time zones and continents",
    "job_highlights": [
      {
        "items": [
          "Background\n\nInnovation: Africa (IA) is a non-profit 501(c)(3) organization with a team of dedicated problem solvers with a mission to bring solutions and know-how to those in need living in rural African villages. We use solar energy to pump clean water and provide schools, orphanages and medical clinics with light and refrigeration to store vaccines and medicines. IA has completed over 700 solar and agricultural projects, providing light, clean water, and proper medical care to more than 3,5 million people in Ethiopia, Tanzania, Malawi, South Africa, eSwatini, Uganda, Cameroon, Zambia, Senegal, and the Democratic Republic of Congo.\n\nJob Summary\n\nOur dynamic, growing organization seeks a Water Quality Specialist to join our team based in Chipata, Zambia. The position entails implementing and overseeing a comprehensive water quality monitoring and treatment program for all existing and future water projects, as well as working closely with the Engineering and Africa Programs... departments at headquarters in Israel.\n\nReports To\n\nCountry Manager (Local Office), Head Water Quality Specialist (HQ)\n\nRequirements\n\no B.Sc./M.Sc. in science-related discipline such as Environmental Sciences, Hydrology, (Geo/Bio) Chemistry, Biology, or Microbiology\n\no Advanced knowledge of water quality control and quality assurance principles and practices\n\no Advanced knowledge of environmental regulations, health & safety regulations, water industry and technologies\n\no Knowledge of general principles and procedures of water treatment and distribution\n\no Experience working in or with water testing laboratories\n\no Experience with field laboratory equipment and field sampling\n\no Proficiency in data science and using Microsoft Excel\n\no Driver’s license and off-road driving experience\n\no Ability to commit to flexible working hours\n\no Strong organizational skills – ability to multi-task and keep track of the water quality status and results for dozens of projects at once\n\no Strong communication skills, a team player\n\no High proficiency in English; both writing and speaking is a must and regional dialects in any two or three of such languages in the areas that we serve will be an added advantage.\n\nResponsibilities\n\no Conduct field sampling and analysis; coordinate and participate in the collection, interpretation, and evaluation of water quality data.\n\no Operate and troubleshoot analytical equipment and instrumentation.\n\no Assist in coordinating laboratory services, collecting and processing samples, using equipment, managing supply inventory and on-going maintenance.\n\no Research and implement applicable off-grid water treatment solutions.\n\no Understand trends and patterns and assess compliance with regulatory standards and potential risks to consumers.\n\no Visit sites of concern and carry out training of local staff on how to identify potential sources of pollution or contamination, and sources of complaints about drinking water quality.\n\no Perform administrative duties where necessary for monitoring program managers to ensure timely completion of workloads.\n\nCompensation\n\nCommensurate with experience.\n\nApplication Instructions\n\nPlease send your cover letter and CV as a single PDF attachment to zambia@innoafrica.org . Please make the file name your full name.\n\nAs an international organization, our teams are spread out between the USA, Israel and Africa, and team members are constantly on the move. We strive to use technological solutions to keep our staff in close contact, despite busy travel schedules. To ensure our operations run smoothly, we keep close communication via phone, Zoom, WhatsApp, Slack and more. This position requires the ability to keep up with this fast-paced environment, and to be comfortable working with colleagues across time zones and continents"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://innoafrica.org/",
        "text": "innoafrica.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Innovation+Africa&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCOMK",
        "text": "See web results for Innovation Africa"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR1EsG_Lay6T5bQa7TBxKVoqJqRYG4hjBOtpNXP&s=0",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBRdWFsaXR5IFNwZWNpYWxpc3QiLCJodGlkb2NpZCI6IjBacTBuMHA1TGZxRXhRSFRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVV4UGJuQlpWVzlWUkdneE0zRmtVWGx5YVhKcmNWWkNaQzF6TTFFd1QwUmlRbk50ZG5SNmJXZEJjRU40WVd0dFZYVTBNRU5UY0ZwTmIwZHhNRVJKWW1KNE1XcG5lVXRNVWxKTE1XMTNkbmRtVlZaMFdYTlhWamQ2VWt0NE9GSkxPR3RoUnpCV1QxUnFNbmQ2WDFoTlJsQXpaME5RV2tKcVRUQlpNbHBDTURFNVdETTJTMlJLU1VFME5qWk1hemxYT1hCak5URkZjV0p6TjFORVZrVTFjV3RFVURORlIwY3hkWGhPZVd4d0xXUjBabXd3YnpKakVoZEdlazV5V21WVWQwWktObXRwVEUxUU1tTjFZblZCYnhvaVFVcDNheTA0WmpadWJGa3lhbmR1Y0RnelRUQkpVRmRYZFhjMGMyZ3phRWhZWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY181IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IGRpcmVjdGx5IG9uIEpvYnMgTXUgWmFtYmlhIiwibGluayI6Imh0dHBzOi8vam9ic211emFtYmlhLmNvbS9qb2Ivd2F0ZXItcXVhbGl0eS1zcGVjaWFsaXN0Lz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Plant Operators/ Plant Attendants",
    "company_name": "North Western Water Supply and Sanitation Company Limited",
    "location": "  Solwezi   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\nJob Purpose\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\nQualifications and/ or skills\n• Full Grade twelve (12) School Certificate with at least five (5) ‘O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from... theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nEducation Requirement: No Requirements\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\nJob Purpose\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\nQualifications and/ or skills\n• Full Grade twelve (12) School Certificate with at least five (5) ‘O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from... theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nEducation Requirement: No Requirements\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=North+Western+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCJAL",
        "text": "See web results for North Western Water Supply and Sanitation Company Limited"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQbGFudCBPcGVyYXRvcnMvIFBsYW50IEF0dGVuZGFudHMiLCJodGlkb2NpZCI6IlJiWjllRU15NllGaWZFT0FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlYXQgWmFtYmlhIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ3JlYXR6YW1iaWFqb2JzLmNvbS9qb2JzL2pvYi1kZXRhaWwvam9iLVBsYW50LU9wZXJhdG9ycy1QbGFudC1BdHRlbmRhbnRzLWpvYi1hdC1Ob3J0aC1XZXN0ZXJuLVdhdGVyLVN1cHBseS1hbmQtU2FuaXRhdGlvbi1Db21wYW55LUxpbWl0ZWQtNDkyODk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Plant Operator(s)",
    "company_name": "Lusaka Water Supply and Sanitation Company Limited",
    "location": "  Chirundu   ",
    "via": "via JobZambia",
    "description": "The Mission of the Lusaka Water Supply and Sanitation Company Limited (LWSC) is to provide quality water and sanitation services to customers in Lusaka Province at a commercially and environmentally sustainable manner. In order to achieve this, the Company must ensure that staff with the right knowledge, skills and abilities are available as required. LWSC now seeks to recruit dynamic and energetic persons who are performance driven, and invites applications from suitably qualified and experienced Zambians. The successful candidates should be prepared to work under water supply or sewerage services and to be based in any of the LWSC operating districts which include Luangwa, Chirundu, Chilanga, Lusaka, Kafue, and Chongwe.\n\n1.0 PLANT OPERATORS\n\n2.0 Type of Employment Contract: Permanent and Pensionable Conditions of service\n\n3.0 Job Purpose\n\nThe Plant Operator will be reporting to the Superintendent and will be responsible for operating the pumping station, carrying out water/ sewage... treatment, monitoring reservoir water levels, ensuring the efficient performance of the plant, checking pressures for water/ sewer flows, as well as performing housekeeping of the workstation.\n\n4.0 Qualifications and Experience\n• School Certificate or General Certificate in Education\n• Craft Certificate in Water Supply Operations\n• One (1) year relevant work experience in a water or sewage treatment plant, or water distribution centre\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\n5.0 Behaviour Qualities\n• Good Communication Skills\n• Achievement oriented\n• Ability to work under pressure\n\nLWSC values the provision of equal employment opportunities. Therefore, women, men and persons with disabilities are encouraged to apply. In case of equal suitability, females will be given preferential consideration.\n\nAll applications letters together with photocopies of certificates and detailed curriculum vitae should reach the address below no later than Friday 26th November,2021 using the address below:\n\nDirector Human Resources and Administration\n\nLusaka Water Supply and Sanitation Company limited,\n\nPlot No. 871, Katemo Road,\n\nRhodes Park\n\nPO Box 50198\n\nLUSAKA",
    "job_highlights": [
      {
        "items": [
          "The Mission of the Lusaka Water Supply and Sanitation Company Limited (LWSC) is to provide quality water and sanitation services to customers in Lusaka Province at a commercially and environmentally sustainable manner. In order to achieve this, the Company must ensure that staff with the right knowledge, skills and abilities are available as required. LWSC now seeks to recruit dynamic and energetic persons who are performance driven, and invites applications from suitably qualified and experienced Zambians. The successful candidates should be prepared to work under water supply or sewerage services and to be based in any of the LWSC operating districts which include Luangwa, Chirundu, Chilanga, Lusaka, Kafue, and Chongwe.\n\n1.0 PLANT OPERATORS\n\n2.0 Type of Employment Contract: Permanent and Pensionable Conditions of service\n\n3.0 Job Purpose\n\nThe Plant Operator will be reporting to the Superintendent and will be responsible for operating the pumping station, carrying out water/ sewage... treatment, monitoring reservoir water levels, ensuring the efficient performance of the plant, checking pressures for water/ sewer flows, as well as performing housekeeping of the workstation.\n\n4.0 Qualifications and Experience\n• School Certificate or General Certificate in Education\n• Craft Certificate in Water Supply Operations\n• One (1) year relevant work experience in a water or sewage treatment plant, or water distribution centre\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\n5.0 Behaviour Qualities\n• Good Communication Skills\n• Achievement oriented\n• Ability to work under pressure\n\nLWSC values the provision of equal employment opportunities. Therefore, women, men and persons with disabilities are encouraged to apply. In case of equal suitability, females will be given preferential consideration.\n\nAll applications letters together with photocopies of certificates and detailed curriculum vitae should reach the address below no later than Friday 26th November,2021 using the address below:\n\nDirector Human Resources and Administration\n\nLusaka Water Supply and Sanitation Company limited,\n\nPlot No. 871, Katemo Road,\n\nRhodes Park\n\nPO Box 50198\n\nLUSAKA"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&hl=en&gl=zm&q=Lusaka+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwik2Nvi7_CCAxUeEmIAHdnlBqcQmJACCL8L",
        "text": "See web results for Lusaka Water Supply and Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSL_AE5CzPmcQ_FoByKKWXypJ8OLMRMaZ2yTx6wF6g&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQbGFudCBPcGVyYXRvcihzKSIsImh0aWRvY2lkIjoiTWl5WFVQV1BLem5fOFNiUkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JaYW1iaWEiLCJsaW5rIjoiaHR0cHM6Ly9qb2J6YW1iaWEuY29tL2pvYi9wbGFudC1vcGVyYXRvcnMvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Information & Technology Officer",
    "company_name": "Eastern Water and Sewerage Company Limited",
    "location": "  Lusaka   ",
    "via": "via Work In Africa",
    "description": "Eastern Water and Sewerage Company Limited (EWSC) is a Commercial Water utility company providing water and sanitation services to all the districts in (...)",
    "job_highlights": [
      {
        "items": [
          "Eastern Water and Sewerage Company Limited (EWSC) is a Commercial Water utility company providing water and sanitation services to all the districts in (...)"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=Eastern+Water+and+Sewerage+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIIkQg",
        "text": "See web results for Eastern Water and Sewerage Company Limited"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJJbmZvcm1hdGlvbiBcdTAwMjYgVGVjaG5vbG9neSBPZmZpY2VyIiwiaHRpZG9jaWQiOiJ5SGctS2RHOXBfSkVNUjJRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6Ii5uRmcyZWJ7Zm9udC13ZWlnaHQ6NTAwfS5CaTZEZGN7Zm9udC13ZWlnaHQ6NTAwfUFwcGx5IG9uIFdvcmsgSW4gQWZyaWNhIiwibGluayI6Imh0dHBzOi8vd29ya2luYWZyaWNhLmNvbS9qb2JzLzkyL2RpcmVjdGV1ci1qdXJpZGlxdWUvZWFzdGVybi13YXRlci1hbmQtc2V3ZXJhZ2UtY29tcGFueS1saW1pdGVkP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Plant Operators/ Plant Attendants",
    "company_name": "North Western Water Supply and Sanitation Company Limited",
    "location": "  Solwezi   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\nJob Purpose\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\nQualifications and/ or skills\n• Full Grade twelve (12) School Certificate with at least five (5) ‘O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from... theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nEducation Requirement: No Requirements\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\nJob Purpose\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\nQualifications and/ or skills\n• Full Grade twelve (12) School Certificate with at least five (5) ‘O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from... theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nEducation Requirement: No Requirements\n\nJob Experience: No Requirements\n\nWork Hours: 8\n\nExperience in Months:\n\nLevel of Education"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=North+Western+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIIvgg",
        "text": "See web results for North Western Water Supply and Sanitation Company Limited"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQbGFudCBPcGVyYXRvcnMvIFBsYW50IEF0dGVuZGFudHMiLCJodGlkb2NpZCI6IlJiWjllRU15NllGaWZFT0FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlYXQgWmFtYmlhIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ3JlYXR6YW1iaWFqb2JzLmNvbS9qb2JzL2pvYi1kZXRhaWwvam9iLVBsYW50LU9wZXJhdG9ycy1QbGFudC1BdHRlbmRhbnRzLWpvYi1hdC1Ob3J0aC1XZXN0ZXJuLVdhdGVyLVN1cHBseS1hbmQtU2FuaXRhdGlvbi1Db21wYW55LUxpbWl0ZWQtNDkyODk/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Mutiple Job positions",
    "company_name": "Mulonga Water Supply and Sanitation Company Limited",
    "location": "  Chingola   ",
    "via": "via My Zambian Jobs",
    "description": "JOB OPPORTUNITIES\n\nMulonga Water Supply and Sanitation Company Ltd is a dynamic and vibrant Company providing water and sanitation services in the Municipalities of Chingola, Mufulira and Chililabombwe. At Mulonga, all employees play a crucial role in moving the company “towards purified excellence”. Thus Mulonga acknowledges the importance of having a team that will actualize its objectives and ultimately transform Mulonga into “the most admired utility in Africa”. To ensure this is achieved, Mulonga commits to attract and retain the best employees through a systematic talent management process.\n\nApplications are now invited from suitably qualified candidates to join the team in the positions listed below;\n\n1. PERI URBAN MANAGER (x1) – 3 year Contract\n\nPurpose of Job\n\nTo ensure effective planning, design and implementation of Peri-urban strategic programs/projects in line with the universal coverage policy as well as manage the overall operations of the Peri-urban zones in the three... divisions in an effective and efficient manner so as to optimize provision of water and sewerage services to the poor and vulnerable communities.\n\nKey Responsibilities\n\nOversee all Peri-urban operational plans/programs so as to ensure quality services to the low income areas through managing all technical, commercial and social activities therein.\n\nFacilitates the development of suitable approaches to ensure sustainable water and sanitation services to Peri-urban areas\n\nProvides technical institutional and institutional advise to Mulonga in relation to effective delivery water, sanitation and hygiene services to the poor and vulnerable groups in targeted areas/communities.\n\nLeads and participate in the design of projects related to rehabilitation and/or expansions of water and sewer infrastructure in Peri-urban areas and supervise such works once they commence\n\nCo-ordinates activities in the collection of asset data related to water and sanitation infrastructure for prospects of funding assistance\n\nParticipates in feasibility studies of new projects and preparations of Bill of Quantities (BOQs)\n\nEnsures implementation of all company policies and programs in Peri-urban zones viz: customer care, operational, safety and health, and employee welfare\n\nWorks with the community development officer and public relations department to ensure that the targeted Peri-urban are sensitized and educated on MWSC services\n\nCarries out routine hydraulic analysis of water reticulation system in order to advice technical team on the performance of the network so as to optimize service delivery to customers\n\nRegularly makes community visits to ensure that programs are being followed by staff and collect first-hand information from customers on the performance of field staff and appreciate their actual challenges\n\nPrepares and submits periodic and adhoc reports covering operations and gives recommendations and sectional budget and submits same to superior for approval\n\nFormulates the most viable cost recovery implementation plan of use fees to ensure sustainability of services provided in Peri-urban areas\n\nKnowledge and Skill Requirements\n\nGrade 12 Certificate with 5 ‘O’ Levels\n\nDegree in Business Studies\n\nMaster’s Degree will be an added advantage\n\nA qualification in an engineering related field will be an added advantage\n\nMinimum 5 years’ experience in the water sector or any comparable organisation\n\nAbility to mobilise communities\n\nGood communications and presentation skills\n\nAbility to identify and resolve problems\n\n2. MANAGEMENT SECRETARY (x2) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo provide secretarial and administrative support to the superior in order to ensure efficient and effective operation of the Director’s office\n\nKey Responsibilities\n\nTypes all correspondence/documents in order to ensure that all correspondence and other documents are efficiently typed and submits for quick action.\n\nMaintains all correspondences/documents accurately and keeps a record of the Superior‘s appointments.\n\nReceives telephone calls and takes down messages appropriately.\n\nEnsures that all confidential and other documents from both internal and external sources are well secured.\n\nEnsure that visitors/clients are attended to and that their queries are appropriately attended to.\n\nMaintains all office use materials/Teas and Stationery for the Director‘s office and other staff members by making sure the Offices have all the stationery required at the right time and give support staff services to basic administration work in the Department.\n\nEnsures that every instruction given by the immediate supervisor to other staff members is coordinated appropriately at all times.\n\nEnsures that stock levels of stationery are maintained for the smooth operations of the office.\n\nOperates standard office equipment: computer, fax machine, photocopier, scanner, binder, laminator and shredder.\n\nProcesses travel documents, makes flight bookings and draws necessary allowances for superior\n\nPrepares and maintains accurate talk time schedules for superior and ensures that same is timely distributed.\n\nReconciles and ensure availability of petty cash\n\nPerforms any other duties that may be assigned from time to time\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\n\nDiploma in Secretarial Services\n\nDiploma in Management Studies will be an added advantage\n\n3 – 5 years’ experience in a similar role in a comparable organization\n\nAbility to conceptualize ideas and communicate effectively both orally and in writing\n\nAbility to develop new ideas.\n\n3. DRIVER/EQUIPMENT OPERATOR (x1) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo drive a motor vehicle in order to transport the Company’s staff and equipment as directed.\n\nKey Responsibilities\n\nCarries out pre-shift checks on motor vehicle for oil, water, tyre pressure and any visible defects, reports noted faults timely in order to affect repairs.\n\nEnsures that spare wheel, jack, triangles, first Aid box, wheel spanner or any other accessories are in the vehicle prior to depart and on arrival.\n\nDrives a motor vehicle to transport staff and equipment to assigned destination and undertakes errands on behalf of the corporation.\n\nOperates equipment (Tractor, Crane Mounted Vehicle, Vacuum Tanker) as may be assigned from time to time\n\nDelivers mails documents timely as directed by superior and ensures that all the assignments are met.\n\nUndertakes minor repairs and maintenance in faults detected on the vehicle and reports major ones to superior.\n\nReports any accident involving a Company vehicle, immediately reports to the police and makes a sketch of the position of the vehicle, takes the particulars of the other vehicle and Driver, and at the earliest opportunity reports to the supervisor\n\nEnsures that the motor vehicle is adequately insured and is road worthy to avoid contravening traffic rulesregulation and road.\n\nMaintains a log book for the motor vehicle detailing mileage covered before and after the trip\n\nReminds superior when the motor vehicle is due for service or maintenance.\n\nParks the assigned vehicle in a safe and authorized area in order to guarantee its safety\n\nClean the motor vehicle and ensure that it is kept clean at all times\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\n\nClass C Driving Licence\n\nSADC PSV Driving Licence will be an added advantage\n\nAbility to operate Crane Mounted Vehicle, Tractor, Vacuum Tanker\n\nBasic Mechanical knowledge will be an added advantage\n\n3 – 5 years’ experience\n\nIf you have the necessary competences/qualifications we are looking for, please submit your application together with a comprehensive C.V. as one document including your contact telephone number and copies of your certificates and names of three referees to careers@mwsc.com.zm not later than Tuesday, 5th December 2023.\n\nPlease use your name & position being applied for in the Subject. MWSC employees are encouraged to apply. Please note that only short listed candidates will be communicated to.\n\nMWSC is an Equal Employment Opportunity Employer and female candidates are especially encouraged to apply.\n\nApplications should be addressed to:\n\nThe Director Human Resources and Administration\n\nMulonga Water Supply and Sanitation Company Limited\n\nMusonko House, Kabundi Road\n\nP O Box 11712\n\nCHINGOLA.\n\n“Mulonga – “Towards Purified Excellence”",
    "job_highlights": [
      {
        "items": [
          "JOB OPPORTUNITIES\n\nMulonga Water Supply and Sanitation Company Ltd is a dynamic and vibrant Company providing water and sanitation services in the Municipalities of Chingola, Mufulira and Chililabombwe. At Mulonga, all employees play a crucial role in moving the company “towards purified excellence”. Thus Mulonga acknowledges the importance of having a team that will actualize its objectives and ultimately transform Mulonga into “the most admired utility in Africa”. To ensure this is achieved, Mulonga commits to attract and retain the best employees through a systematic talent management process.\n\nApplications are now invited from suitably qualified candidates to join the team in the positions listed below;\n\n1. PERI URBAN MANAGER (x1) – 3 year Contract\n\nPurpose of Job\n\nTo ensure effective planning, design and implementation of Peri-urban strategic programs/projects in line with the universal coverage policy as well as manage the overall operations of the Peri-urban zones in the three... divisions in an effective and efficient manner so as to optimize provision of water and sewerage services to the poor and vulnerable communities.\n\nKey Responsibilities\n\nOversee all Peri-urban operational plans/programs so as to ensure quality services to the low income areas through managing all technical, commercial and social activities therein.\n\nFacilitates the development of suitable approaches to ensure sustainable water and sanitation services to Peri-urban areas\n\nProvides technical institutional and institutional advise to Mulonga in relation to effective delivery water, sanitation and hygiene services to the poor and vulnerable groups in targeted areas/communities.\n\nLeads and participate in the design of projects related to rehabilitation and/or expansions of water and sewer infrastructure in Peri-urban areas and supervise such works once they commence\n\nCo-ordinates activities in the collection of asset data related to water and sanitation infrastructure for prospects of funding assistance\n\nParticipates in feasibility studies of new projects and preparations of Bill of Quantities (BOQs)\n\nEnsures implementation of all company policies and programs in Peri-urban zones viz: customer care, operational, safety and health, and employee welfare\n\nWorks with the community development officer and public relations department to ensure that the targeted Peri-urban are sensitized and educated on MWSC services\n\nCarries out routine hydraulic analysis of water reticulation system in order to advice technical team on the performance of the network so as to optimize service delivery to customers\n\nRegularly makes community visits to ensure that programs are being followed by staff and collect first-hand information from customers on the performance of field staff and appreciate their actual challenges\n\nPrepares and submits periodic and adhoc reports covering operations and gives recommendations and sectional budget and submits same to superior for approval\n\nFormulates the most viable cost recovery implementation plan of use fees to ensure sustainability of services provided in Peri-urban areas\n\nKnowledge and Skill Requirements\n\nGrade 12 Certificate with 5 ‘O’ Levels\n\nDegree in Business Studies\n\nMaster’s Degree will be an added advantage\n\nA qualification in an engineering related field will be an added advantage\n\nMinimum 5 years’ experience in the water sector or any comparable organisation\n\nAbility to mobilise communities\n\nGood communications and presentation skills\n\nAbility to identify and resolve problems\n\n2. MANAGEMENT SECRETARY (x2) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo provide secretarial and administrative support to the superior in order to ensure efficient and effective operation of the Director’s office\n\nKey Responsibilities\n\nTypes all correspondence/documents in order to ensure that all correspondence and other documents are efficiently typed and submits for quick action.\n\nMaintains all correspondences/documents accurately and keeps a record of the Superior‘s appointments.\n\nReceives telephone calls and takes down messages appropriately.\n\nEnsures that all confidential and other documents from both internal and external sources are well secured.\n\nEnsure that visitors/clients are attended to and that their queries are appropriately attended to.\n\nMaintains all office use materials/Teas and Stationery for the Director‘s office and other staff members by making sure the Offices have all the stationery required at the right time and give support staff services to basic administration work in the Department.\n\nEnsures that every instruction given by the immediate supervisor to other staff members is coordinated appropriately at all times.\n\nEnsures that stock levels of stationery are maintained for the smooth operations of the office.\n\nOperates standard office equipment: computer, fax machine, photocopier, scanner, binder, laminator and shredder.\n\nProcesses travel documents, makes flight bookings and draws necessary allowances for superior\n\nPrepares and maintains accurate talk time schedules for superior and ensures that same is timely distributed.\n\nReconciles and ensure availability of petty cash\n\nPerforms any other duties that may be assigned from time to time\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\n\nDiploma in Secretarial Services\n\nDiploma in Management Studies will be an added advantage\n\n3 – 5 years’ experience in a similar role in a comparable organization\n\nAbility to conceptualize ideas and communicate effectively both orally and in writing\n\nAbility to develop new ideas.\n\n3. DRIVER/EQUIPMENT OPERATOR (x1) – Permanent & Pensionable\n\nPurpose of the Job\n\nTo drive a motor vehicle in order to transport the Company’s staff and equipment as directed.\n\nKey Responsibilities\n\nCarries out pre-shift checks on motor vehicle for oil, water, tyre pressure and any visible defects, reports noted faults timely in order to affect repairs.\n\nEnsures that spare wheel, jack, triangles, first Aid box, wheel spanner or any other accessories are in the vehicle prior to depart and on arrival.\n\nDrives a motor vehicle to transport staff and equipment to assigned destination and undertakes errands on behalf of the corporation.\n\nOperates equipment (Tractor, Crane Mounted Vehicle, Vacuum Tanker) as may be assigned from time to time\n\nDelivers mails documents timely as directed by superior and ensures that all the assignments are met.\n\nUndertakes minor repairs and maintenance in faults detected on the vehicle and reports major ones to superior.\n\nReports any accident involving a Company vehicle, immediately reports to the police and makes a sketch of the position of the vehicle, takes the particulars of the other vehicle and Driver, and at the earliest opportunity reports to the supervisor\n\nEnsures that the motor vehicle is adequately insured and is road worthy to avoid contravening traffic rulesregulation and road.\n\nMaintains a log book for the motor vehicle detailing mileage covered before and after the trip\n\nReminds superior when the motor vehicle is due for service or maintenance.\n\nParks the assigned vehicle in a safe and authorized area in order to guarantee its safety\n\nClean the motor vehicle and ensure that it is kept clean at all times\n\nKnowledge and Skill Requirements:\n\nGrade 12 Certificate with Five (5) O Levels\n\nClass C Driving Licence\n\nSADC PSV Driving Licence will be an added advantage\n\nAbility to operate Crane Mounted Vehicle, Tractor, Vacuum Tanker\n\nBasic Mechanical knowledge will be an added advantage\n\n3 – 5 years’ experience\n\nIf you have the necessary competences/qualifications we are looking for, please submit your application together with a comprehensive C.V. as one document including your contact telephone number and copies of your certificates and names of three referees to careers@mwsc.com.zm not later than Tuesday, 5th December 2023.\n\nPlease use your name & position being applied for in the Subject. MWSC employees are encouraged to apply. Please note that only short listed candidates will be communicated to.\n\nMWSC is an Equal Employment Opportunity Employer and female candidates are especially encouraged to apply.\n\nApplications should be addressed to:\n\nThe Director Human Resources and Administration\n\nMulonga Water Supply and Sanitation Company Limited\n\nMusonko House, Kabundi Road\n\nP O Box 11712\n\nCHINGOLA.\n\n“Mulonga – “Towards Purified Excellence”"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=Mulonga+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAII7Ag",
        "text": "See web results for Mulonga Water Supply and Sanitation Company Limited"
      }
    ],
    "extensions": [
      "3 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJNdXRpcGxlIEpvYiBwb3NpdGlvbnMiLCJodGlkb2NpZCI6IlJVempBZkY0RGp1X2xHYldBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTXkgWmFtYmlhbiBKb2JzIiwibGluayI6Imh0dHBzOi8vbXl6YW1iaWFuam9icy5jb20vam9iL211bG9uZ2Etd2F0ZXItc3VwcGx5LWFuZC1zYW5pdGF0aW9uLWNvbXBhbnktbGltaXRlZC1jaGluZ29sYS01LW11dGlwbGUtam9iLXBvc2l0aW9ucy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Terms of Reference (TORs) for the Development of Guidelines for...",
    "company_name": "RTI-International",
    "location": "  Lusaka   ",
    "via": "via GoZambiaJobs",
    "description": "Contract Type: Short Term Technical Assistant-Consultancy\n\nTerms of Reference (TORs) for the Development of Guidelines for Rural Water Supply and Sanitation Service Delivery.\n\nProject Background:\n\nThe United States Agency for International Development (USAID) has launched the Expanding Water and Sanitation project (Expanding WASH) in Zambia. This is a 5-year project working to achieve three objectives namely (i) professionalize water, sanitation, and hygiene (WASH) services (ii) promote accountability for reliable and high-quality WASH services, and (iii) promote private sector engagement (PSE) in WASH service delivery in Zambia. Research Triangle Institute International (RTII) leads the implementation of the USAID Expanding WASH Project in Zambia during the period 27th January 2022 to January 26, 2027.\n\nThe project is implemented in 12 districts in different four provinces as follows: Kalomo and Kazungula (Southern Province); Kaoma, Mongu, Kalabo, Nalolo and Sesheke (Western... Province); Lunte and Mungwi (Northern Province); and Mpika, Nakonde, and Chinsali (Muchinga Province). There are three water utility companies responsible for the provision of water and sanitation services in the four provinces and these are namely Chambeshi, Southern, and Western Water Supply and Sanitation Companies. In this regard, the Project has been working with and support the three water utility companies.\n\nScope of Work\n\nUnder objective 3, the project aims to increase private sector participation in WASH service delivery. This will be undertaken through Task 3.2.1 under Sub-Objective 3.2 which focusses on strengthening regulatory instruments for rural water supply service delivery. In this regard, the project will support the three water utility companies to develop Standard Operating Procedures (SOPs) for Rural Water Supply and Sanitation Service Delivery. The development of these guidelines by CUs is in line with the requirement by the National Water Supply and Sanitation Council NWASCO in 2019. This followed Governments directive in 2018 that Water Utility Companies should provide water supply and sanitation services not only in urban areas but in rural areas as well. NWASCO therefore developed the Rural Water Supply and Sanitation Framework for Provision and Regulation to guide water utilities regarding Rural Water Supply and Sanitation Service Delivery. The framework outlines 16 sets of guidelines that were to be developed by NWASCO of which Six have been developed and these as follows:\n\ni. Minimum service level guidelines for rural WSS – for ensuring rural water schemes adhere to set minimum service levels.\n\nii.Water quality monitoring guidelines – for ensuring minimum required parameters and numbers of tests and sanitary inspections are carried out.\n\niii.Tariff setting and accounting guidelines – for ensuring that beneficiaries contribute to the operation and maintenance and monitoring of financial sustainability of water schemes.\n\niv.City Wise Inclusive Sanitation (CWIS) planning guidelines.\n\nv. Inclusive sanitation services provision guidelines; and\n\nvi. Asset management guidelines.\n\nBased on these guidelines, water utility companies needed to develop own context based Standard Operating Procedures (SOPs) to guide their operations in the provision of Water Supply and Sanitation Services to communities in Rural Areas as required of them by NWASCO.\n\nIn this regard, USAID Expanding Water and Sanitation Project is supporting three Water Utility Companies to develop own Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas. Therefore, The Project is seeking short term consultancy services to assist three water utility companies to develop SOPs for the provision of water supply and sanitation services in rural areas by water utility companies.\n\nKey Deliverables:\n\nThe consultant will be expected to attain three key deliverables, and these are namely:\n\ni. Prepare a status report on guidelines for rural water supply and sanitation service delivery.\n\nii. Identify the scope of works to be covered in the Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by Water Utility Companies.\n\niii. Produce Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by water utility companies.\n\nDuties and Responsibilities:\n\ni. Identify and review policies, legislation, regulations, guidelines, strategies and programmes on rural water supply and sanitation service delivery in Zambia.\n\nii. Undertake a comparative review of guidelines and practices/SOPs for rural water supply and sanitation service delivery in some countries within the Southern African Region.\n\niii. Identify the scope of work to be covered in the Standard Operating Procedures for the provision Water Supply and Sanitation Services in Rural Areas; and\n\niv. Develop Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by water utility companies.\n\nCommunication and Management\n\nThe consultant will report and work closely with the Policy and Regulatory Specialist, Edwin Peteli, email address epeteli@expandingwash.org.\n\nWorking Arrangements\n\nThe Independent Contractor will undertake the assignment from the USAID Expanding Water and Sanitation Project office at Plot 610 Luano Road Rhodes Park Lusaka.\n\nRequirements\n• Minimum 5 years of progressive work experience in the WASH sector with a postgraduate degree in any of the following: civil engineering, water engineering, social work, development studies, economics, or any other related field; or minimum 10 years of work experience in the WASH sector with a bachelor’s degree or equivalent in civil engineering, water engineering, social work, development studies, economics, or any other related field.\n• Relevant experience with organizations such as USAID or other international organizations, non-governmental organization, government, or water utility is essential.\n• Attention to detail, able to meet deadlines and produce quality documents.\n• Excellent Microsoft Office skills (Word, PowerPoint, Publisher).\n• Zambian experience preferred.\n\nApplication process\n\nSuitably qualified candidates can submit their application letter and curriculum vitae to procurement-zewash@rti.org no later than 14th December 2023 at 5pm Zambian Time. All applications should clearly indicate in the email subject as “Application for Objective-3 Consultancy”",
    "job_highlights": [
      {
        "items": [
          "Contract Type: Short Term Technical Assistant-Consultancy\n\nTerms of Reference (TORs) for the Development of Guidelines for Rural Water Supply and Sanitation Service Delivery.\n\nProject Background:\n\nThe United States Agency for International Development (USAID) has launched the Expanding Water and Sanitation project (Expanding WASH) in Zambia. This is a 5-year project working to achieve three objectives namely (i) professionalize water, sanitation, and hygiene (WASH) services (ii) promote accountability for reliable and high-quality WASH services, and (iii) promote private sector engagement (PSE) in WASH service delivery in Zambia. Research Triangle Institute International (RTII) leads the implementation of the USAID Expanding WASH Project in Zambia during the period 27th January 2022 to January 26, 2027.\n\nThe project is implemented in 12 districts in different four provinces as follows: Kalomo and Kazungula (Southern Province); Kaoma, Mongu, Kalabo, Nalolo and Sesheke (Western... Province); Lunte and Mungwi (Northern Province); and Mpika, Nakonde, and Chinsali (Muchinga Province). There are three water utility companies responsible for the provision of water and sanitation services in the four provinces and these are namely Chambeshi, Southern, and Western Water Supply and Sanitation Companies. In this regard, the Project has been working with and support the three water utility companies.\n\nScope of Work\n\nUnder objective 3, the project aims to increase private sector participation in WASH service delivery. This will be undertaken through Task 3.2.1 under Sub-Objective 3.2 which focusses on strengthening regulatory instruments for rural water supply service delivery. In this regard, the project will support the three water utility companies to develop Standard Operating Procedures (SOPs) for Rural Water Supply and Sanitation Service Delivery. The development of these guidelines by CUs is in line with the requirement by the National Water Supply and Sanitation Council NWASCO in 2019. This followed Governments directive in 2018 that Water Utility Companies should provide water supply and sanitation services not only in urban areas but in rural areas as well. NWASCO therefore developed the Rural Water Supply and Sanitation Framework for Provision and Regulation to guide water utilities regarding Rural Water Supply and Sanitation Service Delivery. The framework outlines 16 sets of guidelines that were to be developed by NWASCO of which Six have been developed and these as follows:\n\ni. Minimum service level guidelines for rural WSS – for ensuring rural water schemes adhere to set minimum service levels.\n\nii.Water quality monitoring guidelines – for ensuring minimum required parameters and numbers of tests and sanitary inspections are carried out.\n\niii.Tariff setting and accounting guidelines – for ensuring that beneficiaries contribute to the operation and maintenance and monitoring of financial sustainability of water schemes.\n\niv.City Wise Inclusive Sanitation (CWIS) planning guidelines.\n\nv. Inclusive sanitation services provision guidelines; and\n\nvi. Asset management guidelines.\n\nBased on these guidelines, water utility companies needed to develop own context based Standard Operating Procedures (SOPs) to guide their operations in the provision of Water Supply and Sanitation Services to communities in Rural Areas as required of them by NWASCO.\n\nIn this regard, USAID Expanding Water and Sanitation Project is supporting three Water Utility Companies to develop own Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas. Therefore, The Project is seeking short term consultancy services to assist three water utility companies to develop SOPs for the provision of water supply and sanitation services in rural areas by water utility companies.\n\nKey Deliverables:\n\nThe consultant will be expected to attain three key deliverables, and these are namely:\n\ni. Prepare a status report on guidelines for rural water supply and sanitation service delivery.\n\nii. Identify the scope of works to be covered in the Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by Water Utility Companies.\n\niii. Produce Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by water utility companies.\n\nDuties and Responsibilities:\n\ni. Identify and review policies, legislation, regulations, guidelines, strategies and programmes on rural water supply and sanitation service delivery in Zambia.\n\nii. Undertake a comparative review of guidelines and practices/SOPs for rural water supply and sanitation service delivery in some countries within the Southern African Region.\n\niii. Identify the scope of work to be covered in the Standard Operating Procedures for the provision Water Supply and Sanitation Services in Rural Areas; and\n\niv. Develop Standard Operating Procedures for the provision of Water Supply and Sanitation Services in Rural Areas by water utility companies.\n\nCommunication and Management\n\nThe consultant will report and work closely with the Policy and Regulatory Specialist, Edwin Peteli, email address epeteli@expandingwash.org.\n\nWorking Arrangements\n\nThe Independent Contractor will undertake the assignment from the USAID Expanding Water and Sanitation Project office at Plot 610 Luano Road Rhodes Park Lusaka.\n\nRequirements\n• Minimum 5 years of progressive work experience in the WASH sector with a postgraduate degree in any of the following: civil engineering, water engineering, social work, development studies, economics, or any other related field; or minimum 10 years of work experience in the WASH sector with a bachelor’s degree or equivalent in civil engineering, water engineering, social work, development studies, economics, or any other related field.\n• Relevant experience with organizations such as USAID or other international organizations, non-governmental organization, government, or water utility is essential.\n• Attention to detail, able to meet deadlines and produce quality documents.\n• Excellent Microsoft Office skills (Word, PowerPoint, Publisher).\n• Zambian experience preferred.\n\nApplication process\n\nSuitably qualified candidates can submit their application letter and curriculum vitae to procurement-zewash@rti.org no later than 14th December 2023 at 5pm Zambian Time. All applications should clearly indicate in the email subject as “Application for Objective-3 Consultancy”"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.rti.org/",
        "text": "rti.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=RTI-International&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIInQk",
        "text": "See web results for RTI-International"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJgDeJs_xWBZb-8-fAFOzsjTKX7AtPk5Qx8Ik9LlvS-zGWWSehLufZ&s",
    "extensions": [
      "2 days ago",
      "Part-time and Contractor"
    ],
    "detected_extensions": {
      "posted_at": "2 days ago",
      "schedule_type": "Part-time and Contractor"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJUZXJtcyBvZiBSZWZlcmVuY2UgKFRPUnMpIGZvciB0aGUgRGV2ZWxvcG1lbnQgb2YgR3VpZGVsaW5lcyBmb3IgUnVyYWwgV2F0ZXIgU3VwcGx5IGFuZCBTYW5pdGF0aW9uIFNlcnZpY2UgRGVsaXZlcnktQ29uc3VsdGFuY3kiLCJodGlkb2NpZCI6ImlGckcyczRkVEQ3X0JNYzBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVV4UGJuQlpWVGRqTVZvdE1rMW1ORFZNTUZCUGFESjVNM0p2WmtzeVVVTXdZa3d0ZGw5VlNsQm9aREJpVDBoM1ZVRk1ZMnBYVDJaRWIwRm5WVWh6VXpSYWVGRlljVjk1VGxrMmMyNUtSVnBHVjA5WVVHaDRWMTlJV0ROSGVEazFia3R5TkVwU1ZuVlVRMVZST1ZoRFJuaFhVamhFUjBGdmRVdGpXVFYwUmtWdk1IWnJNVzlIZEZCbGFFMVJlbTlqVGs1elMwZEZRM2R4U2paM1NtVjFZV1JGTTJkWE9VUjJSSEptTm5neGIyMUhMVzVPTjJSckVoZEhhazV5V21aVFVVRTNUMEkxVDAxUWRYTTJWbXRCTkJvaVFVcDNheTA0WkhNMGNHTkpTMkpZVTFCZlVUTnhlRUpFWjJFNGVVMHpSVmt3UVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IGRpcmVjdGx5IG9uIEdvWmFtYmlhSm9icyIsImxpbmsiOiJodHRwczovL2dvemFtYmlham9icy5jb20vam9iL3J0aS1pbnRlcm5hdGlvbmFsLWx1c2FrYS16YW1iaWEtcGFydC10aW1lLXRlcm1zLW9mLXJlZmVyZW5jZS10b3JzLWZvci10aGUtZGV2ZWxvcG1lbnQtb2YtZ3VpZGVsaW5lcy1mb3ItcnVyYWwtd2F0ZXItc3VwcGx5LWFuZC1zYW5pdGF0aW9uLXNlcnZpY2UtZGVsaXZlcnktY29uc3VsdGFuY3kvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Multiple Positions",
    "company_name": "North Western Water Supply and Sanitation Company Limited",
    "location": "  Solwezi   ",
    "via": "via Talent.com",
    "description": "JOB OPPORTUNITIES\n\nThe North Western Water Supply and Sanitation Company Limited (NWWSSCL) is a commercial utility, providing water and sanitation services in the North Western Province.\n\nThe Company has a vision of striving for excellence in water supply and sanitation . It is value driven and performance oriented and since inception in the year has been among the top performing utilities.\n\nNWWSSCL is an equal opportunity employer and seeks to recruit high profile, self-motivated, innovative, honest, committed, adequately qualified and appropriately experienced persons to fill the following vacant position in a challenging environment.\n\nThe Company operates in eight Districts.\n\n1. PUBLIC RELATIONS OFFICER\n\nReports to : Head Corporate Planning\n\nJob Details\n\nThe position requires a dynamic, self-motivated person with proven Public Relations experience and the ability to work with minimum supervision.\n\nResponsibilities\n• Develop PR campaigns and media relations strategies;\n• Efficiently... producing and effectively disseminating approved publicity materials (brochures, videos, social media posts etc.\n• developing good relationship with customers, stakeholders and the media;\n• Formulation of Public Relations policies and procedures;\n• Organize PR events (e.g. open days, press conferences) prepare and distribute press releases;\n• Management of customer relationship activities to ensure attainment of customer satisfaction;\n• Seek opportunities for partnerships, sponsorships and advertising;\n• Address inquiries from the media, track media coverage and follow industry trends.\n\nQualifications and Experience\n• Full Grade twelve School Certificate with at least five O’ level credits including English language and Mathematics;\n• Degree in Public Relations, Journalism, Mass Communications or a related field;\n• Diploma in Public administration will be an added advantage;\n• Computer literate fully conversant with Microsoft Word, Excel and Internet;\n• At least 3 years working experience in a similar position;\n• Excellent communication skills (oral and written), proactive and innovative, able to plan events, good organizational skills with assertive attitude;\n• Experience managing media relations (online, broadcast and print);\n• Member of the Zambia Institute of Public Relations and Communication.\n\n2. PLANT OPERATORS / PLANT ATTENDANTS\n\nJob Purpose\n\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\n\nQualifications and / or skills\n• Full Grade twelve School Certificate with at least five O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nThe Human Resource and administration Manager\n\nNorth Western Water Supply and Sanitation Company Limited\n\nMEMA House\n\nP O Box\n\nSOLWEZI\n\nNorth Western Water Supply and Sanitation Company Limited upholds the principle of equal employment opportunities. Only shortlisted Candidates will be contacted",
    "job_highlights": [
      {
        "items": [
          "JOB OPPORTUNITIES\n\nThe North Western Water Supply and Sanitation Company Limited (NWWSSCL) is a commercial utility, providing water and sanitation services in the North Western Province.\n\nThe Company has a vision of striving for excellence in water supply and sanitation . It is value driven and performance oriented and since inception in the year has been among the top performing utilities.\n\nNWWSSCL is an equal opportunity employer and seeks to recruit high profile, self-motivated, innovative, honest, committed, adequately qualified and appropriately experienced persons to fill the following vacant position in a challenging environment.\n\nThe Company operates in eight Districts.\n\n1. PUBLIC RELATIONS OFFICER\n\nReports to : Head Corporate Planning\n\nJob Details\n\nThe position requires a dynamic, self-motivated person with proven Public Relations experience and the ability to work with minimum supervision.\n\nResponsibilities\n• Develop PR campaigns and media relations strategies;\n• Efficiently... producing and effectively disseminating approved publicity materials (brochures, videos, social media posts etc.\n• developing good relationship with customers, stakeholders and the media;\n• Formulation of Public Relations policies and procedures;\n• Organize PR events (e.g. open days, press conferences) prepare and distribute press releases;\n• Management of customer relationship activities to ensure attainment of customer satisfaction;\n• Seek opportunities for partnerships, sponsorships and advertising;\n• Address inquiries from the media, track media coverage and follow industry trends.\n\nQualifications and Experience\n• Full Grade twelve School Certificate with at least five O’ level credits including English language and Mathematics;\n• Degree in Public Relations, Journalism, Mass Communications or a related field;\n• Diploma in Public administration will be an added advantage;\n• Computer literate fully conversant with Microsoft Word, Excel and Internet;\n• At least 3 years working experience in a similar position;\n• Excellent communication skills (oral and written), proactive and innovative, able to plan events, good organizational skills with assertive attitude;\n• Experience managing media relations (online, broadcast and print);\n• Member of the Zambia Institute of Public Relations and Communication.\n\n2. PLANT OPERATORS / PLANT ATTENDANTS\n\nJob Purpose\n\nTo operate Water Treatment Plants and Booster Stations in a professional manner and ensure water production, distribution and quality targets are met.\n\nQualifications and / or skills\n• Full Grade twelve School Certificate with at least five O’ level credits including English language and Mathematics;\n• Craft Certificate in water supply operations;\n• Must provide own accommodation in Solwezi district.\n• Member of EIZ\n\nResponsibilities\n• Operation of both raw and high lift water pumps;\n• Operation and management of flocculators, sedimentation tanks and filters;\n• Proper usage and dosing of water treatment chemicals;\n• Maintaining relevant plant records;\n• Carry out Basic Electrical and Mechanical routine planned and repair maintenance;\n• Maintaining working environment in an acceptable state of cleanness and tidiness;\n• Handing over plant to relieving operator in a systematic manner;\n• Securing plant equipment from damage from preventable causes and from theft.;\n• Carry out any other duties as assigned from time to time by senior officials;\n• And other responsibilities that may be assigned by the hierarchy in the interest of the company.\n\nThe Human Resource and administration Manager\n\nNorth Western Water Supply and Sanitation Company Limited\n\nMEMA House\n\nP O Box\n\nSOLWEZI\n\nNorth Western Water Supply and Sanitation Company Limited upholds the principle of equal employment opportunities. Only shortlisted Candidates will be contacted"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=North+Western+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIIywk",
        "text": "See web results for North Western Water Supply and Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQvhPobI5Cix-M6opDRV8tMmEBOJ3TBd0_3xOyUS1I&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJNdWx0aXBsZSBQb3NpdGlvbnMiLCJodGlkb2NpZCI6IjhhZ2dhbmZDbmZ1VDRKZ2NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gVGFsZW50LmNvbSIsImxpbmsiOiJodHRwczovL3ptLnRhbGVudC5jb20vdmlldz9pZD0yZjE5MGM4ZmY5OGJcdTAwMjZ1dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Wash Specialist",
    "company_name": "Habitat for Humanity",
    "location": "  Lusaka   ",
    "via": "via Jobs Mu Zambia",
    "description": "Title: WASH SPECIALIST\n\nDepartment Name: PROGRAMS\n\nReports to Title: HEAD OF PROGRAMS\n\nCross Functional Reports to Title: AFRICA AREA OFFICE SENIOR SPECIALIST – WASH\n\nPosition Summary:\n\nReporting to the Head of programs, the WASH Specialist is responsible for development, preparation, management, implementation, monitoring and evaluation of Water, Sanitation, and Hygiene (WASH) Infrastructure interventions within the HFH Country program. The purpose of the position is to provide technical guidance and management support for the improvement of access to sustainable WASH services and over all wellbeing of communities.\n\nEssential Duties and Responsibilities:\n\nConduct technical assessments and data analysis of WASH services.\n\nDevelop WASH designs, Bill of Quantities (BoQs), drawings, technical specifications, and tender documents.\n\nSupport procurement of WASH projects in collaboration with Programs. Manager/ tender committee, Prepare and launch tender bidding procedure for... contractor(s).\n\nSupervise and monitor engineering works related to WASH projects in the country.\n\nInspect and certify all WASH Infrastructure before contractors are paid.\n\nEnsure that expenditures and budgets are well monitored and activities are implemented and completed within budget and schedule.\n\nEnsure that all WASH infrastructure are within the acceptable sector and country standards.\n\nPlan and organize capacity building programs for community water management committees, water quality surveillance and response planning, sanitation and hygiene promotion.\n\nSupervise and manage the performance of WASH officers, construction officers, sanitation officers and hygiene promoters.\n\nIn liaison with Africa Area Snr WASH specialist, NO head of program and ND, develop capacity building plan and build capacity of WASH and construction officers.\n\nSupport NO Monitoring, Evaluation, Accountability and Learning (MEAL) team to conduct monitoring and evaluation of WASH projects.\n\nSupport the resource development team when necessary in resource mobilization and drafting of WASH proposals.\n\nDevelop, compile and submit WASH project’s progress and final reports to the head of program\n\nRepresent HFHZ in National WASH sector meetings.\n\nParticipate in development of HFHZ WASH annual plans and budgets\n\nPerform other relevant tasks as assigned.\n\nSuccess Criteria:\n\nAbility to handle community and internal safeguarding issues as and when they arise following the laid down procedure.\n\nAbility to work under minimum or no supervision.\n\nMust be a team player and ready to work in and contribute to team building environment.\n\nStrong project management background with the ability to implement projects within budget and time frame.\n\nClearly understand development and disaster WASH contexts and must have some years of experience working in both contexts.\n\nExperience working with multiple donors and understand donor requirements and how to meet them.\n\nStrong capacity building and facilitation skills.\n\nExperience in integration of housing and WASH.\n\nExcellent written and verbal communication skills.\n\nComputer literate with good presentation skills.\n\nAble to use AutoCAD and ArcGIS.\n\nFluent in English (oral and written).\n\nReport and grant writing skills.\n\nAdult training and facilitation skills required.\n\nGood organizational skills including accuracy, consistency, and attention to detail.\n\nTypical Training & Experience:\n\nMinimum:\n\nEducation: Bachelor Degree in Civil, Mechanical engineering or Geological Engineering.\n\nYears of Related Experience: Over 5 years’ experience in WASH infrastructure projects (design, planning, tender procedures, implementation, budgeting, reporting, monitoring, and evaluation) and good understanding of current WASH sector trends and indicators.\n\nQualifications:\n\nPreferred – in addition to minimum:\n\nAdditional training in project management, behavioral communication or community development.\n\nActive support of HFHI Values:\n\nHumility – We are part of something bigger than ourselves\n\nCourage – We do what’s right, even when it is difficult or unpopular\n\nAccountability – We take personal responsibility for Habitat’s mission\n\nSafeguarding: HFHZ requires that all employees take seriously their ethical responsibilities to safeguarding our intended beneficiaries, their communities, and all those with whom we work. Managers at all levels have responsibilities to support and develop systems that create and maintain an environment that prevents harassment, sexual exploitation and abuse, safeguards the rights of beneficiaries and community members (especially children), and promotes the implementation of Habitat for Humanity’s code of conduct.\n\nOrganizational Scope & Impact:\n\nVarious levels of the organization are potentially impacted, depending on the nature and focus of the model or process that is being implemented.\n\nProblem Complexity, Planning and Policy level impact:\n\nIndirect but strong impact on long-term planning, as new models and processes are piloted and shared, and new ways of implementation are recommended.\n\nInfluencing/People Leadership:\n\nInternal – National Organization Staff\n\nExternal – Other NGOs, Government (Local and National), Beneficiaries and other community members.\n\nNature of leadership provided to others – To inspire others into great teams.\n\nWorking Conditions, Requirements, etc. –\n\n40 hours of work per week, with one hour lunch break and 2 health breaks on 20 minutes each in a day.\n\nLocation:\n\nThis position is based at the National Office in Lusaka.\n\nTravel Expectations: Expected to make local and international travels as and when required.\n\nWill the individual in this role typically work with children or HFH beneficiaries ( Yes ).\n\nHow to apply\n\nPlease send your letter of motivation and CV ONLY to Habitat_hr@habitatzam.org.zm. Address your application to the National Director.\n\nKindly only apply if you meet the minimum requirements for the position. Clearly state the name of the position you are applying for in the subject line.\n\nClosing Date: The closing date for applications is Monday, 19 September, 2022\n\nOnly shortlisted candidates will be contacted.\n\nHABITAT FOR HUMANITY ZAMBIA IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_highlights": [
      {
        "items": [
          "Title: WASH SPECIALIST\n\nDepartment Name: PROGRAMS\n\nReports to Title: HEAD OF PROGRAMS\n\nCross Functional Reports to Title: AFRICA AREA OFFICE SENIOR SPECIALIST – WASH\n\nPosition Summary:\n\nReporting to the Head of programs, the WASH Specialist is responsible for development, preparation, management, implementation, monitoring and evaluation of Water, Sanitation, and Hygiene (WASH) Infrastructure interventions within the HFH Country program. The purpose of the position is to provide technical guidance and management support for the improvement of access to sustainable WASH services and over all wellbeing of communities.\n\nEssential Duties and Responsibilities:\n\nConduct technical assessments and data analysis of WASH services.\n\nDevelop WASH designs, Bill of Quantities (BoQs), drawings, technical specifications, and tender documents.\n\nSupport procurement of WASH projects in collaboration with Programs. Manager/ tender committee, Prepare and launch tender bidding procedure for... contractor(s).\n\nSupervise and monitor engineering works related to WASH projects in the country.\n\nInspect and certify all WASH Infrastructure before contractors are paid.\n\nEnsure that expenditures and budgets are well monitored and activities are implemented and completed within budget and schedule.\n\nEnsure that all WASH infrastructure are within the acceptable sector and country standards.\n\nPlan and organize capacity building programs for community water management committees, water quality surveillance and response planning, sanitation and hygiene promotion.\n\nSupervise and manage the performance of WASH officers, construction officers, sanitation officers and hygiene promoters.\n\nIn liaison with Africa Area Snr WASH specialist, NO head of program and ND, develop capacity building plan and build capacity of WASH and construction officers.\n\nSupport NO Monitoring, Evaluation, Accountability and Learning (MEAL) team to conduct monitoring and evaluation of WASH projects.\n\nSupport the resource development team when necessary in resource mobilization and drafting of WASH proposals.\n\nDevelop, compile and submit WASH project’s progress and final reports to the head of program\n\nRepresent HFHZ in National WASH sector meetings.\n\nParticipate in development of HFHZ WASH annual plans and budgets\n\nPerform other relevant tasks as assigned.\n\nSuccess Criteria:\n\nAbility to handle community and internal safeguarding issues as and when they arise following the laid down procedure.\n\nAbility to work under minimum or no supervision.\n\nMust be a team player and ready to work in and contribute to team building environment.\n\nStrong project management background with the ability to implement projects within budget and time frame.\n\nClearly understand development and disaster WASH contexts and must have some years of experience working in both contexts.\n\nExperience working with multiple donors and understand donor requirements and how to meet them.\n\nStrong capacity building and facilitation skills.\n\nExperience in integration of housing and WASH.\n\nExcellent written and verbal communication skills.\n\nComputer literate with good presentation skills.\n\nAble to use AutoCAD and ArcGIS.\n\nFluent in English (oral and written).\n\nReport and grant writing skills.\n\nAdult training and facilitation skills required.\n\nGood organizational skills including accuracy, consistency, and attention to detail.\n\nTypical Training & Experience:\n\nMinimum:\n\nEducation: Bachelor Degree in Civil, Mechanical engineering or Geological Engineering.\n\nYears of Related Experience: Over 5 years’ experience in WASH infrastructure projects (design, planning, tender procedures, implementation, budgeting, reporting, monitoring, and evaluation) and good understanding of current WASH sector trends and indicators.\n\nQualifications:\n\nPreferred – in addition to minimum:\n\nAdditional training in project management, behavioral communication or community development.\n\nActive support of HFHI Values:\n\nHumility – We are part of something bigger than ourselves\n\nCourage – We do what’s right, even when it is difficult or unpopular\n\nAccountability – We take personal responsibility for Habitat’s mission\n\nSafeguarding: HFHZ requires that all employees take seriously their ethical responsibilities to safeguarding our intended beneficiaries, their communities, and all those with whom we work. Managers at all levels have responsibilities to support and develop systems that create and maintain an environment that prevents harassment, sexual exploitation and abuse, safeguards the rights of beneficiaries and community members (especially children), and promotes the implementation of Habitat for Humanity’s code of conduct.\n\nOrganizational Scope & Impact:\n\nVarious levels of the organization are potentially impacted, depending on the nature and focus of the model or process that is being implemented.\n\nProblem Complexity, Planning and Policy level impact:\n\nIndirect but strong impact on long-term planning, as new models and processes are piloted and shared, and new ways of implementation are recommended.\n\nInfluencing/People Leadership:\n\nInternal – National Organization Staff\n\nExternal – Other NGOs, Government (Local and National), Beneficiaries and other community members.\n\nNature of leadership provided to others – To inspire others into great teams.\n\nWorking Conditions, Requirements, etc. –\n\n40 hours of work per week, with one hour lunch break and 2 health breaks on 20 minutes each in a day.\n\nLocation:\n\nThis position is based at the National Office in Lusaka.\n\nTravel Expectations: Expected to make local and international travels as and when required.\n\nWill the individual in this role typically work with children or HFH beneficiaries ( Yes ).\n\nHow to apply\n\nPlease send your letter of motivation and CV ONLY to Habitat_hr@habitatzam.org.zm. Address your application to the National Director.\n\nKindly only apply if you meet the minimum requirements for the position. Clearly state the name of the position you are applying for in the subject line.\n\nClosing Date: The closing date for applications is Monday, 19 September, 2022\n\nOnly shortlisted candidates will be contacted.\n\nHABITAT FOR HUMANITY ZAMBIA IS AN EQUAL OPPORTUNITY EMPLOYER"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.hfhtkc.org/",
        "text": "hfhtkc.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=Habitat+for+Humanity&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAII-gk",
        "text": "See web results for Habitat for Humanity"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQKBp24DRrlFFWJP33GDkzIjFmnsEAM7xgyyxcO&s=0",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXNoIFNwZWNpYWxpc3QiLCJodGlkb2NpZCI6IjdnWjVndmx0b0tQTHVCcGJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVV4UGJuQlpWV042UTI5NVFsbFFWR1psVG5Sa1JrMTRlVXd0TWxCc1gyOWZjelZIUnpsU1dtZHVOVVo0WVY5UWJUSnJSVzlzWm1aR2RXczJaWEIwTUU1TmNYQkVibkp4TURCYVNVeHRVWEI0U25OeU56TkJYelpXVFdKWUxYWmZaa0UzYjBwdk1EZEViVW8zZUhwaWNXWjBOVGd3UlhSblZYWnNkbTkzU0RJNWEzZHJOM0ZNY1VGeWFWTm9TV3R2WmxONGRIZFVSVUUyTTJkU2FEWmFTM3BPWDJGQk5sWlRUVEZTZUc5aVF6SmZiMFIzVVhaM0VoZEhhazV5V21aVFVVRTNUMEkxVDAxUWRYTTJWbXRCTkJvaVFVcDNheTA0Wmt4cVEwWTVORVZLTW1KMmRGQlhkRmhsY0U1alRGTjBlRWRZUVEiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IGRpcmVjdGx5IG9uIEpvYnMgTXUgWmFtYmlhIiwibGluayI6Imh0dHBzOi8vam9ic211emFtYmlhLmNvbS9qb2Ivd2FzaC1zcGVjaWFsaXN0LTIvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Managing Director at North Western Water Supply and Sanitation...",
    "company_name": "North Western Water Supply and Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via Jobweb Zambia",
    "description": "JOB OPPORTUNITY\n\nThe North Western Water Supply and Sanitation Company Limited (NWWSSCL) is a commercial utility providing water and sanitation services in the North-Western Province. The company has a vision of “striving for excellence in water supply and sanitation.” It is value-driven and performance-oriented, and since its inception in 2000, it has been among the top-performing utilities. The company operates in eight (8) districts: Solwezi, Mwinilunga, Kasempa, Mufumbwe, Manyinga, Kabompo, Zambezi and Chavuma. The company envisioned taking over the provision of water and sanitation services in the newly created districts of Mushindamo, Kalumbila and Ikelenge. NWWSSCL is an equal opportunity employer and seeks to recruit a high-profile, self-motivated, innovative, honest, committed, adequately qualified, and appropriately experienced person to fill the following vacant position in a challenging environment.\n\n1. 0 MANAGING DIRECTOR – (X1)\n\nReporting Line:\n\nChairperson of the Board... of Directors\n\n2.0. Job Purpose:\n\nTo plan, coordinate and control the operations of the company and provide the strategic direction for managing the company, determining its direction in terms of development and growth within the mandate given by the business plan, the board, as well as general guidelines; and to evolve the necessary policies, philosophy, and plans in order to achieve the corporate objectives of the company.\n\n3.0 Main Duties and Responsibilities\n\nDevelops and implements a long-term strategy and vision for the company that generates satisfactory levels of shareholder value and positive, reciprocal relations with relevant shareholders.\nDevelops and recommends to the Board of NWWSSCL the corporate and business plan and, once approved, ensures its implementation\nEvaluates NWWSSCL budget plans, including strategies against objectives and policies submitted by subordinates from all departments and districts, providing guidance and advice, ensuring that submissions are realistic and attainable, and thereafter presenting the budget to the board for approval.\nReviews constantly the company’s performance against set objectives and plans as given in the corporate business plan, NWASCO performance guidelines, and mandatory standards and specifications for water supply and sanitation service providers.\nEnsures that necessary resources are marshalled to finance, equip, and run the planned operations, capital projects, and visions.\nChairs management meetings with senior managers and procurement meetings in order to ensure that the company’s procurements and other programs are value-adding and within agreed timeframes.\nAttends water sector consultative forums and represents the company at fairs and seminars, both local and international.\nPrepare and present to the Board and relevant bodies objective periodic reports of the company’s affairs, performance, and related issues for information and decision-making.\nAttends to important stakeholder queries emanating from councils, government, statutory bodies, and donors.\nAgrees monitors and reviews the performance of subordinates to ensure that they meet their agreed objectives and targets.\nPerforms any other duties as assigned by the board from time to time.\n\n4.0 MINIMUM ACADEMIC QUALIFICATIONS\n\nFull Grade Twelve (12) / Form Five (05) with Five “O” Level Credits, including Mathematics and English Language\nDegree in Engineering or any other relevant professional qualification.\nA master’s degree in Engineering or any other relevant field will be an added advantage.\nEligible member of the Engineering Institute of Zambia (EIZ) or other relevant professional body.\nMinimum of 10 years post-qualification practical hands-on work experience in a reputable institution, with 5 years at senior management level.\n\n5.0 Other Attributes\n\nGood strategic or business planning skills\nHighly developed leadership and management skills\nComputer Literacy\nHigh analytical skills and proven business acumen\nHonesty, of high integrity, accountability, and result-oriented\nGood interpersonal and influencing skills\nExcellent communication skills and forthrightness, as the job holder has to interact at the highest level with major stakeholders.\nDemonstrated ability to galvanize the entire company to achieve results.\n\nThe closing date for the receipt of applications is December 8, 2023, and only shortlisted candidates will be responded to",
    "job_highlights": [
      {
        "items": [
          "JOB OPPORTUNITY\n\nThe North Western Water Supply and Sanitation Company Limited (NWWSSCL) is a commercial utility providing water and sanitation services in the North-Western Province. The company has a vision of “striving for excellence in water supply and sanitation.” It is value-driven and performance-oriented, and since its inception in 2000, it has been among the top-performing utilities. The company operates in eight (8) districts: Solwezi, Mwinilunga, Kasempa, Mufumbwe, Manyinga, Kabompo, Zambezi and Chavuma. The company envisioned taking over the provision of water and sanitation services in the newly created districts of Mushindamo, Kalumbila and Ikelenge. NWWSSCL is an equal opportunity employer and seeks to recruit a high-profile, self-motivated, innovative, honest, committed, adequately qualified, and appropriately experienced person to fill the following vacant position in a challenging environment.\n\n1. 0 MANAGING DIRECTOR – (X1)\n\nReporting Line:\n\nChairperson of the Board... of Directors\n\n2.0. Job Purpose:\n\nTo plan, coordinate and control the operations of the company and provide the strategic direction for managing the company, determining its direction in terms of development and growth within the mandate given by the business plan, the board, as well as general guidelines; and to evolve the necessary policies, philosophy, and plans in order to achieve the corporate objectives of the company.\n\n3.0 Main Duties and Responsibilities\n\nDevelops and implements a long-term strategy and vision for the company that generates satisfactory levels of shareholder value and positive, reciprocal relations with relevant shareholders.\nDevelops and recommends to the Board of NWWSSCL the corporate and business plan and, once approved, ensures its implementation\nEvaluates NWWSSCL budget plans, including strategies against objectives and policies submitted by subordinates from all departments and districts, providing guidance and advice, ensuring that submissions are realistic and attainable, and thereafter presenting the budget to the board for approval.\nReviews constantly the company’s performance against set objectives and plans as given in the corporate business plan, NWASCO performance guidelines, and mandatory standards and specifications for water supply and sanitation service providers.\nEnsures that necessary resources are marshalled to finance, equip, and run the planned operations, capital projects, and visions.\nChairs management meetings with senior managers and procurement meetings in order to ensure that the company’s procurements and other programs are value-adding and within agreed timeframes.\nAttends water sector consultative forums and represents the company at fairs and seminars, both local and international.\nPrepare and present to the Board and relevant bodies objective periodic reports of the company’s affairs, performance, and related issues for information and decision-making.\nAttends to important stakeholder queries emanating from councils, government, statutory bodies, and donors.\nAgrees monitors and reviews the performance of subordinates to ensure that they meet their agreed objectives and targets.\nPerforms any other duties as assigned by the board from time to time.\n\n4.0 MINIMUM ACADEMIC QUALIFICATIONS\n\nFull Grade Twelve (12) / Form Five (05) with Five “O” Level Credits, including Mathematics and English Language\nDegree in Engineering or any other relevant professional qualification.\nA master’s degree in Engineering or any other relevant field will be an added advantage.\nEligible member of the Engineering Institute of Zambia (EIZ) or other relevant professional body.\nMinimum of 10 years post-qualification practical hands-on work experience in a reputable institution, with 5 years at senior management level.\n\n5.0 Other Attributes\n\nGood strategic or business planning skills\nHighly developed leadership and management skills\nComputer Literacy\nHigh analytical skills and proven business acumen\nHonesty, of high integrity, accountability, and result-oriented\nGood interpersonal and influencing skills\nExcellent communication skills and forthrightness, as the job holder has to interact at the highest level with major stakeholders.\nDemonstrated ability to galvanize the entire company to achieve results.\n\nThe closing date for the receipt of applications is December 8, 2023, and only shortlisted candidates will be responded to"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=North+Western+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIIqQo",
        "text": "See web results for North Western Water Supply and Sanitation Company Limited"
      }
    ],
    "extensions": [
      "5 days ago",
      "ZMK 1,113–ZMK 11,134 a month",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "5 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJNYW5hZ2luZyBEaXJlY3RvciBhdCBOb3J0aCBXZXN0ZXJuIFdhdGVyIFN1cHBseSBhbmQgU2FuaXRhdGlvbiBDb21wYW55IExpbWl0ZWQiLCJodGlkb2NpZCI6IjZqOVRwM1RkRzdjR21CNVhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9id2ViIFphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYndlYnphbWJpYS5jb20vam9icy9tYW5hZ2luZy1kaXJlY3Rvci1ub3J0aC13ZXN0ZXJuLXdhdGVyLXN1cHBseS1zYW5pdGF0aW9uLWNvbXBhbnktbGltaXRlZC8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Programme Manager – Hygiene",
    "company_name": "WaterAid",
    "location": "  Zambia   ",
    "via": "via JobZambia",
    "description": "It’s hard to believe that today 844 million people do not have clean water and 2.3 billion do not have a decent toilet – around one in three of the world’s population. Every two minutes a child under five dies from diarrheal diseases caused by poor water and sanitation.\n\nWe started because no NGO like us existed. We’ll end when no organisation like us is needed. In the meantime, we’re making great progress – since 1981, we have reached 25 million people with clean water and, since 2004, 24 million people with sanitation.\n\nWe’re looking for people who share a commitment to our vision. We’re looking for people with an appreciation and respect for different people and ideas, and the energy and expertise to help tackle the most important challenges.\n\nIn return, you can expect to get inspiration from the change you help make happen, a sense of belonging and the feeling of being part of a global community. You will also experience stimulation and fulfilment, the chance to grow, and space to... be yourself at your best. This is our pledge to you.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nWaterAid is looking for a Programme Manager Hygiene to play a vital role in our mission to make clean water, decent toilets and good hygiene normal for everyone in Zambia by 2030.\n\nThis is a middle management role responsible for overall development, coordination and management of Hygiene programmes. This position is responsible for setting, achieving and maintaining quality standards in the delivery of hygiene and behaviour change programmes. This role will ensure that the programmes remain coherent, integrates policy and practice and develops its practice and initiatives on integration with health, education and nutrition sectors. This position will also ensure that programme interventions and partnerships remain relevant and influence policy, practice and systems across sectors at district and town levels.\n\nThis position is responsible for ensuring the quality and effectiveness of the social, behavioural, and technological options and interventions of WaterAid Zambia’s programmes. The post holder will also be expected to pilot new and innovative initiatives where they have the potential to enable the delivery of plans and goals.\n\nThe Programme Manager Hygiene role will focus on the following specifically:\n• Programme Planning, Development and Management\n• Fundraising and Grants Management\n• Partnership development, support and management\n• Collaboration and Networking\n• Support learning and development of staff and partners\n• Leadership & People Management\n\nTo be successful, you’ll need:\n• Full commitment to WaterAid’s vision, mission and values and a way of working that demonstrates this, with the ability to communicate this enthusiasm to others.\n• A Masters’ Degree in Development Planning or Development Studies from a recognized University, or professional qualifications in civil engineering, water and sanitation, or environmental health.\n• A minimum of five years’ experience in programme planning, development and management at managerial level in Water, Sanitation and Hygiene (WASH)\n• Experience in participatory monitoring and evaluation approaches and proven experience in water and sanitation work in the Zambian context.\n• Experience in developing and managing projects, including staff, budgeting and budget management.\n• Experience in implementation of integrated programmes and experience in leading development of models and approaches and packaging learning\n• A clear understanding of Hygiene programming and policy contexts\n• Experience of development and management of teams and partner organisations\n• In-depth knowledge of participatory approaches, facilitation and training techniques.\n• Ability to think strategically & translate development and fiscal plans\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nThe role will require some travel in-country and could involve some travel in the region or internationally\n\nIf you are interested in the position, send your application, consisting of a cover letter and a CV, via email to ZambiaCareers@wateraid.org using ”Programme Manager Hygiene” as the subject. Please provide details of at least three relevant references and clearly indicate details of your current remuneration package. Deadline: 16th November.\n\nVisit our global WaterAid website to see the full job description of the role:  https://www.wateraid.org/jobs-and-volunteering\n\nPlease note: in order to apply for this role, you must be able to demonstrate your eligibility to work in Zambia",
    "job_highlights": [
      {
        "items": [
          "It’s hard to believe that today 844 million people do not have clean water and 2.3 billion do not have a decent toilet – around one in three of the world’s population. Every two minutes a child under five dies from diarrheal diseases caused by poor water and sanitation.\n\nWe started because no NGO like us existed. We’ll end when no organisation like us is needed. In the meantime, we’re making great progress – since 1981, we have reached 25 million people with clean water and, since 2004, 24 million people with sanitation.\n\nWe’re looking for people who share a commitment to our vision. We’re looking for people with an appreciation and respect for different people and ideas, and the energy and expertise to help tackle the most important challenges.\n\nIn return, you can expect to get inspiration from the change you help make happen, a sense of belonging and the feeling of being part of a global community. You will also experience stimulation and fulfilment, the chance to grow, and space to... be yourself at your best. This is our pledge to you.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nWaterAid is looking for a Programme Manager Hygiene to play a vital role in our mission to make clean water, decent toilets and good hygiene normal for everyone in Zambia by 2030.\n\nThis is a middle management role responsible for overall development, coordination and management of Hygiene programmes. This position is responsible for setting, achieving and maintaining quality standards in the delivery of hygiene and behaviour change programmes. This role will ensure that the programmes remain coherent, integrates policy and practice and develops its practice and initiatives on integration with health, education and nutrition sectors. This position will also ensure that programme interventions and partnerships remain relevant and influence policy, practice and systems across sectors at district and town levels.\n\nThis position is responsible for ensuring the quality and effectiveness of the social, behavioural, and technological options and interventions of WaterAid Zambia’s programmes. The post holder will also be expected to pilot new and innovative initiatives where they have the potential to enable the delivery of plans and goals.\n\nThe Programme Manager Hygiene role will focus on the following specifically:\n• Programme Planning, Development and Management\n• Fundraising and Grants Management\n• Partnership development, support and management\n• Collaboration and Networking\n• Support learning and development of staff and partners\n• Leadership & People Management\n\nTo be successful, you’ll need:\n• Full commitment to WaterAid’s vision, mission and values and a way of working that demonstrates this, with the ability to communicate this enthusiasm to others.\n• A Masters’ Degree in Development Planning or Development Studies from a recognized University, or professional qualifications in civil engineering, water and sanitation, or environmental health.\n• A minimum of five years’ experience in programme planning, development and management at managerial level in Water, Sanitation and Hygiene (WASH)\n• Experience in participatory monitoring and evaluation approaches and proven experience in water and sanitation work in the Zambian context.\n• Experience in developing and managing projects, including staff, budgeting and budget management.\n• Experience in implementation of integrated programmes and experience in leading development of models and approaches and packaging learning\n• A clear understanding of Hygiene programming and policy contexts\n• Experience of development and management of teams and partner organisations\n• In-depth knowledge of participatory approaches, facilitation and training techniques.\n• Ability to think strategically & translate development and fiscal plans\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nThe role will require some travel in-country and could involve some travel in the region or internationally\n\nIf you are interested in the position, send your application, consisting of a cover letter and a CV, via email to ZambiaCareers@wateraid.org using ”Programme Manager Hygiene” as the subject. Please provide details of at least three relevant references and clearly indicate details of your current remuneration package. Deadline: 16th November.\n\nVisit our global WaterAid website to see the full job description of the role:  https://www.wateraid.org/jobs-and-volunteering\n\nPlease note: in order to apply for this role, you must be able to demonstrate your eligibility to work in Zambia"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.wateraid.org/",
        "text": "wateraid.org"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=WaterAid&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAII2go",
        "text": "See web results for WaterAid"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSb-0-uieM1GbvT9ZoKjXFXQLzcvjJleasJ5XwJwPE&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQcm9ncmFtbWUgTWFuYWdlciDigJMgSHlnaWVuZSIsImh0aWRvY2lkIjoicEpBTzJQYU9idnBEOHVVQ0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVXhQYm5CWlZXMTZOVEZGWlZkeE1HZDRRMnRFVVhGNWJIaERWemRLU205MFpHWkdhRWxTVUdnNFQwTlNTMlI1TFc5cFh6TlFXVE52Y0dzMFFtczRUMnRuUm1oTlExaGxiMjkwUVRWQmNGcHJhM0ZPYjBKSU1HMUNYMGQxZGpRMVFrMXhTRmhyYjFWU05EQkhMVGxDYVZScFduZzBXalJ3ZWxseWVtbFRUV2xvVFcxeVdFTkJYMVZGZURCM2JsSXdiREJQU0hFdFRuVjRRek16YUZkdmJYSkJFaGRIYWs1eVdtWlRVVUUzVDBJMVQwMVFkWE0yVm10Qk5Cb2lRVXAzYXkwNFpqSTJVVmw2WmpNdFR6VTNSemRmTkZObFlYRnhaR3BzV1VKQ1p3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBKb2JaYW1iaWEiLCJsaW5rIjoiaHR0cHM6Ly9qb2J6YW1iaWEuY29tL2pvYi9wcm9ncmFtbWUtbWFuYWdlci1oeWdpZW5lLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  },
  {
    "title": "Safety Health & Environment Officer",
    "company_name": "Mulonga Water Supply & Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\n\nJob Purpose:\nReporting to the Social Development Specialist the job holder will safeguard the health and safety of employees, public, properties as well as managing and protecting the environment to ensure compliance to all statutory regulations and requirements\n\nSummary of Main Accountabilities\n• Coordinates health safety and environmental issues in the organisation\n• Implements and monitor the company’s safety health and environmental management systems\n• Ensures company compliance to statutory regulations in terms of safety health and environment\n• Implements preventive actions and emergency plan and report safety health and environmental performance to ensure continuous improvement.\n• Participates in undertaking risk assessment, inspections/audits and notify relevant managers of findings or shortfalls and advise on require remedial action.\n• Ensures personal protective equipment are provided and used correctly with due regard to the prevailing workplace... hazards\n\nKnowledge and Skill Requirements:\n• Grade 12 Certificate with Five (5) O Levels\n• Diploma in Occupational Safety/ Environmental Studies\n• 3 – 5 years’ experience in a similar role in a comparable organisation\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Considerable specialised diplomacy is a prime requirement;\n• Analysis of relatively complex problems\n• Make decisions within broad parameters\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\n\nJob Purpose:\nReporting to the Social Development Specialist the job holder will safeguard the health and safety of employees, public, properties as well as managing and protecting the environment to ensure compliance to all statutory regulations and requirements\n\nSummary of Main Accountabilities\n• Coordinates health safety and environmental issues in the organisation\n• Implements and monitor the company’s safety health and environmental management systems\n• Ensures company compliance to statutory regulations in terms of safety health and environment\n• Implements preventive actions and emergency plan and report safety health and environmental performance to ensure continuous improvement.\n• Participates in undertaking risk assessment, inspections/audits and notify relevant managers of findings or shortfalls and advise on require remedial action.\n• Ensures personal protective equipment are provided and used correctly with due regard to the prevailing workplace... hazards\n\nKnowledge and Skill Requirements:\n• Grade 12 Certificate with Five (5) O Levels\n• Diploma in Occupational Safety/ Environmental Studies\n• 3 – 5 years’ experience in a similar role in a comparable organisation\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Considerable specialised diplomacy is a prime requirement;\n• Analysis of relatively complex problems\n• Make decisions within broad parameters\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=Mulonga+Water+Supply+%26+Sanitation+Company+Limited&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIIiAs",
        "text": "See web results for Mulonga Water Supply & Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKdRlweZdtuU1M-vhLRcNLx6YTazypQ4g2omJwONES_8OVjbn-0Mxzbag&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTYWZldHkgSGVhbHRoIFx1MDAyNiBFbnZpcm9ubWVudCBPZmZpY2VyIiwiaHRpZG9jaWQiOiI2U05OYzE3dEpMR20zejJFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdyZWF0IFphbWJpYSBKb2JzIiwibGluayI6Imh0dHBzOi8vd3d3LmdyZWF0emFtYmlham9icy5jb20vam9icy9qb2ItZGV0YWlsL2pvYi1TYWZldHktSGVhbHRoLUVudmlyb25tZW50LU9mZmljZXItam9iLWF0LU11bG9uZ2EtV2F0ZXItU3VwcGx5LVNhbml0YXRpb24tQ29tcGFueS1MaW1pdGVkLTQ0NTI4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Policy and Regulatory Lead-Expanding Water and Sanitation",
    "company_name": "RTI",
    "location": "  Lusaka   ",
    "via": "via Jobs Mu Zambia",
    "description": "Position Description:\n\nRTI is seeking a Policy and Regulatory Lead for the Expanding Water and Sanitation Project. The Policy and Regulatory Lead will lead the implementation of the project’s policy review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The Policy and Regulatory Lead will directly report to the Chief of Party.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nProvide overall vision and leadership on policy, legal, institutional, and regulatory components of the project.\n\nResponsible for leading implementation of the project’s policy analysis and review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia.\n\nServe as main point-of-contact for Government of Zambia... partners, such as MWDSEP, working with other Objective Leads and the Chief of Party to engage private sector partners, commercial water utilities, NWASCO (the water sector regulator), and municipal governments on strategies to improve private sector involvement and participation in WASH through policy reform, an enabling environment for private investment, and public-private partnerships.\n\nWork with MWDSEP, NWASCO, and the CUs to build out the regulatory instruments for rural WASH and review the legislative framework for rural water sanitation, identify gaps, and create a roadmap to guide legislative changes.\n\nEnsure synergy between policy component activities and alignment with other project components, including activities in governance, private sector engagement, and civil society engagement.\n\nGuide policy team on preparation and delivery of high-quality technical reports; support annual workplan development, goal setting and establishment of indicator targets, and contractual reporting to USAID, including quarterly, annual, and other performance reports as requested.\n\nFoster and maintain effective, professional relations with government counterparts, local organizations, international donors and other stakeholders for successful implementation of project policy activities.\n\nWork closely with the Service Delivery Lead and the PSP Lead in designing the institutional arrangements for growth centers. Collaborate and share knowledge with other conservation organizations and initiatives.\n\nDiplomatically supervise component staff and coordinate programs with partners from a broad range of backgrounds and experiences.\n\nIn coordination with the Chief of Party, liaise with USAID and RTI home office on technical and financial implementation of and reporting on policy programming.\n\nManage any subcontracts and grants with local partners that include activities under the project’s policy component, ensuring the quality and timeliness of deliverables.\n\nOversee performance monitoring and evaluation to ensure all policy project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nMaster’s degree in public administration, government, public policy, government relations, law, or related field and 10 years of experience or Bachelor’s degree in related technical field with 12 years of experience.\n\nExperience and expertise in the implementation of large and complex projects relating to public policy, policy reform and design, public administration, water utilities management, water resources management, and/or WASH service delivery.\n\nFive years’ substantive experience working with counterparts at various levels of government, private sector leaders, and other stakeholders in policy reform and design, WASH service delivery, and/or enforcement of water sector regulations.\n\nExperience with working with governments on an international, national, provincial, or district level on policy issues in the water sector or other equivalent sectors.\n\nDemonstrated understanding of the policy, institutional, and regulatory framework of the Zambian WASH sector.\n\nDemonstrated skills in building, mobilizing, and leading multidisciplinary teams.\n\nDemonstrated skills and proven ability to develop, articulate and implement a strategic vision for policy reform and design as a vital component of project implementation.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in any of the three provinces and difficult terrain/conditions at times.\n\nProficiency in English is required.\n\nWork experience in Zambia required",
    "job_highlights": [
      {
        "items": [
          "Position Description:\n\nRTI is seeking a Policy and Regulatory Lead for the Expanding Water and Sanitation Project. The Policy and Regulatory Lead will lead the implementation of the project’s policy review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The Policy and Regulatory Lead will directly report to the Chief of Party.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nProvide overall vision and leadership on policy, legal, institutional, and regulatory components of the project.\n\nResponsible for leading implementation of the project’s policy analysis and review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia.\n\nServe as main point-of-contact for Government of Zambia... partners, such as MWDSEP, working with other Objective Leads and the Chief of Party to engage private sector partners, commercial water utilities, NWASCO (the water sector regulator), and municipal governments on strategies to improve private sector involvement and participation in WASH through policy reform, an enabling environment for private investment, and public-private partnerships.\n\nWork with MWDSEP, NWASCO, and the CUs to build out the regulatory instruments for rural WASH and review the legislative framework for rural water sanitation, identify gaps, and create a roadmap to guide legislative changes.\n\nEnsure synergy between policy component activities and alignment with other project components, including activities in governance, private sector engagement, and civil society engagement.\n\nGuide policy team on preparation and delivery of high-quality technical reports; support annual workplan development, goal setting and establishment of indicator targets, and contractual reporting to USAID, including quarterly, annual, and other performance reports as requested.\n\nFoster and maintain effective, professional relations with government counterparts, local organizations, international donors and other stakeholders for successful implementation of project policy activities.\n\nWork closely with the Service Delivery Lead and the PSP Lead in designing the institutional arrangements for growth centers. Collaborate and share knowledge with other conservation organizations and initiatives.\n\nDiplomatically supervise component staff and coordinate programs with partners from a broad range of backgrounds and experiences.\n\nIn coordination with the Chief of Party, liaise with USAID and RTI home office on technical and financial implementation of and reporting on policy programming.\n\nManage any subcontracts and grants with local partners that include activities under the project’s policy component, ensuring the quality and timeliness of deliverables.\n\nOversee performance monitoring and evaluation to ensure all policy project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nMaster’s degree in public administration, government, public policy, government relations, law, or related field and 10 years of experience or Bachelor’s degree in related technical field with 12 years of experience.\n\nExperience and expertise in the implementation of large and complex projects relating to public policy, policy reform and design, public administration, water utilities management, water resources management, and/or WASH service delivery.\n\nFive years’ substantive experience working with counterparts at various levels of government, private sector leaders, and other stakeholders in policy reform and design, WASH service delivery, and/or enforcement of water sector regulations.\n\nExperience with working with governments on an international, national, provincial, or district level on policy issues in the water sector or other equivalent sectors.\n\nDemonstrated understanding of the policy, institutional, and regulatory framework of the Zambian WASH sector.\n\nDemonstrated skills in building, mobilizing, and leading multidisciplinary teams.\n\nDemonstrated skills and proven ability to develop, articulate and implement a strategic vision for policy reform and design as a vital component of project implementation.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in any of the three provinces and difficult terrain/conditions at times.\n\nProficiency in English is required.\n\nWork experience in Zambia required"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&hl=en&q=RTI&sa=X&ved=0ahUKEwj0hYHk7_CCAxWzAHkGHTpnBeI4ChCYkAIItgs",
        "text": "See web results for RTI"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQb2xpY3kgYW5kIFJlZ3VsYXRvcnkgTGVhZC1FeHBhbmRpbmcgV2F0ZXIgYW5kIFNhbml0YXRpb24iLCJodGlkb2NpZCI6ImpBVVNMeDJENlZVWXQzNVpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gSm9icyBNdSBaYW1iaWEiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzbXV6YW1iaWEuY29tL2pvYi9wb2xpY3ktYW5kLXJlZ3VsYXRvcnktbGVhZC1leHBhbmRpbmctd2F0ZXItYW5kLXNhbml0YXRpb24vP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Policy and Regulatory Lead-Expanding Water and Sanitation",
    "company_name": "RTI",
    "location": "  Lusaka   ",
    "via": "via Jobs Mu Zambia",
    "description": "Position Description:\n\nRTI is seeking a Policy and Regulatory Lead for the Expanding Water and Sanitation Project. The Policy and Regulatory Lead will lead the implementation of the project’s policy review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The Policy and Regulatory Lead will directly report to the Chief of Party.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nProvide overall vision and leadership on policy, legal, institutional, and regulatory components of the project.\n\nResponsible for leading implementation of the project’s policy analysis and review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia.\n\nServe as main point-of-contact for Government of Zambia... partners, such as MWDSEP, working with other Objective Leads and the Chief of Party to engage private sector partners, commercial water utilities, NWASCO (the water sector regulator), and municipal governments on strategies to improve private sector involvement and participation in WASH through policy reform, an enabling environment for private investment, and public-private partnerships.\n\nWork with MWDSEP, NWASCO, and the CUs to build out the regulatory instruments for rural WASH and review the legislative framework for rural water sanitation, identify gaps, and create a roadmap to guide legislative changes.\n\nEnsure synergy between policy component activities and alignment with other project components, including activities in governance, private sector engagement, and civil society engagement.\n\nGuide policy team on preparation and delivery of high-quality technical reports; support annual workplan development, goal setting and establishment of indicator targets, and contractual reporting to USAID, including quarterly, annual, and other performance reports as requested.\n\nFoster and maintain effective, professional relations with government counterparts, local organizations, international donors and other stakeholders for successful implementation of project policy activities.\n\nWork closely with the Service Delivery Lead and the PSP Lead in designing the institutional arrangements for growth centers. Collaborate and share knowledge with other conservation organizations and initiatives.\n\nDiplomatically supervise component staff and coordinate programs with partners from a broad range of backgrounds and experiences.\n\nIn coordination with the Chief of Party, liaise with USAID and RTI home office on technical and financial implementation of and reporting on policy programming.\n\nManage any subcontracts and grants with local partners that include activities under the project’s policy component, ensuring the quality and timeliness of deliverables.\n\nOversee performance monitoring and evaluation to ensure all policy project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nMaster’s degree in public administration, government, public policy, government relations, law, or related field and 10 years of experience or Bachelor’s degree in related technical field with 12 years of experience.\n\nExperience and expertise in the implementation of large and complex projects relating to public policy, policy reform and design, public administration, water utilities management, water resources management, and/or WASH service delivery.\n\nFive years’ substantive experience working with counterparts at various levels of government, private sector leaders, and other stakeholders in policy reform and design, WASH service delivery, and/or enforcement of water sector regulations.\n\nExperience with working with governments on an international, national, provincial, or district level on policy issues in the water sector or other equivalent sectors.\n\nDemonstrated understanding of the policy, institutional, and regulatory framework of the Zambian WASH sector.\n\nDemonstrated skills in building, mobilizing, and leading multidisciplinary teams.\n\nDemonstrated skills and proven ability to develop, articulate and implement a strategic vision for policy reform and design as a vital component of project implementation.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in any of the three provinces and difficult terrain/conditions at times.\n\nProficiency in English is required.\n\nWork experience in Zambia required",
    "job_highlights": [
      {
        "items": [
          "Position Description:\n\nRTI is seeking a Policy and Regulatory Lead for the Expanding Water and Sanitation Project. The Policy and Regulatory Lead will lead the implementation of the project’s policy review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia. This position will be based in Lusaka with the need to travel to provincial areas throughout the program implementation period. The Policy and Regulatory Lead will directly report to the Chief of Party.\n\nLocal nationals are strongly encouraged to apply.\n\nRoles and Responsibilities:\n\nProvide overall vision and leadership on policy, legal, institutional, and regulatory components of the project.\n\nResponsible for leading implementation of the project’s policy analysis and review, reform, and design activities in support of a strengthened and more effective policy framework for WASH services in Zambia.\n\nServe as main point-of-contact for Government of Zambia... partners, such as MWDSEP, working with other Objective Leads and the Chief of Party to engage private sector partners, commercial water utilities, NWASCO (the water sector regulator), and municipal governments on strategies to improve private sector involvement and participation in WASH through policy reform, an enabling environment for private investment, and public-private partnerships.\n\nWork with MWDSEP, NWASCO, and the CUs to build out the regulatory instruments for rural WASH and review the legislative framework for rural water sanitation, identify gaps, and create a roadmap to guide legislative changes.\n\nEnsure synergy between policy component activities and alignment with other project components, including activities in governance, private sector engagement, and civil society engagement.\n\nGuide policy team on preparation and delivery of high-quality technical reports; support annual workplan development, goal setting and establishment of indicator targets, and contractual reporting to USAID, including quarterly, annual, and other performance reports as requested.\n\nFoster and maintain effective, professional relations with government counterparts, local organizations, international donors and other stakeholders for successful implementation of project policy activities.\n\nWork closely with the Service Delivery Lead and the PSP Lead in designing the institutional arrangements for growth centers. Collaborate and share knowledge with other conservation organizations and initiatives.\n\nDiplomatically supervise component staff and coordinate programs with partners from a broad range of backgrounds and experiences.\n\nIn coordination with the Chief of Party, liaise with USAID and RTI home office on technical and financial implementation of and reporting on policy programming.\n\nManage any subcontracts and grants with local partners that include activities under the project’s policy component, ensuring the quality and timeliness of deliverables.\n\nOversee performance monitoring and evaluation to ensure all policy project targets are met or exceeded – making recommendations for improvement in program implementation.\n\nQualifications:\n\nMaster’s degree in public administration, government, public policy, government relations, law, or related field and 10 years of experience or Bachelor’s degree in related technical field with 12 years of experience.\n\nExperience and expertise in the implementation of large and complex projects relating to public policy, policy reform and design, public administration, water utilities management, water resources management, and/or WASH service delivery.\n\nFive years’ substantive experience working with counterparts at various levels of government, private sector leaders, and other stakeholders in policy reform and design, WASH service delivery, and/or enforcement of water sector regulations.\n\nExperience with working with governments on an international, national, provincial, or district level on policy issues in the water sector or other equivalent sectors.\n\nDemonstrated understanding of the policy, institutional, and regulatory framework of the Zambian WASH sector.\n\nDemonstrated skills in building, mobilizing, and leading multidisciplinary teams.\n\nDemonstrated skills and proven ability to develop, articulate and implement a strategic vision for policy reform and design as a vital component of project implementation.\n\nProven ability to work under pressure, and with multiple concurrent demands.\n\nProven ability to manage projects with satellite or remote offices and team members.\n\nExcellent communication and interpersonal skills.\n\nAbility to travel and work in any of the three provinces and difficult terrain/conditions at times.\n\nProficiency in English is required.\n\nWork experience in Zambia required"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=RTI&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIIlAg",
        "text": "See web results for RTI"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQb2xpY3kgYW5kIFJlZ3VsYXRvcnkgTGVhZC1FeHBhbmRpbmcgV2F0ZXIgYW5kIFNhbml0YXRpb24iLCJodGlkb2NpZCI6ImpBVVNMeDJENlZVWXQzNVpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiLm5GZzJlYntmb250LXdlaWdodDo1MDB9LkJpNkRkY3tmb250LXdlaWdodDo1MDB9QXBwbHkgZGlyZWN0bHkgb24gSm9icyBNdSBaYW1iaWEiLCJsaW5rIjoiaHR0cHM6Ly9qb2JzbXV6YW1iaWEuY29tL2pvYi9wb2xpY3ktYW5kLXJlZ3VsYXRvcnktbGVhZC1leHBhbmRpbmctd2F0ZXItYW5kLXNhbml0YXRpb24vP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Office Assistant",
    "company_name": "Lusaka Water and Sewerage Company Limited",
    "location": "  Lusaka   ",
    "via": "via JobZambia",
    "description": "EMPLOYMENT OPPORTUNITY\n\nThe Mission of Lusaka Water Supply and Sanitation Company Limited is to provide quality water and sanitation services to customers in Lusaka Province using commercially and environmentally sustainable strategies. In order to achieve this, the Company must have a human capital of dynamic and energetic staff who are performance driven and who possess the requisite competencies. In this regard, the Company is inviting applications from suitably qualified and experienced Zambians for the under-listed four vacant positions.\n\nOFFICE ASSISTANT\n\nREPORTS TO: Head – Human Resources Operations\n\nLOCATION: Lusaka\n\nJob purpose\n\nEnsures that internal and external documents and mails are ferried and delivered to their recipients and destinations in a timely, efficient and effective manner, and photocopies, stores or disposes of various Company documents as directed.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nQUALIFICATIONS AND EXPERIENCE\n• Must have a minimum of Grade Twelve Certificate... or equivalent\n• Should possess at least two (2) years work experience\n• Certificate in Records Management will be an added advantage\n• Computer literate\n• Should have good etiquette and public presentation skills.\n• Physical agility is required.\n\nOTHER ATTRIBUTES FOR POSITIONS II TO V\n• Must have good Communication Skills\n• Must be customer service oriented\n• Must be achievement oriented\n• Must have initiative and integrity\n• Must have organization commitment\n• Must have the ability to work under pressure\n• Must demonstrate reliability and confidentiality\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nApplications together with copies of certificates, detailed curriculum vitae and three (3) names of referees should reach the undersigned no later than 17thApril 2020.\n\nDirector Human Resources and Administration\n\nLusaka Water and Sewerage Company Limited\n\nPlot 871, Katemo Road, Rhodes Park\n\nP O BOX 50198\n\nLUSAKA",
    "job_highlights": [
      {
        "items": [
          "EMPLOYMENT OPPORTUNITY\n\nThe Mission of Lusaka Water Supply and Sanitation Company Limited is to provide quality water and sanitation services to customers in Lusaka Province using commercially and environmentally sustainable strategies. In order to achieve this, the Company must have a human capital of dynamic and energetic staff who are performance driven and who possess the requisite competencies. In this regard, the Company is inviting applications from suitably qualified and experienced Zambians for the under-listed four vacant positions.\n\nOFFICE ASSISTANT\n\nREPORTS TO: Head – Human Resources Operations\n\nLOCATION: Lusaka\n\nJob purpose\n\nEnsures that internal and external documents and mails are ferried and delivered to their recipients and destinations in a timely, efficient and effective manner, and photocopies, stores or disposes of various Company documents as directed.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nQUALIFICATIONS AND EXPERIENCE\n• Must have a minimum of Grade Twelve Certificate... or equivalent\n• Should possess at least two (2) years work experience\n• Certificate in Records Management will be an added advantage\n• Computer literate\n• Should have good etiquette and public presentation skills.\n• Physical agility is required.\n\nOTHER ATTRIBUTES FOR POSITIONS II TO V\n• Must have good Communication Skills\n• Must be customer service oriented\n• Must be achievement oriented\n• Must have initiative and integrity\n• Must have organization commitment\n• Must have the ability to work under pressure\n• Must demonstrate reliability and confidentiality\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nApplications together with copies of certificates, detailed curriculum vitae and three (3) names of referees should reach the undersigned no later than 17thApril 2020.\n\nDirector Human Resources and Administration\n\nLusaka Water and Sewerage Company Limited\n\nPlot 871, Katemo Road, Rhodes Park\n\nP O BOX 50198\n\nLUSAKA"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Lusaka+Water+and+Sewerage+Company+Limited&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIIwQg",
        "text": "See web results for Lusaka Water and Sewerage Company Limited"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJPZmZpY2UgQXNzaXN0YW50IiwiaHRpZG9jaWQiOiIwLXlqSHhxSWRWcS1NNTFZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEpvYlphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYnphbWJpYS5jb20vam9iL29mZmljZS1hc3Npc3RhbnQtNi8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Safety Health & Environment Officer",
    "company_name": "Mulonga Water Supply & Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\n\nJob Purpose:\nReporting to the Social Development Specialist the job holder will safeguard the health and safety of employees, public, properties as well as managing and protecting the environment to ensure compliance to all statutory regulations and requirements\n\nSummary of Main Accountabilities\n• Coordinates health safety and environmental issues in the organisation\n• Implements and monitor the company’s safety health and environmental management systems\n• Ensures company compliance to statutory regulations in terms of safety health and environment\n• Implements preventive actions and emergency plan and report safety health and environmental performance to ensure continuous improvement.\n• Participates in undertaking risk assessment, inspections/audits and notify relevant managers of findings or shortfalls and advise on require remedial action.\n• Ensures personal protective equipment are provided and used correctly with due regard to the prevailing workplace... hazards\n\nKnowledge and Skill Requirements:\n• Grade 12 Certificate with Five (5) O Levels\n• Diploma in Occupational Safety/ Environmental Studies\n• 3 – 5 years’ experience in a similar role in a comparable organisation\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Considerable specialised diplomacy is a prime requirement;\n• Analysis of relatively complex problems\n• Make decisions within broad parameters\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\n\nJob Purpose:\nReporting to the Social Development Specialist the job holder will safeguard the health and safety of employees, public, properties as well as managing and protecting the environment to ensure compliance to all statutory regulations and requirements\n\nSummary of Main Accountabilities\n• Coordinates health safety and environmental issues in the organisation\n• Implements and monitor the company’s safety health and environmental management systems\n• Ensures company compliance to statutory regulations in terms of safety health and environment\n• Implements preventive actions and emergency plan and report safety health and environmental performance to ensure continuous improvement.\n• Participates in undertaking risk assessment, inspections/audits and notify relevant managers of findings or shortfalls and advise on require remedial action.\n• Ensures personal protective equipment are provided and used correctly with due regard to the prevailing workplace... hazards\n\nKnowledge and Skill Requirements:\n• Grade 12 Certificate with Five (5) O Levels\n• Diploma in Occupational Safety/ Environmental Studies\n• 3 – 5 years’ experience in a similar role in a comparable organisation\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Considerable specialised diplomacy is a prime requirement;\n• Analysis of relatively complex problems\n• Make decisions within broad parameters\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Mulonga+Water+Supply+%26+Sanitation+Company+Limited&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAII7wg",
        "text": "See web results for Mulonga Water Supply & Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKdRlweZdtuU1M-vhLRcNLx6YTazypQ4g2omJwONES_8OVjbn-0Mxzbag&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTYWZldHkgSGVhbHRoIFx1MDAyNiBFbnZpcm9ubWVudCBPZmZpY2VyIiwiaHRpZG9jaWQiOiI2U05OYzE3dEpMR20zejJFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdyZWF0IFphbWJpYSBKb2JzIiwibGluayI6Imh0dHBzOi8vd3d3LmdyZWF0emFtYmlham9icy5jb20vam9icy9qb2ItZGV0YWlsL2pvYi1TYWZldHktSGVhbHRoLUVudmlyb25tZW50LU9mZmljZXItam9iLWF0LU11bG9uZ2EtV2F0ZXItU3VwcGx5LVNhbml0YXRpb24tQ29tcGFueS1MaW1pdGVkLTQ0NTI4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Swim Coach",
    "company_name": "Water tribe swimming academy",
    "location": "  Lusaka   ",
    "via": "via LinkedIn Zambia",
    "description": "Company Description\n\nWe suggest you enter details here for Water Tribe Swimming Academy, located in Lusaka; a welcoming and inclusive swim community that fosters a love of swimming from beginner to elite levels.\n\nRole Description\n\nThis is a part-time on-site role located at our Lusaka location for a skilled and supportive Swimming Coach. The Swimming Coach will be responsible for leading and managing swimming practices, providing appropriate skills training and stroke correction, preparing swimmers for competitions, and tracking progress of swimmers. The Swimming Coach will implement the appropriate training methodologies, ensure swimmer safety, lead instruction for various age groups and levels, and act as a mentor to swimmers.\n\nQualifications\n• Strong understanding of swimming techniques, teaching methodologies, and stroke correction principles\n• Prior coaching experience preferred, but not required\n• Strong communication and interpersonal skills to mentor and motivate swimmers of... all ages and skill levels\n• Ability to create and implement practice plans and training for individual/group sessions\n• Experience with swim meets and meet preparation\n• Current CPR, First Aid, and lifeguard certifications a plus, but not required\n• A passion for providing a safe, inclusive and fun swim environment",
    "job_highlights": [
      {
        "items": [
          "Company Description\n\nWe suggest you enter details here for Water Tribe Swimming Academy, located in Lusaka; a welcoming and inclusive swim community that fosters a love of swimming from beginner to elite levels.\n\nRole Description\n\nThis is a part-time on-site role located at our Lusaka location for a skilled and supportive Swimming Coach. The Swimming Coach will be responsible for leading and managing swimming practices, providing appropriate skills training and stroke correction, preparing swimmers for competitions, and tracking progress of swimmers. The Swimming Coach will implement the appropriate training methodologies, ensure swimmer safety, lead instruction for various age groups and levels, and act as a mentor to swimmers.\n\nQualifications\n• Strong understanding of swimming techniques, teaching methodologies, and stroke correction principles\n• Prior coaching experience preferred, but not required\n• Strong communication and interpersonal skills to mentor and motivate swimmers of... all ages and skill levels\n• Ability to create and implement practice plans and training for individual/group sessions\n• Experience with swim meets and meet preparation\n• Current CPR, First Aid, and lifeguard certifications a plus, but not required\n• A passion for providing a safe, inclusive and fun swim environment"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Water+tribe+swimming+academy&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIInQk",
        "text": "See web results for Water tribe swimming academy"
      }
    ],
    "extensions": [
      "18 days ago",
      "Part-time"
    ],
    "detected_extensions": {
      "posted_at": "18 days ago",
      "schedule_type": "Part-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTd2ltIENvYWNoIiwiaHRpZG9jaWQiOiJFSktBM1JzYzJPUVJ3UlRFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIFphbWJpYSIsImxpbmsiOiJodHRwczovL3ptLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvc3dpbS1jb2FjaC1hdC13YXRlci10cmliZS1zd2ltbWluZy1hY2FkZW15LTM3NjM1ODE5OTA/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Water Attendant",
    "company_name": "Zambia Sugar",
    "location": "  Mazabuka   ",
    "via": "via GoZambiaJobs",
    "description": "The position reports to the Estate Maintenance Supervisor – Water Services. The successful candidate will be responsible for ensuring that consumers are supplied with quality domestic water which conforms to both NWASCO and WHO portable water standards to prevent outbreaks of water borne diseases.\n\nKEY PERFORMANCE AREAS\n\nEnsuring that the chemicals for water purification are dosed to the incoming raw water before it goes into the settling tank.\n\nDraining and cleaning the settlers to remove settled flocs in the settling tank to ensure that there are no carryovers into the filters due to high flock bed on a daily basis.\n\nCleaning the water collection troughs on a daily basis.\n\nEnsuring that filters are backwashed cleaned and disinfected using chlorine daily.\n\nEnsuring that correct quantity of disinfectant is dosed to kill germs in the filtered water.\n\nEnsuring that there are enough tablets in the brominator by physically checking daily.\n\nTesting residual chlorine levels hourly and... recording the results in the logbook.\n\nTaking corrective action when the figures are off the set target.\n\nEnsuring that analytical results are communicated to the laboratory supervisor who logs them on the laboratory daily log sheet.\n\nPumping treated water into the storage tank and supply to the consumers as per demand.\n\nEnsuring that water draughts pumps are put off if all the storage tanks are full and supply tanks are switched off when the storage tanks are empty.\n\nDetermine the optimum levels of the coagulant to be applied to highly turbid water as it comes to the Water Plant.\n\nMINIMUM REQUIREMENTS\n\nGrade 12 Certificate\n\nCertificate in Water Supply Technology\n\nMinimum 1 year experience in similar role\n\nShould you be interested in applying for any of the roles, please submit your detailed CV, copies of relevant qualifications, relevant professional accreditation, registrations and ID/Passport for the attention of the HR Business Partner to careers@zamsugar.zm clearly stating the role applied for in the subject line",
    "job_highlights": [
      {
        "items": [
          "The position reports to the Estate Maintenance Supervisor – Water Services. The successful candidate will be responsible for ensuring that consumers are supplied with quality domestic water which conforms to both NWASCO and WHO portable water standards to prevent outbreaks of water borne diseases.\n\nKEY PERFORMANCE AREAS\n\nEnsuring that the chemicals for water purification are dosed to the incoming raw water before it goes into the settling tank.\n\nDraining and cleaning the settlers to remove settled flocs in the settling tank to ensure that there are no carryovers into the filters due to high flock bed on a daily basis.\n\nCleaning the water collection troughs on a daily basis.\n\nEnsuring that filters are backwashed cleaned and disinfected using chlorine daily.\n\nEnsuring that correct quantity of disinfectant is dosed to kill germs in the filtered water.\n\nEnsuring that there are enough tablets in the brominator by physically checking daily.\n\nTesting residual chlorine levels hourly and... recording the results in the logbook.\n\nTaking corrective action when the figures are off the set target.\n\nEnsuring that analytical results are communicated to the laboratory supervisor who logs them on the laboratory daily log sheet.\n\nPumping treated water into the storage tank and supply to the consumers as per demand.\n\nEnsuring that water draughts pumps are put off if all the storage tanks are full and supply tanks are switched off when the storage tanks are empty.\n\nDetermine the optimum levels of the coagulant to be applied to highly turbid water as it comes to the Water Plant.\n\nMINIMUM REQUIREMENTS\n\nGrade 12 Certificate\n\nCertificate in Water Supply Technology\n\nMinimum 1 year experience in similar role\n\nShould you be interested in applying for any of the roles, please submit your detailed CV, copies of relevant qualifications, relevant professional accreditation, registrations and ID/Passport for the attention of the HR Business Partner to careers@zamsugar.zm clearly stating the role applied for in the subject line"
        ]
      }
    ],
    "related_links": [
      {
        "link": "http://www.illovosugarafrica.com/About-us/Zambia",
        "text": "illovosugarafrica.com/About-us/Zambia"
      },
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Zambia+Sugar&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAII0Ak",
        "text": "See web results for Zambia Sugar"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQPG_V-aZU14u4qT-3NhvRLzphn8s9VGQLCmhno&s=0",
    "extensions": [
      "5 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "5 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJXYXRlciBBdHRlbmRhbnQiLCJodGlkb2NpZCI6IkRNZzZIZUd5bkN4MTVWY1JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVV4UGJuQlpXR1owTjFkRGRXdFpSSGd6YWtkeVJVcHdjMDF4WWtkSVRGTjFWMmRCYmpSWWFIQnJWelIyVm1VM1ZHbDVhblZMYUVObmVVcGpjVEIzU0RkeE5GZDVUVkJETTNOMFF6UmFhRWxZWDBKTmFXeE1iSEZEYkRocWFYRlVSMlpHYWxSU1VuTTJSbWMwTkdWNWFUQkZlVEZ3Tm1WelNsbzVOVzUzYlROQlNDMDNjMDlDYmxack5tUk5Wek0yTWxoS0xWWldZelYwUzFjelFVcGpWV3hCRWhkSGVrNXlXbGx1UWtWemJsRTFUbTlRWDJOSFZ6SkJkeG9pUVVwM2F5MDRaWE5NT0hac00wdFVWRTkxZG05c1ZtWm9hRlpsTWsxa1lXUkpkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gR29aYW1iaWFKb2JzIiwibGluayI6Imh0dHBzOi8vZ296YW1iaWFqb2JzLmNvbS9qb2IvemFtYmlhLXN1Z2FyLW1hemFidWthLWZ1bGwtdGltZS13YXRlci1hdHRlbmRhbnQvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Plumbers",
    "company_name": "Lusaka Water Supply and Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via JobZambia",
    "description": "The Mission of Lusaka Water Supply and Sanitation Company Limited is to provide quality water and sanitation services to customers in Lusaka Province using commercially and environmentally sustainable strategies. In order to achieve this, the Company must have a human capital of dynamic and energetic staff who are performance driven and who possess the requisite competencies. In this regard, the Company is inviting applications from suitably qualified and experienced Zambians for the under listed vacant positions, on one (1) year fixed term contract.\n\nPLUMBERS\n\nReporting and Principal Responsibility\n\nThe Plumber will be directly accountable to the Superintendent responsible for minor maintenance and repair work on water distribution meters, infrastructure as well as carry out customer care functions on behalf of the company.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nKey Tasks\n\nThe specific key tasks of Plumber shall include;\n• Plumbing works at customer premises and distribution network.\n•... Responsible for the implementation of all assigned duties and submission of relevant reports.\n• Connects all assigned new water and sewer connections in adherence to set standards.\n• Excavates and prepares the site as assigned by the Superior.\n• Ensures that health, safety and environmental aspects are upheld.\n\nQUALIFICATIONS AND EXPERIENCE\n• School Certificate\n• Craft Certificate in Plumbing and Sheet Metal or Water Operations\n• One (1) year experience\n\nLusaka Water and Sewerage Company values the provision of equal employment opportunities. Therefore, women, men and persons with disability are all encouraged to apply.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nAll applications letters together with photocopies of certificates, detailed curriculum vital should reach the address below not later than 1st April 2022.\n\nDirector Human Resources and Administration\n\nLusaka Water Supply and Sanitation Company Limited,\n\nPlot No. 871, Katemo Road,\n\nRhodes Park\n\nPO BOX 50198\n\nLUSAKA",
    "job_highlights": [
      {
        "items": [
          "The Mission of Lusaka Water Supply and Sanitation Company Limited is to provide quality water and sanitation services to customers in Lusaka Province using commercially and environmentally sustainable strategies. In order to achieve this, the Company must have a human capital of dynamic and energetic staff who are performance driven and who possess the requisite competencies. In this regard, the Company is inviting applications from suitably qualified and experienced Zambians for the under listed vacant positions, on one (1) year fixed term contract.\n\nPLUMBERS\n\nReporting and Principal Responsibility\n\nThe Plumber will be directly accountable to the Superintendent responsible for minor maintenance and repair work on water distribution meters, infrastructure as well as carry out customer care functions on behalf of the company.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nKey Tasks\n\nThe specific key tasks of Plumber shall include;\n• Plumbing works at customer premises and distribution network.\n•... Responsible for the implementation of all assigned duties and submission of relevant reports.\n• Connects all assigned new water and sewer connections in adherence to set standards.\n• Excavates and prepares the site as assigned by the Superior.\n• Ensures that health, safety and environmental aspects are upheld.\n\nQUALIFICATIONS AND EXPERIENCE\n• School Certificate\n• Craft Certificate in Plumbing and Sheet Metal or Water Operations\n• One (1) year experience\n\nLusaka Water and Sewerage Company values the provision of equal employment opportunities. Therefore, women, men and persons with disability are all encouraged to apply.\n\n[xyz-ihs snippet=\"Fluid-Ad\"]\n\nAll applications letters together with photocopies of certificates, detailed curriculum vital should reach the address below not later than 1st April 2022.\n\nDirector Human Resources and Administration\n\nLusaka Water Supply and Sanitation Company Limited,\n\nPlot No. 871, Katemo Road,\n\nRhodes Park\n\nPO BOX 50198\n\nLUSAKA"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Lusaka+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAII_wk",
        "text": "See web results for Lusaka Water Supply and Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSL_AE5CzPmcQ_FoByKKWXypJ8OLMRMaZ2yTx6wF6g&s",
    "extensions": [
      "Temp work"
    ],
    "detected_extensions": {
      "schedule_type": "Temp work"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJQbHVtYmVycyIsImh0aWRvY2lkIjoiZk00eUltSHJqcGRsdVRmb0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JaYW1iaWEiLCJsaW5rIjoiaHR0cHM6Ly9qb2J6YW1iaWEuY29tL2pvYi9wbHVtYmVycy8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Site Safety Officer (X01)",
    "company_name": "Nkana Water Supply and Sanitation Company",
    "location": "  Kitwe   ",
    "via": "via Jobs Mu Zambia",
    "description": "EXTERNAL JOB OPPORTUNITIES\n\nNkana Water Supply and Sanitation Company is a Commercial Water Utility Company providing quality Water and Sanitation services to its customers in Kitwe, Kalulushi, Lufwanyama and\n\nChambishi.\n\nIn its quest to address water and sanitation challenges, NWSC has received funding from the Government of the Republic of Zambia, through the Disaster Management and Mitigation Unit to improve water and sanitation services to its customers in Kwacha Constituency.\n\nThe Company therefore, seeks to employ suitable, highly motivated and goal-oriented Human Resource to fill the following positions:\n\nSite Safety Officer (X01)\n\nJob Purpose\n\nTo supervise the adherence to safety procedures and standards during the execution of works in order to facilitate implementation of projects with safety standards.\n\nJob Accountabilities\n\n• Undertakes effectively the inspection of work sites in relation to safety in order to\n\nensure safety standards are upheld at all times\n\n• Supervises... effectively the utilization safety material resources in order to attain set\n\nobjectives.\n\nQualifications and Experience\n\n• Full Form V/Grade 12 School Certificate\n\n• Certificate in Safety and Occupational Health or its equivalent\n\n• 3 Years’ Experience\n\nSkills, Knowledge and Other Attributes\n\n• Ability to write reports\n\n• Ability to communicate effectively in English.\n\nNWSC is an equal opportunity employer, therefore both Female and Male candidates are encouraged to apply. Interested applicants who are suitably qualified and experienced for the\n\nabove positions should submit their applications with copies of certified certificates, detailed Curriculum Vitae (CV) with the names of three referees to the undersigned no later than 21st\n\nDecember 2022.\n\nDirector of Human Resources and Administration Services\n\nNkana Water Supply and Sanitation Company\n\nMutondo Crescent\n\nOff Freedom Way\n\nRiverside\n\nP.O. Box 20982\n\nKITWE\n\nEmail: recruitment@nwsc.com.zm\n\nOnly shortlisted candidates who meet the requirements will be communicated to",
    "job_highlights": [
      {
        "items": [
          "EXTERNAL JOB OPPORTUNITIES\n\nNkana Water Supply and Sanitation Company is a Commercial Water Utility Company providing quality Water and Sanitation services to its customers in Kitwe, Kalulushi, Lufwanyama and\n\nChambishi.\n\nIn its quest to address water and sanitation challenges, NWSC has received funding from the Government of the Republic of Zambia, through the Disaster Management and Mitigation Unit to improve water and sanitation services to its customers in Kwacha Constituency.\n\nThe Company therefore, seeks to employ suitable, highly motivated and goal-oriented Human Resource to fill the following positions:\n\nSite Safety Officer (X01)\n\nJob Purpose\n\nTo supervise the adherence to safety procedures and standards during the execution of works in order to facilitate implementation of projects with safety standards.\n\nJob Accountabilities\n\n• Undertakes effectively the inspection of work sites in relation to safety in order to\n\nensure safety standards are upheld at all times\n\n• Supervises... effectively the utilization safety material resources in order to attain set\n\nobjectives.\n\nQualifications and Experience\n\n• Full Form V/Grade 12 School Certificate\n\n• Certificate in Safety and Occupational Health or its equivalent\n\n• 3 Years’ Experience\n\nSkills, Knowledge and Other Attributes\n\n• Ability to write reports\n\n• Ability to communicate effectively in English.\n\nNWSC is an equal opportunity employer, therefore both Female and Male candidates are encouraged to apply. Interested applicants who are suitably qualified and experienced for the\n\nabove positions should submit their applications with copies of certified certificates, detailed Curriculum Vitae (CV) with the names of three referees to the undersigned no later than 21st\n\nDecember 2022.\n\nDirector of Human Resources and Administration Services\n\nNkana Water Supply and Sanitation Company\n\nMutondo Crescent\n\nOff Freedom Way\n\nRiverside\n\nP.O. Box 20982\n\nKITWE\n\nEmail: recruitment@nwsc.com.zm\n\nOnly shortlisted candidates who meet the requirements will be communicated to"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Nkana+Water+Supply+and+Sanitation+Company&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIIrAo",
        "text": "See web results for Nkana Water Supply and Sanitation Company"
      }
    ],
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJTaXRlIFNhZmV0eSBPZmZpY2VyIChYMDEpIiwiaHRpZG9jaWQiOiJ4b1JoT0hHbmNmOUU4SC1TQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoiem0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IGRpcmVjdGx5IG9uIEpvYnMgTXUgWmFtYmlhIiwibGluayI6Imh0dHBzOi8vam9ic211emFtYmlhLmNvbS9qb2Ivc2l0ZS1zYWZldHktb2ZmaWNlci14MDEvP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
  },
  {
    "title": "Assistant Engineer",
    "company_name": "Mulonga Water Supply & Sanitation Company Limited",
    "location": "  Lusaka   ",
    "via": "via Great Zambia Jobs",
    "description": "JOB DETAILS:\n\nJob Purpose\nReporting to the Implementation Engineer – Civil, the job holder shall be responsible for supervising construction programs for both in-house and contracted. These will include water Networks, water treatment works and Sewer networks.\n\nSummary of Main Accountabilities\nEnsure Contractor submits a detailed program of works including all critical working drawings, constantly monitoring project cost, quality and time.\n• Hold progress meetings on site after inspection of works.\n• Ensure contractor has adequate levels of deployment of staff, plant and equipment on site for speedy implementation of the works.\n• Ensure adherence to contract provisions by contractors and consultants.\n• Submit monthly progress updates complete with labour, plant and equipment returns.\n• Review all payment claims and recommend for payment.\n• Prepare detailed measurement sheets for quantities done on site to be used for payments\n• Overseeing quality control, health and safety matters on... site\n• Ensuring that all materials used and work performed are as per specifications\n\nKnowledge and Skill Requirements:\n• Grade 12 with 5 O Levels\n• Degree in Civil/Water Engineering or Related\n• At least 2 years of experience\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Registered Engineer with the Engineering Registration Board (ERB) and Member of the Engineering Institution of Zambia (EIZ).\n• Able to use project management software and CAD\n• Should have traceable design and project supervisory skills\n• Should be a team player with good Interpersonal skills\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree",
    "job_highlights": [
      {
        "items": [
          "JOB DETAILS:\n\nJob Purpose\nReporting to the Implementation Engineer – Civil, the job holder shall be responsible for supervising construction programs for both in-house and contracted. These will include water Networks, water treatment works and Sewer networks.\n\nSummary of Main Accountabilities\nEnsure Contractor submits a detailed program of works including all critical working drawings, constantly monitoring project cost, quality and time.\n• Hold progress meetings on site after inspection of works.\n• Ensure contractor has adequate levels of deployment of staff, plant and equipment on site for speedy implementation of the works.\n• Ensure adherence to contract provisions by contractors and consultants.\n• Submit monthly progress updates complete with labour, plant and equipment returns.\n• Review all payment claims and recommend for payment.\n• Prepare detailed measurement sheets for quantities done on site to be used for payments\n• Overseeing quality control, health and safety matters on... site\n• Ensuring that all materials used and work performed are as per specifications\n\nKnowledge and Skill Requirements:\n• Grade 12 with 5 O Levels\n• Degree in Civil/Water Engineering or Related\n• At least 2 years of experience\n• Valid Driver’s License with minimum of 2 years’ experience (Ability to Drive Manual Vehicle)\n• Registered Engineer with the Engineering Registration Board (ERB) and Member of the Engineering Institution of Zambia (EIZ).\n• Able to use project management software and CAD\n• Should have traceable design and project supervisory skills\n• Should be a team player with good Interpersonal skills\n\nJob Experience:No Requirements\n\nWork Hours: 8\n\nLevel of Education: Bachelor Degree"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Mulonga+Water+Supply+%26+Sanitation+Company+Limited&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAII2go",
        "text": "See web results for Mulonga Water Supply & Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKdRlweZdtuU1M-vhLRcNLx6YTazypQ4g2omJwONES_8OVjbn-0Mxzbag&s",
    "extensions": [
      "Full-time"
    ],
    "detected_extensions": {
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJBc3Npc3RhbnQgRW5naW5lZXIiLCJodGlkb2NpZCI6IlFRRUh1LXNHTENOMUp5YzhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gR3JlYXQgWmFtYmlhIEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZ3JlYXR6YW1iaWFqb2JzLmNvbS9qb2JzL2pvYi1kZXRhaWwvam9iLUFzc2lzdGFudC1FbmdpbmVlci1qb2ItYXQtTXVsb25nYS1XYXRlci1TdXBwbHktU2FuaXRhdGlvbi1Db21wYW55LUxpbWl0ZWQtNDQ1MzQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Various Positions x53",
    "company_name": "Lukanga Water Supply and Sanitation Company Limited",
    "location": "  Zambia   ",
    "via": "via Zedcareers.com",
    "description": "LUKANGA WATER SUPPLY & SANITATION COMPANY LIMITED\n\nEMPLOYMENT OPPORTUNITY\n\nADVERT\n\nLukanga Water Supply & Sanitation Company Limited (LgWSC) is a private Company established under the Companies’ Act No 10 of 2017. It was incorporated on 21st March 2006 as a Commercial Water Utility (CU) Limited by shares wholly owned by the Local Authorities in Central Province. The CU was established as part of the GRZ water sub-sector reforms to improve delivery of water supply and sanitation services in the Province. LgWSC is an equal-opportunity employer and does not therefore segregate on any grounds.\n\nIn order to fulfill this mandate, the Company has placed emphasis on delivering an excellent service to both its external and internal customers. The Company seeks individuals who are ready to join the crusade towards effective and efficient delivery of services to our esteemed customers in the most professional way. Applications are therefore, invited from suitably qualified persons with... performance based backgrounds to staff the following vacancies;\n\n1. Legal Assistant (Grade L5; Required No: 1)\n\nJob Purpose\n\nTo assist the Company in the provision of legal services by developing case information, evidence, and settlement options; tracking cases; supporting and participating in trial proceedings and keeping all legal records properly.\n\nRequirements\n\nGrade 12 Certificate\nMinimum professional qualifications.\nDiploma in Law or any related field\nRelevant work experience.\nOne year experience in an established organisation.\nRequired competencies and personal attributes:\n\nMust be of Reporting Skills, Research Skills, Legal Administration Skills, Litigation, Client Relationships, Organization, Planning, Attention to Detail, Confidentiality, Dependability, Client Confidentiality\n2. MAINTENANCE SUPERINTENDENT (Grade L5; Required No: 1)\n\nRequirements\n\nGrade 12 Full School Certificate.\nDiploma in Mechanical / Electrical Engineering or any related\n2 years work experience in a similar position in a reputable organization.\nFresh graduates may be considered as Management Trainees.\nMust be in possession of a valid practicing license of the Engineering Institution of Zambia (EIZ ERB).\nMust be able to work with minimum supervision.\nA valid driver’s license is a must.\n3. Driver (Grade L8; Required No. 2)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Auto Mechanics from a reputable institution\nAt least 2 years’ experience in plant maintenance will be an added advantage.\nMust have a traceable ability to work with minimum supervision.\nAbility to operate earth moving equipment will be an added advantage.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license class C is a must.\n4. Mechanical FITTER (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in mechanical fitting or equivalent from a reputable Institution.\nAt least 2 years’ experience in plant maintenance will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license is a must.\n5. AUTO ELECTRICIAN (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Electrical Auto Mechanics or equivalent from a reputable Institution.\nAt least 2 years’ experience in a similar position.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ).\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license is a must.\n6. CUSTOMER SERVICE ASSISTANT (grade L7; Required 6)\n\nRequirement\n\nGrade 12 Certificate\nCraft Certificate in Plumbing and Sheet Metal from a reputable Institution\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nAble to make simple calculations accurately and communicate with superiors and customers\n1 year work experience\nCourtesy as deals with a number of customers\n7. ARTISAN PLUMBERS (Grade L7; Required No: 12)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Plumbing and Sheet Metal from a reputable Institution.\nAt least 2 years experience in similar position.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\n8. PLANT OPERATORS (Grade L7; Required No: 12)\n\nRequirements\n\nGrade 12 Certificate.\nCraft Certificate in Water and Sewerage Operations, Electrical or Mechanical from a reputable institution.\nFresh graduates may also be considered as Management Trainees.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\n2 years work experience.\nIn depth practical knowledge of Water and Sewerage plant operations.\n9. PLANT ATTENDANTS (Grade L8; Required No: 6)\n\nRequirements\n\nGrade 12 Certificate.\nTrade Test in plumbing, fitting, water operations or equivalent.\n1 year work experience.\nTraceable experience in the water sector will be an added advantage.\n10. Boiler Maker (Grade L7; Required No:2)\n\nRequirements\n\nGrade 12 Certificate\nCertificate in Metal fabrication\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nAt least 2 years experience\n11. SANITARY ATTENDANTS (Grade L8; Required No: 8)\n\nRequirements\n\nGrade 12 Certificate.\nTrade Test in plumbing, fitting, water operations or equivalent.\n1 year work experience.\nFreshly tested graduates will also be considered.\nTraceable experience in the water sector will be an added advantage.\n12. General Worker (Grade L9; Required No: 3)\n\nRequirements\n\nGrade 12 Certificate.\n1 year work experience.\nTraceable experience in the water sector will be an added advantage.\n\nIf you meet the above requirements, address your letter of application with current CV including references and copies of relevant academic professional documents to;\n\nThe Human Resource and Administration Manager\n\nLukanga Water Supply and Sanitation Company Limited,\n\nLukanga Water House,\n\nMunkoyo Street,\n\nP. O Box 81745,\n\nKABWE\n\nYour envelope should be marked “Application for Employment (position)” and posted or delivered before or by Friday 30th November, 2023. The Company reserves the right to adjust on the required number for any position.\n\nWater for Life!\n\nResilience, Reliability and Efficiency for Business Growth",
    "job_highlights": [
      {
        "items": [
          "LUKANGA WATER SUPPLY & SANITATION COMPANY LIMITED\n\nEMPLOYMENT OPPORTUNITY\n\nADVERT\n\nLukanga Water Supply & Sanitation Company Limited (LgWSC) is a private Company established under the Companies’ Act No 10 of 2017. It was incorporated on 21st March 2006 as a Commercial Water Utility (CU) Limited by shares wholly owned by the Local Authorities in Central Province. The CU was established as part of the GRZ water sub-sector reforms to improve delivery of water supply and sanitation services in the Province. LgWSC is an equal-opportunity employer and does not therefore segregate on any grounds.\n\nIn order to fulfill this mandate, the Company has placed emphasis on delivering an excellent service to both its external and internal customers. The Company seeks individuals who are ready to join the crusade towards effective and efficient delivery of services to our esteemed customers in the most professional way. Applications are therefore, invited from suitably qualified persons with... performance based backgrounds to staff the following vacancies;\n\n1. Legal Assistant (Grade L5; Required No: 1)\n\nJob Purpose\n\nTo assist the Company in the provision of legal services by developing case information, evidence, and settlement options; tracking cases; supporting and participating in trial proceedings and keeping all legal records properly.\n\nRequirements\n\nGrade 12 Certificate\nMinimum professional qualifications.\nDiploma in Law or any related field\nRelevant work experience.\nOne year experience in an established organisation.\nRequired competencies and personal attributes:\n\nMust be of Reporting Skills, Research Skills, Legal Administration Skills, Litigation, Client Relationships, Organization, Planning, Attention to Detail, Confidentiality, Dependability, Client Confidentiality\n2. MAINTENANCE SUPERINTENDENT (Grade L5; Required No: 1)\n\nRequirements\n\nGrade 12 Full School Certificate.\nDiploma in Mechanical / Electrical Engineering or any related\n2 years work experience in a similar position in a reputable organization.\nFresh graduates may be considered as Management Trainees.\nMust be in possession of a valid practicing license of the Engineering Institution of Zambia (EIZ ERB).\nMust be able to work with minimum supervision.\nA valid driver’s license is a must.\n3. Driver (Grade L8; Required No. 2)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Auto Mechanics from a reputable institution\nAt least 2 years’ experience in plant maintenance will be an added advantage.\nMust have a traceable ability to work with minimum supervision.\nAbility to operate earth moving equipment will be an added advantage.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license class C is a must.\n4. Mechanical FITTER (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in mechanical fitting or equivalent from a reputable Institution.\nAt least 2 years’ experience in plant maintenance will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license is a must.\n5. AUTO ELECTRICIAN (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Electrical Auto Mechanics or equivalent from a reputable Institution.\nAt least 2 years’ experience in a similar position.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ).\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\nA valid driver’s license is a must.\n6. CUSTOMER SERVICE ASSISTANT (grade L7; Required 6)\n\nRequirement\n\nGrade 12 Certificate\nCraft Certificate in Plumbing and Sheet Metal from a reputable Institution\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nAble to make simple calculations accurately and communicate with superiors and customers\n1 year work experience\nCourtesy as deals with a number of customers\n7. ARTISAN PLUMBERS (Grade L7; Required No: 12)\n\nRequirements\n\nGrade 12 School Certificate.\nCraft Certificate in Plumbing and Sheet Metal from a reputable Institution.\nAt least 2 years experience in similar position.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nMust have a traceable ability to work with minimum supervision.\nMust be physically fit as the job involves extended periods of physical efforts.\n8. PLANT OPERATORS (Grade L7; Required No: 12)\n\nRequirements\n\nGrade 12 Certificate.\nCraft Certificate in Water and Sewerage Operations, Electrical or Mechanical from a reputable institution.\nFresh graduates may also be considered as Management Trainees.\nComputer literacy will be an added advantage.\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\n2 years work experience.\nIn depth practical knowledge of Water and Sewerage plant operations.\n9. PLANT ATTENDANTS (Grade L8; Required No: 6)\n\nRequirements\n\nGrade 12 Certificate.\nTrade Test in plumbing, fitting, water operations or equivalent.\n1 year work experience.\nTraceable experience in the water sector will be an added advantage.\n10. Boiler Maker (Grade L7; Required No:2)\n\nRequirements\n\nGrade 12 Certificate\nCertificate in Metal fabrication\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\nAt least 2 years experience\n11. SANITARY ATTENDANTS (Grade L8; Required No: 8)\n\nRequirements\n\nGrade 12 Certificate.\nTrade Test in plumbing, fitting, water operations or equivalent.\n1 year work experience.\nFreshly tested graduates will also be considered.\nTraceable experience in the water sector will be an added advantage.\n12. General Worker (Grade L9; Required No: 3)\n\nRequirements\n\nGrade 12 Certificate.\n1 year work experience.\nTraceable experience in the water sector will be an added advantage.\n\nIf you meet the above requirements, address your letter of application with current CV including references and copies of relevant academic professional documents to;\n\nThe Human Resource and Administration Manager\n\nLukanga Water Supply and Sanitation Company Limited,\n\nLukanga Water House,\n\nMunkoyo Street,\n\nP. O Box 81745,\n\nKABWE\n\nYour envelope should be marked “Application for Employment (position)” and posted or delivered before or by Friday 30th November, 2023. The Company reserves the right to adjust on the required number for any position.\n\nWater for Life!\n\nResilience, Reliability and Efficiency for Business Growth"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Lukanga+Water+Supply+and+Sanitation+Company+Limited&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIIiAs",
        "text": "See web results for Lukanga Water Supply and Sanitation Company Limited"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ54ICeTroNKhmo_ORoQ1O2kmbCrZ5c6jqaowVES-Y&s",
    "extensions": [
      "5 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "5 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJWYXJpb3VzIFBvc2l0aW9ucyB4NTMiLCJodGlkb2NpZCI6ImRPdDVjTlBJbk82YkJjZ2dBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ6bSIsImhsIjoiZW4iLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gWmVkY2FyZWVycy5jb20iLCJsaW5rIjoiaHR0cHM6Ly96ZWRjYXJlZXJzLmNvbS9pbmRleC5waHAvam9iL2x1a2FuZ2Etd2F0ZXItc3VwcGx5LWFuZC1zYW5pdGF0aW9uLWNvbXBhbnktbGltaXRlZC16YW1iaWEtZnVsbC10aW1lLXZhcmlvdXMtcG9zaXRpb25zLXg1My8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
  },
  {
    "title": "Mechanical Fitter",
    "company_name": "Lukanga Water Supply & Sanitation Company Limited (LgWSC)",
    "location": "  Kabwe   ",
    "via": "via Jobs Mu Zambia",
    "description": "LUKANGA WATER SUPPLY & SANITATION COMPANY LIMITED\n\nEMPLOYMENT OPPORTUNITY\n\nADVERT\n\nLukanga Water Supply & Sanitation Company Limited (LgWSC) is a private Company established under the Companies’ Act No 10 of 2017. It was incorporated on 21st March 2006 as a Commercial Water Utility (CU) Limited by shares wholly owned by the Local Authorities in Central Province. The CU was established as part of the GRZ water sub-sector reforms to improve delivery of water supply and sanitation services in the Province. LgWSC is an equal-opportunity employer and does not therefore segregate on any grounds.\n\nIn order to fulfill this mandate, the Company has placed emphasis on delivering an excellent service to both its external and internal customers. The Company seeks individuals who are ready to join the crusade towards effective and efficient delivery of services to our esteemed customers in the most professional way. Applications are therefore, invited from suitably qualified persons with... performance based backgrounds to staff the following vacancies;\n\n4. Mechanical FITTER (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\n\nCraft Certificate in mechanical fitting or equivalent from a reputable Institution.\n\nAt least 2 years’ experience in plant maintenance will be an added advantage.\n\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\n\nMust have a traceable ability to work with minimum supervision.\n\nMust be physically fit as the job involves extended periods of physical efforts.\n\nA valid driver’s license is a must.\n\nIf you meet the above requirements, address your letter of application with current CV including references and copies of relevant academic professional documents to;\n\nThe Human Resource and Administration Manager\n\nLukanga Water Supply and Sanitation Company Limited,\n\nLukanga Water House,\n\nMunkoyo Street,\n\nP. O Box 81745,\n\nKABWE\n\nYour envelope should be marked “Application for Employment (position)” and posted or delivered before or by Friday 30th November, 2023. The Company reserves the right to adjust on the required number for any position.\n\nWater for Life!\n\nResilience, Reliability and Efficiency for Business Growth",
    "job_highlights": [
      {
        "items": [
          "LUKANGA WATER SUPPLY & SANITATION COMPANY LIMITED\n\nEMPLOYMENT OPPORTUNITY\n\nADVERT\n\nLukanga Water Supply & Sanitation Company Limited (LgWSC) is a private Company established under the Companies’ Act No 10 of 2017. It was incorporated on 21st March 2006 as a Commercial Water Utility (CU) Limited by shares wholly owned by the Local Authorities in Central Province. The CU was established as part of the GRZ water sub-sector reforms to improve delivery of water supply and sanitation services in the Province. LgWSC is an equal-opportunity employer and does not therefore segregate on any grounds.\n\nIn order to fulfill this mandate, the Company has placed emphasis on delivering an excellent service to both its external and internal customers. The Company seeks individuals who are ready to join the crusade towards effective and efficient delivery of services to our esteemed customers in the most professional way. Applications are therefore, invited from suitably qualified persons with... performance based backgrounds to staff the following vacancies;\n\n4. Mechanical FITTER (Grade L7; Required No: 1)\n\nRequirements\n\nGrade 12 School Certificate.\n\nCraft Certificate in mechanical fitting or equivalent from a reputable Institution.\n\nAt least 2 years’ experience in plant maintenance will be an added advantage.\n\nMust be a member of the Engineering Institution of Zambia (EIZ) with a valid practicing license.\n\nMust have a traceable ability to work with minimum supervision.\n\nMust be physically fit as the job involves extended periods of physical efforts.\n\nA valid driver’s license is a must.\n\nIf you meet the above requirements, address your letter of application with current CV including references and copies of relevant academic professional documents to;\n\nThe Human Resource and Administration Manager\n\nLukanga Water Supply and Sanitation Company Limited,\n\nLukanga Water House,\n\nMunkoyo Street,\n\nP. O Box 81745,\n\nKABWE\n\nYour envelope should be marked “Application for Employment (position)” and posted or delivered before or by Friday 30th November, 2023. The Company reserves the right to adjust on the required number for any position.\n\nWater for Life!\n\nResilience, Reliability and Efficiency for Business Growth"
        ]
      }
    ],
    "related_links": [
      {
        "link": "https://www.google.com/search?sca_esv=587289322&gl=zm&q=Lukanga+Water+Supply+%26+Sanitation+Company+Limited+(LgWSC)&sa=X&ved=0ahUKEwjJus3k7_CCAxVJKFkFHf2gBcs4FBCYkAIItws",
        "text": "See web results for Lukanga Water Supply & Sanitation Company Limited (LgWSC)"
      }
    ],
    "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSSJiACEF-G5WshBURqkZFULzvLXeRZLRilkITaecg&s",
    "extensions": [
      "5 days ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "5 days ago",
      "schedule_type": "Full-time"
    },
    "job_id": "eyJqb2JfdGl0bGUiOiJNZWNoYW5pY2FsIEZpdHRlciIsImh0aWRvY2lkIjoiRk81dDhzc3FIX0pFSkVvdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InptIiwiaGwiOiJlbiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBKb2JzIE11IFphbWJpYSIsImxpbmsiOiJodHRwczovL2pvYnNtdXphbWJpYS5jb20vam9iL21lY2hhbmljYWwtZml0dGVyLTExLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
  }
]